[
  {
    "Name": "Acadia",
    "Description": "Nestled along the rugged coastline of Maine, Acadia National Park captivates outdoor enthusiasts with its breathtaking blend of granite peaks, clear lakes, dense woodlands, and dramatic oceanfront vistas. Spanning much of Mount Desert Island and several smaller coastal isles, the park hosts diverse ecosystems, featuring freshwater, estuary, forest, and intertidal environments. Its celebrated Cadillac Mountain is the tallest mountain on the Atlantic coast of the United States and is among the first places to witness the sunrise during certain times of the year.\n\nAcadia's extensive network of over 150 miles of trails caters to hikers of every skill level, from gentle shoreline strolls to challenging summit climbs. Historic carriage roads crisscross the park, ideal for biking or leisurely walks with picturesque stone bridges and expansive views. Water lovers can delight in kayaking along the coast or savoring a peaceful moment at Jordan Pond. Wildlife watchers may spot peregrine falcons, white-tailed deer, or seals enjoying the rocky shoreline.\n\nBeyond its natural splendor, the park invites visitors to engage with its rich cultural tapestry, from the traditions of the Wabanaki people to early 20th-century conservation efforts. Whether you're chasing adventure, tranquility, or a connection to the wilds of coastal New England, Acadia National Park offers something genuinely special for every visitor.",
    "Location": "44.35,-68.21",
    "Established": "February 26, 1919",
    "Area": "49,071.40 acres (198.6 km2)",
    "Annual_Visitors": 3970260,
    "Latitude": 44.35,
    "Longitude": -68.21,
    "AllTrails URL": "https://www.alltrails.com/parks/us/maine/acadia-national-park",
    "Map Link": "https://www.nps.gov/media/photo/collection-item.htm?pg=7323739&cid=305fb7af-a71b-469b-941e-a98b439c882f&id=1cd3d4aa-098b-47d3-94fd-85ff6f09dd95&sid=970f5fb5-9f0e-41fc-be95-7f8cd56c2a98&p=1&sort=relevance | https://www.nps.gov/media/photo/collection-item.htm?pg=7323739&cid=305fb7af-a71b-469b-941e-a98b439c882f&id=c1d90731-8b77-4740-9ed2-98f94298b986&sid=970f5fb5-9f0e-41fc-be95-7f8cd56c2a98&p=1&sort=relevance | https://www.nps.gov/media/photo/collection-item.htm?pg=7323739&cid=305fb7af-a71b-469b-941e-a98b439c882f&id=d525b116-93e8-4dd9-b489-2f273b3bc39d&sid=970f5fb5-9f0e-41fc-be95-7f8cd56c2a98&p=1&sort=relevance | https://www.nps.gov/media/photo/collection-item.htm?pg=7323739&cid=305fb7af-a71b-469b-941e-a98b439c882f&id=132ea4e6-d44e-4b39-8b10-b0736881a693&sid=970f5fb5-9f0e-41fc-be95-7f8cd56c2a98&p=1&sort=relevance",
    "Map Type": "Multiple Park Maps"
  },
  {
    "Name": "American Samoa",
    "Description": "Positioned in the heart of the South Pacific, the National Park of American Samoa presents an extraordinary meld of untamed tropical wilderness, vibrant Samoan culture, and varied ecosystems. Spread across three islands—Tutuila, Ofu, and Ta‘ū—this remote park features lush rainforests, majestic volcanic peaks, crystal-clear waters, and pristine white sand beaches. Its bustling coral reefs, home to over 900 species of fish and various marine creatures, including sea turtles, make for a snorkeling paradise.\n\nFor wildlife enthusiasts, the park is a sanctuary. Keep an eye out for the impressive flying foxes, large fruit bats pivotal in pollinating the rainforest. Birdwatchers can enjoy spotting brown boobies, white terns, and other sea and forest birds thriving in this virtually untouched environment. The park’s diverse terrain offers ample hiking opportunities, with trails winding through dense rainforests to splendid viewpoints overlooking the coastline and ocean.\n\nBeyond its natural marvels, the park is deeply connected to the cultural heritage of the Samoan people, who have harmoniously coexisted with these lands and waters for millennia. Visitors can immerse themselves in the traditional fa’a Samoa lifestyle, which promotes respect for family, community, and the natural world. Whether surveying ancient volcanic landscapes, unwinding on serene beaches, or delving into local culture, this southernmost U.S. national park offers an unforgettable experience for nature lovers and outdoor enthusiasts alike.",
    "Location": "-14.25,-170.68",
    "Established": "October 31, 1988",
    "Area": "8,256.67 acres (33.4 km2)",
    "Annual_Visitors": 12135,
    "Latitude": -14.25,
    "Longitude": -170.68,
    "AllTrails URL": "https://www.alltrails.com/parks/american-samoa/national-park-of-american-samoa",
    "Map Link": "https://www.nps.gov/media/photo/collection-item.htm?pg=7323739&cid=305fb7af-a71b-469b-941e-a98b439c882f&id=58b16aee-da36-4476-8a1e-5dedb87267fb&sid=fffb07a3-2679-422b-8101-002808988853&p=1&sort=relevance | https://www.nps.gov/media/photo/collection-item.htm?pg=7323739&cid=305fb7af-a71b-469b-941e-a98b439c882f&id=0e3794e8-0012-4706-9453-c570db38f886&sid=fffb07a3-2679-422b-8101-002808988853&p=1&sort=relevance | https://www.nps.gov/media/photo/collection-item.htm?pg=7323739&cid=305fb7af-a71b-469b-941e-a98b439c882f&id=14357be2-4ffc-4d0f-a38f-27bfda28b35f&sid=fffb07a3-2679-422b-8101-002808988853&p=1&sort=relevance",
    "Map Type": "Multiple Park Maps"
  },
  {
    "Name": "Arches",
    "Description": "Set amidst Utah's high desert, Arches National Park hosts a stunning array of over 2,000 natural sandstone arches, earning its place as one of the most remarkable landscapes globally. This renowned park boasts notable landmarks like Delicate Arch, a freestanding wonder often heralded as its crown jewel, the slim Landscape Arch, and the extraordinary double curve of Double Arch. Besides its arches, the park also features striking geologic formations like towering pinnacles, slender rock fins, and gravity-defying balanced rocks, providing a feast for the eyes.\n\nArches' breathtaking scenery is shaped by millions of years of erosion and a desert climate that has chiseled this wonderland. Visitors will notice the biological soil crusts crucial for sustaining life in this environment. These living soil formations help fight erosion, conserve water, and support plant life. Also found within the park are \"potholes,\" natural rock depressions that pool water, supporting miniature ecosystems for desert life.\n\nOutdoor enthusiasts have plenty to explore, from tranquil lookouts accessible by road to challenging paths like Devil's Garden, which leads hikers deep into the park's rugged backcountry to discover rugged arches and dramatic rock structures. Sunrise and sunset showcase the park's red rocks in warm, shifting colors. Whether you're in search of a leisurely exploration or an adventurous trek, Arches promises an unbeatable journey through the heart of the desert's raw, sculptural beauty.",
    "Location": "38.68,-109.57",
    "Established": "November 12, 1971",
    "Area": "76,678.98 acres (310.3 km2)",
    "Annual_Visitors": 1460652,
    "Latitude": 38.68,
    "Longitude": -109.57,
    "AllTrails URL": "https://www.alltrails.com/parks/us/utah/arches-national-park",
    "Map Link": "https://www.nps.gov/media/photo/collection-item.htm?pg=7323739&cid=305fb7af-a71b-469b-941e-a98b439c882f&id=6aefc09f-6995-41df-abf6-54896840430d&sid=fd1c8d80-3025-47cc-927a-fdc5d3d55acf&p=1&sort=relevance",
    "Map Type": "Park Map"
  },
  {
    "Name": "Badlands",
    "Description": "The Badlands, situated in southwestern South Dakota's White River drainage basin, boast a dramatic landscape shaped over millions of years. This unique ensemble of buttes, pinnacles, spires, and expansive mixed-grass prairies creates an unforgettable backdrop for exploring the outdoors. Celebrated for its scenic vistas and diverse ecosystems, the park is particularly hailed for housing the largest known collection of late Eocene and Oligocene mammal fossils, making it a hotspot for paleontology fans.\n\nFor nature and wildlife enthusiasts, the Badlands are a refuge for diverse species. Visitors might come across bison herds grazing across the open grasslands, glimpse agile bighorn sheep on rocky slopes, or spot elusive black-footed ferrets, North America's rarest mammals. Prairie dogs, with their intricate underground societies, add an additional dimension of ecological interest.\n\nIdeal for campers and backcountry hikers, the park presents myriad opportunities for adventure and solitude. Trails and open areas encourage exploration, whether it's trekking across stark badland formations or soaking in the serenity of prairie landscapes. With its combination of spectacular geology, rich fossil heritage, and thriving wildlife, the Badlands promise an unforgettable experience for those drawn to the natural world.",
    "Location": "43.75,-102.50",
    "Established": "November 10, 1978",
    "Area": "242,755.94 acres (982.4 km2)",
    "Annual_Visitors": 1006809,
    "Latitude": 43.75,
    "Longitude": -102.5,
    "AllTrails URL": "https://www.alltrails.com/parks/us/south-dakota/badlands-national-park",
    "Map Link": "https://www.nps.gov/media/photo/collection-item.htm?pg=7323739&cid=305fb7af-a71b-469b-941e-a98b439c882f&id=0dcec1e8-2033-4c6c-902e-0598aa07e7e7&sid=f3267ad0-b21f-4bd9-ba15-f5f99fda2612&p=1&sort=relevance",
    "Map Type": "Park Map"
  },
  {
    "Name": "Big Bend",
    "Description": "Big Bend National Park is a treasure trove for outdoor enthusiasts, offering a mix of striking landscapes, varied ecosystems, and boundless opportunities for exploration. Located in a remote corner of West Texas, the park derives its name from the sweeping curve of the Rio Grande marking its southern frontier, forming a natural border between the United States and Mexico. Spanning over 800,000 acres, it encompasses Chihuahuan Desert expanses, dramatic canyon walls, and the rugged Chisos Mountains.\n\nThe park is famed for its backcountry experiences, with a variety of hiking and camping options suitable for all—from beginner-friendly routes to challenging wilderness adventures. Trails lead explorers through arid lowlands, lush mountain canyons, and along the winding Rio Grande, offering stunning vistas and opportunities to encounter plant and animal species unique to this region. Big Bend’s isolation results in some of the clearest night skies, perfect for stargazing.\n\nGeologically rich, the park harbors an impressive fossil record, including Cretaceous and Tertiary finds like dinosaur bones and ancient marine life. Archaeological sites reveal evidence of human habitation dating back thousands of years, uncovering artifacts from Native American peoples who once thrived here.\n\nWhether you're compelled by the ascent of Emory Peak, paddling through Santa Elena Canyon’s towering limestone walls, or soaking in the desert's solitude and grand vistas, Big Bend offers a distinct blend of adventure, history, and natural beauty. Explore its diverse landscapes to understand why this remote haven is a favorite among those seeking a deeper connection with the wilderness.",
    "Location": "29.25,-103.25",
    "Established": "June 12, 1944",
    "Area": "801,163.21 acres (3,242.2 km2)",
    "Annual_Visitors": 514107,
    "Latitude": 29.25,
    "Longitude": -103.25,
    "AllTrails URL": "https://www.alltrails.com/parks/us/texas/big-bend-national-park",
    "Map Link": "https://www.nps.gov/media/photo/collection-item.htm?pg=7323739&cid=305fb7af-a71b-469b-941e-a98b439c882f&id=a1647b7e-fdee-4350-891a-afbd28331d1c&sid=37f6c99b-3df4-43b8-bd7f-b72cc502a603&p=1&sort=relevance",
    "Map Type": "Park Map"
  },
  {
    "Name": "Biscayne",
    "Description": "Biscayne National Park offers outdoor enthusiasts a truly unique experience, with most of its wonders lying beneath the water's surface. Positioned at the northern tip of the Florida Keys, the park is a paradise for adventurers interested in diverse marine environments through activities like snorkeling, boating, and kayaking. The park encompasses four interconnected habitats: lively coral reefs rich with marine life, lush mangrove forests essential for nurturing fish and wildlife, Biscayne Bay's clear waters, and the islands of the Florida Keys, each with its own ecological identity.\n\nThe park supports a diverse array of wildlife, including several federally threatened or endangered species. Visitors might spot the gentle West Indian manatee, the elusive American crocodile, or sea turtles such as the green and loggerhead varieties. Birdwatchers can also anticipate sightings of the peregrine falcon, the swiftest bird in flight.\n\nBeyond its natural allure, Biscayne holds a fascinating intersection of history and culture. The islands and waters bear remnants of human activity spanning thousands of years, from ancient indigenous settlements to shipwrecks that narrate tales of maritime exploits and accidents. With over 95% of the park underwater, it provides an unparalleled opportunity to uncover a vibrant underwater realm where colorful coral formations and tropical fish thrive.\n\nWhether venturing through calm waters by boat, snorkeling among the reefs, or hiking along mangroves, Biscayne National Park is an incredible venue for discovery, relaxation, and adventure. It serves as a testament to the intricate ties between land, sea, and life, making it an essential visit for anyone captivated by nature and the outdoors.",
    "Location": "25.65,-80.08",
    "Established": "June 28, 1980",
    "Area": "172,971.11 acres (700.0 km2)",
    "Annual_Visitors": 701023,
    "Latitude": 25.65,
    "Longitude": -80.08,
    "AllTrails URL": "https://www.alltrails.com/parks/us/florida/biscayne-national-park",
    "Map Link": "https://www.nps.gov/media/photo/collection-item.htm?pg=7323739&cid=305fb7af-a71b-469b-941e-a98b439c882f&id=17a58f6c-3201-460b-8dd7-e69be6860896&sid=a9b0eb59-21d5-4ddb-88fa-98de97c3bb1b&p=1&sort=relevance",
    "Map Type": "Park Map"
  },
  {
    "Name": "Black Canyon of the Gunnison",
    "Description": "Carved by millions of years of geological forces, Black Canyon of the Gunnison National Park displays one of the most striking landscapes in North America. The park contains incredibly steep, narrow canyons where towering cliffs plunge dramatically into the Gunnison River below. These sheer walls of Precambrian-era gneiss and schist, some of the oldest exposed rock on the continent, appear almost black when cloaked in shadow, giving the canyon its name.\n\nThis rugged terrain offers a distinct sense of solitude and adventure, attracting outdoor enthusiasts with its challenging rock climbing routes and remote hiking trails. The Gunnison River, which cuts through a quarter of the park, provides prime opportunities for experienced kayakers and rafters seeking whitewater thrills through steep rapids surrounded by canyon walls that reach up to 2,700 feet from rim to riverbed in places.\n\nWildlife lovers will find a diverse ecosystem thriving among the park's contrasts of light and darkness, including peregrine falcons, mule deer, and golden eagles. Marvelous views await at scenic overlooks along the South Rim Road, while the less-visited North Rim offers a quieter, more serene experience. Whether you’re an adventurer ready to explore the canyon’s depths or a traveler in search of breathtaking vistas, Black Canyon presents a rare glimpse into the raw and untamed power of nature.",
    "Location": "38.57,-107.72",
    "Established": "October 21, 1999",
    "Area": "30,779.83 acres (124.6 km2)",
    "Annual_Visitors": 297257,
    "Latitude": 38.57,
    "Longitude": -107.72,
    "AllTrails URL": "https://www.alltrails.com/parks/us/colorado/black-canyon-of-the-gunnison-national-park",
    "Map Link": "https://www.nps.gov/media/photo/collection-item.htm?pg=7323739&cid=305fb7af-a71b-469b-941e-a98b439c882f&id=4c4ee03f-0ebb-4650-8001-6cd07a6bf6f4&sid=2ec6427a-5ea7-43b5-9b01-63eff5d6d43e&p=1&sort=relevance",
    "Map Type": "Park Map"
  },
  {
    "Name": "Bryce Canyon",
    "Description": "Nestled on southern Utah's Paunsaugunt Plateau, Bryce Canyon stands out as a geological wonder renowned for its unique hoodoo rock formations. These eroded sandstone spires, varying in height and vibrant hues, fill the park’s natural amphitheaters, creating a surreal and captivating landscape. Visitors can take in spectacular views from a variety of scenic overlooks, each offering a distinct perspective on the intricate labyrinth of hoodoos.\n\nFor those eager to explore on foot, Bryce Canyon features a network of hiking trails that cater to all skill levels, from easy strolls along the rim to more challenging routes like the Navajo Loop Trail, which descends into the heart of the formations. Sunrise and Sunset Points are particularly popular for their dramatic lighting, perfect for photography enthusiasts or anyone eager to witness nature’s artistry at its finest.\n\nThe park’s history is as rich as its landscape. Originally home to Native American tribes, including the Paiute people, the area later became a settlement for Mormon pioneers in the 19th century. This cultural legacy adds depth to the park’s story, making a visit to Bryce Canyon not just a visual experience, but a journey through time.\n\nOutdoor enthusiasts will also appreciate the park's stellar opportunity for stargazing, thanks to its designation as an International Dark Sky Park. With minimal light pollution and clear desert skies, Bryce Canyon offers some of the finest views of the Milky Way and constellations in the country. Whether you come for the geology, history, or the chance to gaze up at an endless night sky, Bryce Canyon leaves an impression as vast and inspiring as its iconic formations.",
    "Location": "37.57,-112.18",
    "Established": "February 25, 1928",
    "Area": "35,835.08 acres (145.0 km2)",
    "Annual_Visitors": 2354660,
    "Latitude": 37.57,
    "Longitude": -112.18,
    "AllTrails URL": "https://www.alltrails.com/parks/us/utah/bryce-canyon-national-park",
    "Map Link": "https://www.nps.gov/media/photo/collection-item.htm?pg=7323739&cid=305fb7af-a71b-469b-941e-a98b439c882f&id=7f36e7a7-d1ef-4cea-95e4-3cff345c0574&sid=1a381e42-6a9b-4b65-a6bd-12c391ea2646&p=1&sort=relevance",
    "Map Type": "Park Map"
  },
  {
    "Name": "Canyonlands",
    "Description": "Canyonlands National Park offers an awe-inspiring expanse of red rock canyons, towering pinnacles, and dramatic desert landscapes that are a haven for outdoor enthusiasts. Shaped over millions of years by the relentless forces of the Colorado River, the Green River, and their tributaries, this park is a masterpiece of geological artistry. Its maze-like canyons, colossal buttes, and flat-topped mesas create a terrain that beckons exploration and rewards adventure seekers.\n\nThe park is divided into three distinct districts, each with its own character: Island in the Sky features sweeping vistas from sheer cliff edges, The Needles is known for vibrant spires and challenging trails, and The Maze offers a remote backcountry experience for seasoned adventurers. Thousands of rock pinnacles, natural arches, and dramatic overlooks are scattered across the landscape, making it a photographer’s dream and a playground for hikers and mountain bikers alike.\n\nHistory enthusiasts will appreciate the park’s rich cultural heritage, as it holds evidence of Ancient Pueblo peoples, including petroglyphs, dwellings, and artifacts that tell the story of those who once thrived in this rugged environment. Whether you're scaling an exposed trail, cycling over slickrock, or marveling at the expansive night sky, Canyonlands inspires awe and offers countless opportunities to connect with nature in its most raw and untamed form.",
    "Location": "38.2,-109.93",
    "Established": "September 12, 1964",
    "Area": "337,597.83 acres (1,366.2 km2)",
    "Annual_Visitors": 779147,
    "Latitude": 38.2,
    "Longitude": -109.93,
    "AllTrails URL": "https://www.alltrails.com/parks/us/utah/canyonlands-national-park",
    "Map Link": "https://www.nps.gov/media/photo/collection-item.htm?pg=7323739&cid=305fb7af-a71b-469b-941e-a98b439c882f&id=49148eb2-baad-4ae1-b862-49f696e41fb2&sid=75eb2aa9-37f8-49b0-a9bc-8f75d8e933c1&p=1&sort=relevance",
    "Map Type": "Park Map"
  },
  {
    "Name": "Capitol Reef",
    "Description": "Nestled in south-central Utah, Capitol Reef National Park is a repository of geological and cultural wonders, providing a peaceful escape for outdoor enthusiasts. Known for its striking white sandstone domes, sheer cliffs, and ancient petroglyphs etched by Indigenous peoples, the park is a remarkable blend of natural beauty and human history. At its heart lies the Waterpocket Fold, a stunning 100-mile (160-kilometer) long monocline, where layers of the Earth's crust are dramatically folded, revealing millions of years of geologic history. Adventurers will find a mesmerizing landscape of rugged monoliths, weathered buttes, and otherworldly sandstone formations, including a dome that bears a striking resemblance to the United States Capitol.\n\nCapitol Reef is a haven for remote camping, where you can revel in the park’s solitude under dark, star-studded skies. Hikers can explore a variety of trails ranging from short, family-friendly walks to challenging backcountry treks that lead to sweeping vistas, hidden canyons, and desert oases. Beyond its natural splendor, the park also preserves remnants of early Mormon pioneer settlements, including historic orchards where visitors can still pick seasonal fruit.\n\nWhether you're intrigued by geology, history, or simply the allure of remote wilderness, Capitol Reef offers a chance to connect with nature in a peaceful, uncrowded setting. It's an ideal destination for anyone seeking to explore Utah’s dramatic desert landscapes while uncovering the stories etched into its rocks and canyons.",
    "Location": "38.20,-111.17",
    "Established": "December 18, 1971",
    "Area": "241,904.50 acres (979.0 km2)",
    "Annual_Visitors": 1227608,
    "Latitude": 38.2,
    "Longitude": -111.17,
    "AllTrails URL": "https://www.alltrails.com/parks/us/utah/capitol-reef-national-park",
    "Map Link": "https://www.nps.gov/media/photo/collection-item.htm?pg=7323739&cid=305fb7af-a71b-469b-941e-a98b439c882f&id=21ef0a46-5097-4859-9acb-ec9d2c308358&sid=3a0c4914-2256-4498-902a-f4b01a2bc5ae&p=1&sort=relevance",
    "Map Type": "Park Map"
  },
  {
    "Name": "Carlsbad Caverns",
    "Description": "Carlsbad Caverns National Park is a remarkable destination with a network of over 119 caves, formed through the fascinating process of sulfuric acid dissolution. Among these, the longest cave stretches over 120 miles (190 kilometers), providing a glimpse into the vastness of this subterranean world. A standout attraction within the park is the Big Room, a massive chamber nearly 4,000 feet (1,200 meters) in length, making it one of the largest and most awe-inspiring cave rooms in North America.\n\nBeyond its impressive geological features, Carlsbad Caverns is home to abundant wildlife. The caves themselves serve as a roost for over 400,000 Mexican free-tailed bats, along with sixteen other bat species, creating a vibrant ecosystem beneath the surface. Visitors often gather during the summer months to witness the captivating bat flight program, where thousands of bats emerge at dusk in an unforgettable natural spectacle.\n\nAbove ground, the park transitions into the rugged beauty of the Chihuahuan Desert, offering trails for hiking and opportunities to explore the unique desert flora and fauna. Nearby, Rattlesnake Springs provides a lush oasis and a popular spot for birdwatching, with over 300 bird species documented in the area.\n\nFor those eager to dive deeper into the caves, the park offers a variety of guided tours, ranging from beginner-friendly walks to more challenging spelunking adventures for experienced cavers. Additionally, camping facilities are available within the vicinity, allowing outdoor enthusiasts to fully immerse themselves in the serene natural surroundings. Carlsbad Caverns National Park is not only a wonder of the underground world but also a gateway to appreciating the diverse landscapes and wildlife of this extraordinary region.",
    "Location": "32.17,-104.44",
    "Established": "May 14, 1930",
    "Area": "46,766.45 acres (189.3 km2)",
    "Annual_Visitors": 390932,
    "Latitude": 32.17,
    "Longitude": -104.44,
    "AllTrails URL": "https://www.alltrails.com/parks/us/new-mexico/carlsbad-caverns-national-park",
    "Map Link": "https://www.nps.gov/media/photo/collection-item.htm?pg=7323739&cid=305fb7af-a71b-469b-941e-a98b439c882f&id=e6e19d73-fae6-4968-8c44-331dd9378ab2&sid=b207c9e4-139e-49e0-a271-b97692575485&p=1&sort=relevance",
    "Map Type": "Park Map"
  },
  {
    "Name": "Channel Islands",
    "Description": "Nestled off the coast of Southern California, Channel Islands National Park offers a truly distinctive outdoor experience. Encompassing five of the eight Channel Islands, this protected area is a haven for nature lovers, rich in both natural beauty and cultural history. Nearly half of the park lies beneath the ocean’s surface, making it an extraordinary destination for those who enjoy kayaking, snorkeling, and diving. The underwater environment is teeming with marine life and features stunning kelp forests and unique sea caves waiting to be explored.\n\nOn land, the park boasts a rare Mediterranean ecosystem, shaped over millennia and first inhabited by the Chumash people. Outdoor enthusiasts can discover this rich history through ranger-led and self-guided tours, as well as by exploring ancient archaeological sites on the islands. Home to over 2,000 species of plants and animals, the islands are known for their biodiversity. Remarkably, 145 of these species, including the tiny yet resilient island fox, are found nowhere else on Earth. This makes the park a naturalist’s paradise, offering countless opportunities to witness unique flora and fauna.\n\nWith no shops, paved roads, or permanent lodging, Channel Islands National Park fosters a sense of isolation and tranquility. For those seeking adventure, the islands offer some of the most remote and pristine hiking trails in California, alongside opportunities for backcountry camping under star-filled skies. Accessible only by ferry or private boat, the islands are a world apart from the bustling mainland. Ferry services operate regularly, providing transportation from Ventura and Oxnard harbors.\n\nWhether you're drawn to its rugged cliffs, distinctive wildlife, or the lure of the sea, Channel Islands National Park invites exploration and rewards visitors with unforgettable experiences both above and below the water.",
    "Location": "34.01,-119.42",
    "Established": "March 5, 1980",
    "Area": "249,561.00 acres (1,009.9 km2)",
    "Annual_Visitors": 323245,
    "Latitude": 34.01,
    "Longitude": -119.42,
    "AllTrails URL": "https://www.alltrails.com/parks/us/california/channel-islands-national-park",
    "Map Link": "https://www.nps.gov/media/photo/collection-item.htm?pg=7323739&cid=305fb7af-a71b-469b-941e-a98b439c882f&id=08a73c40-c1ef-4ce9-9a36-03688678bd92&sid=3145e9b1-1702-4d2f-85b0-64ed3fc8de9b&p=1&sort=relevance",
    "Map Type": "Park Map"
  },
  {
    "Name": "Congaree",
    "Description": "Nestled beside the Congaree River, this national park preserves the largest expanse of old-growth bottomland hardwood forest remaining in the United States, offering an immersive glimpse into a unique ecosystem. The park is a sanctuary for outdoor enthusiasts, providing opportunities for kayaking, canoeing, and hiking to discover its diverse landscapes at a personal pace. Towering trees, some among the tallest in the eastern United States, create a canopy over the rich floodplain below, while seasonal flooding nourishes the abundant flora and fauna.\n\nA key attraction is the Boardwalk Loop, an elevated trail that meanders through the swamp's heart, offering a closer view of the park’s unique plant and animal life without disturbing its delicate balance. As you traverse this 2.4-mile loop, watch for wildlife such as river otters, deer, wild turkeys, and birds, making Congaree a top spot for wildlife observation and birdwatching.\n\nThe park’s waterways, including Cedar Creek, beckon paddlers to experience the serene floodplain beauty from a fresh perspective, navigating beneath towering bald cypress and water tupelo trees adorned with Spanish moss. Whether exploring the waterways, hiking trails, or simply enjoying the forest's tranquility, Congaree allows countless connections with nature, emphasizing the ecological significance of this preserved landscape. It blends adventure with quiet wonder, inviting visitors into a world seemingly untouched by time.",
    "Location": "33.78,-80.78",
    "Established": "November 10, 2003",
    "Area": "26,692.60 acres (108.0 km2)",
    "Annual_Visitors": 204522,
    "Latitude": 33.78,
    "Longitude": -80.78,
    "AllTrails URL": "https://www.alltrails.com/parks/us/south-carolina/congaree-national-park",
    "Map Link": "https://www.nps.gov/media/photo/collection-item.htm?pg=7323739&cid=305fb7af-a71b-469b-941e-a98b439c882f&id=30f2efb0-2dbd-4a61-bdfd-e18cb41cda1d&sid=ed1900da-95c3-41fb-a78f-2a6aa0a826fb&p=1&sort=relevance",
    "Map Type": "Park Map"
  },
  {
    "Name": "Crater Lake",
    "Description": "Crater Lake is an enchanting destination famous for its deep, clear blue waters nestled inside an ancient volcanic caldera. Created over 7,700 years ago when Mount Mazama erupted and collapsed, the caldera now holds the deepest lake in the United States, reaching 1,943 feet. Its vivid blue color and remarkable clarity have fascinated generations, marking it a geological marvel.\n\nThe lake’s unique setting is enhanced by intriguing volcanic features, like Wizard Island, a cinder cone on the western lake side, and the Phantom Ship, a rugged rock formation resembling a ghostly schooner. With no rivers or streams flowing in or out, Crater Lake's waters are replenished purely by precipitation, maintaining pristine conditions.\n\nOutdoor enthusiasts find many ways to explore this serene landscape. Challenging hiking trails traverse forests, the caldera rim, and descend to the water's edge. The renowned Rim Trail offers panoramic views, while the Cleetwood Cove Trail provides the sole lake access for boat tours to Wizard Island and other geological sites. For a deeper experience, the park offers overnight camping in scenic, peaceful spots perfect for stargazing under clear skies.\n\nWhether attracted by its fascinating geology, crystal waters, or adventure opportunities, Crater Lake combines natural beauty with wonder and discovery.",
    "Location": "42.94,-122.1",
    "Established": "May 22, 1902",
    "Area": "183,224.05 acres (741.5 km2)",
    "Annual_Visitors": 527259,
    "Latitude": 42.94,
    "Longitude": -122.1,
    "AllTrails URL": "https://www.alltrails.com/parks/us/oregon/crater-lake-national-park",
    "Map Link": "https://www.nps.gov/media/photo/collection-item.htm?pg=7323739&cid=305fb7af-a71b-469b-941e-a98b439c882f&id=207bace8-c27a-4a9c-b1c2-9239778b6d2d&sid=c818cc1a-fae5-4749-8c2f-413f6e832f45&p=1&sort=relevance",
    "Map Type": "Park Map"
  },
  {
    "Name": "Cuyahoga Valley",
    "Description": "Situated in Ohio, Cuyahoga Valley National Park offers an exquisite blend of natural beauty, outdoor recreation, and history, making it a unique spot for nature lovers and history enthusiasts. The park’s forested paths wind through the hills leading to tranquil waterfalls like Brandywine Falls, one of the park’s highlights. Alongside these natural features, the park reveals the region's 19th-century heritage, with exhibits showcasing early rural life and preserved historic buildings scattered across the landscape.\n\nCyclists and hikers are drawn to the Ohio and Erie Canal Towpath Trail, a flat, accessible path following the historic canal once used for pulling canal boats. This trail offers a serene way to explore the park’s varied scenery, ideal for both leisurely strolls and vigorous adventures. The park also offers ample birdwatching opportunities, attracting diverse species year-round, making it a favorite among wildlife watchers.\n\nFor a different perspective, visitors can ride the Cuyahoga Valley Scenic Railroad, which offers relaxing journeys with stunning views and insights into the area's cultural and natural history.\n\nWhether exploring quiet forests, delving into historical exhibits, or enjoying the sounds of waterfalls and birds, Cuyahoga Valley National Park provides something for everyone, ensuring a fulfilling visit to this picturesque Ohio landscape.",
    "Location": "41.24,-81.55",
    "Established": "October 11, 2000",
    "Area": "32,571.89 acres (131.8 km2)",
    "Annual_Visitors": 2913312,
    "Latitude": 41.24,
    "Longitude": -81.55,
    "AllTrails URL": "https://www.alltrails.com/parks/us/ohio/cuyahoga-valley-national-park",
    "Map Link": "https://www.nps.gov/media/photo/collection-item.htm?pg=7323739&cid=305fb7af-a71b-469b-941e-a98b439c882f&id=b33bd45b-7e9a-4e4c-91f4-59594f0be686&sid=e7c2eb87-835e-4254-9eac-52ebca02aca8&p=1&sort=relevance",
    "Map Type": "Park Map"
  },
  {
    "Name": "Death Valley",
    "Description": "Death Valley showcases a captivating and stark landscape, known for being the hottest, driest, and lowest spot in the United States. Situated in the Mojave Desert, this unique park offers an otherworldly experience for adventurers. It is home to Badwater Basin, the continent's lowest point at 282 feet (86 meters) below sea level, with vast salt flats creating a mesmerizing panorama. Summer temperatures often exceed 130°F (54°C), ranking it among Earth's hottest locales.\n\nDespite extreme conditions, Death Valley boasts remarkable diversity. The park includes a variety of terrains, from rugged canyons and colorful badlands to sand dunes and jagged mountains. Peaks like Telescope Peak rise over 11,000 feet, offering breathtaking views and cooler hikes. Over 1,000 plant species, including the resilient creosote bush and vibrant spring wildflowers, thrive here, transforming the desert after rare rains.\n\nThe park's geologic and cultural history is rich, with ancient lakebeds, volcanic craters, and layered rocks reflecting Earth's dynamic processes over millions of years. Explorers can venture into narrow slot canyons or admire Ubehebe Crater. Historic mining sites and ghost towns reveal the lives of those who braved this unforgiving environment.\n\nFor astronomy lovers, the park’s remote location promises exceptional dark skies, ideal for stargazing. Warm summer nights provide unmatched views of the Milky Way. Trails, scenic drives, and overlooks like Zabriskie Point offer easy access to Death Valley's dramatic beauty.\n\nWhether drawn to its extreme environment, breathtaking landscapes, or captivating history, Death Valley continually surprises and inspires. Be prepared with ample water, sun protection, and a spirit of adventure in this unforgettable desert wilderness.",
    "Location": "36.24,-116.82",
    "Established": "October 31, 1994",
    "Area": "3,408,395.63 acres (13,793.3 km2)",
    "Annual_Visitors": 1128862,
    "Latitude": 36.24,
    "Longitude": -116.82,
    "AllTrails URL": "https://www.alltrails.com/parks/us/california/death-valley-national-park",
    "Map Link": "https://www.nps.gov/media/photo/collection-item.htm?pg=7323739&cid=305fb7af-a71b-469b-941e-a98b439c882f&id=a5bcc3bf-7a8b-409d-88cc-3490c7866551&sid=88d71596-26ed-41d9-894d-af0cae633f88&p=1&sort=relevance",
    "Map Type": "Park Map"
  },
  {
    "Name": "Denali",
    "Description": "Centered around Mount Denali, the tallest peak in North America at 20,310 feet, this national park is a paradise for outdoor enthusiasts. Denali National Park and Preserve features diverse landscapes, from boreal forests to rugged alpine terrains with expansive glacial icefields. A single 92-mile road, primarily accessible by tour buses, traverses the park's wild terrain, leading visitors to breathtaking spots like Wonder Lake.\n\nThe park is a wildlife haven, offering glimpses of Alaskan creatures like grizzly bears, moose, caribou, Dall sheep, and wolves. Birdwatchers will enjoy diverse species, including golden eagles and migratory birds that fill summer skies. Whether exploring the backcountry or more accessible areas, Denali connects visitors with untamed nature.\n\nFor hiking enthusiasts, the park's lack of marked trails offers a unique chance to explore undisturbed terrain using only maps and compasses. This freedom, paired with the pristine environment, makes Denali a special destination for seasoned adventurers seeking solitude.\n\nVisitors experience seasonal changes uniquely, with summer's wildflower-filled tundra, nearly endless daylight, and the midnight sun. Autumn covers the landscape in reds and golds, while winter offers chances to witness the aurora borealis.\n\nWhether drawn by dramatic mountain vistas, thriving wildlife, or untouched wilderness, Denali showcases Alaska's beauty, making it a world-class destination for nature lovers.",
    "Location": "63.33,-150.50",
    "Established": "February 26, 1917",
    "Area": "4,740,911.16 acres (19,185.8 km2)",
    "Annual_Visitors": 427562,
    "Latitude": 63.33,
    "Longitude": -150.5,
    "AllTrails URL": "https://www.alltrails.com/parks/us/alaska/denali-national-park",
    "Map Link": "https://www.nps.gov/media/photo/collection-item.htm?pg=7323739&cid=305fb7af-a71b-469b-941e-a98b439c882f&id=0ad819c9-157f-4dc8-af40-a9de3755a0f6&sid=8993673c-d3a6-4b83-8c9c-88b14764c192&p=1&sort=relevance",
    "Map Type": "Park Map"
  },
  {
    "Name": "Dry Tortugas",
    "Description": "At the far western end of the Florida Keys, Dry Tortugas National Park is a hidden treasure combining rich history, vibrant marine ecosystems, and stunning landscapes. Accessible only by boat or seaplane, this remote park provides adventure and tranquility. At its center is Fort Jefferson, a vast Civil War-era fortress and the largest brick masonry structure in the Americas, offering insights into 19th-century military life.\n\nThe park's pristine waters host abundant marine life. Its coral reefs are rich in biodiversity, ideal for snorkelers and divers. Colorful fish swim among corals, while historic shipwreck remnants add mystery to underwater explorations. Kayaking offers up-close encounters with crystal-clear waters, where paddlers can see sea turtles, rays, and various bird species.\n\nDry Tortugas is a birdwatcher's paradise, especially during migration. The park’s isolation offers excellent stargazing, free from urban light.\n\nWhether exploring the fort, discovering underwater wonders, or escaping daily life, Dry Tortugas National Park promises an unforgettable experience for outdoor and history enthusiasts.",
    "Location": "24.63,-82.87",
    "Established": "October 26, 1992",
    "Area": "64,701.22 acres (261.8 km2)",
    "Annual_Visitors": 78488,
    "Latitude": 24.63,
    "Longitude": -82.87,
    "AllTrails URL": "https://www.alltrails.com/parks/us/florida/dry-tortugas-national-park",
    "Map Link": "https://www.nps.gov/media/photo/collection-item.htm?pg=7323739&cid=305fb7af-a71b-469b-941e-a98b439c882f&id=727a46d8-8e71-4e48-9807-4e4acd93c7c6&sid=c19754ce-fd4d-4d00-acd8-522f99bdf9dd&p=1&sort=relevance",
    "Map Type": "Park Map"
  },
  {
    "Name": "Everglades",
    "Description": "The Everglades offers a distinct subtropical wilderness unique to the United States, blending diverse ecosystems of mangroves, marshes, and tropical rainforests. As the largest tropical wilderness in the country, this vast area serves as an essential marine estuary and a crucial refuge for a remarkable variety of wildlife. It shelters 36 protected species, including the elusive Florida panther, the ancient American crocodile, and the gentle West Indian manatee. These species underscore the vital role the Everglades play in biodiversity and conservation.\n\nVisitors can navigate the park's sprawling wetlands with airboat tours, which offer thrilling close-up views of this complex ecosystem. The Everglades also appeals to outdoor enthusiasts with opportunities for watching wildlife, birdwatching, hiking, kayaking, and backcountry camping. The landscape, defined by its flowing \"river of grass\" and thriving mangrove forests, supports a delicate balance of freshwater and saltwater habitats, making it a focal point for ecological diversity.\n\nHowever, the Everglades face challenges due to human impact. Parts of the wetlands have been drained and developed over the past century, resulting in habitat loss and disrupted water flow. Ongoing restoration efforts aim to repair these disruptions and restore the natural processes critical for the park's ecosystem to flourish.\n\nExploring the Everglades invites immersion in a rare and remarkable environment bursting with life and offers insight into the intricate connections that sustain this fragile yet resilient wilderness. For lovers of nature and adventure, the Everglades present a chance to witness the beauty and complexity of one of the world's most extraordinary ecosystems.",
    "Location": "25.32,-80.93",
    "Established": "May 30, 1934",
    "Area": "1,508,938.57 acres (6,106.5 km2)",
    "Annual_Visitors": 1155193,
    "Latitude": 25.32,
    "Longitude": -80.93,
    "AllTrails URL": "https://www.alltrails.com/parks/us/florida/everglades-national-park",
    "Map Link": "https://www.nps.gov/media/photo/collection-item.htm?pg=7323739&cid=305fb7af-a71b-469b-941e-a98b439c882f&id=5238bf1e-d52a-470d-89ef-56b18a95bdd6&sid=51f0a1c9-be0a-42df-a2b2-ea59f003c743&p=1&sort=relevance",
    "Map Type": "Park Map"
  },
  {
    "Name": "Gates of the Arctic",
    "Description": "Situated completely above the Arctic Circle, Gates of the Arctic National Park and Preserve stands as a vast, untouched wilderness in northern Alaska. This remote expanse, nestled within the rugged Brooks Range, offers unmatched opportunities for backcountry camping, hiking, and exploration. With no established roads, trails, or facilities, the park is a sanctuary for adventurous outdoor enthusiasts seeking solitude and a direct connection to pristine nature.\n\nSpanning over 8.4 million acres, Gates of the Arctic is the northernmost national park in the United States and one of its most wild landscapes. Visitors should be prepared for self-reliant travel through varied terrain, including alpine valleys, sweeping tundra, towering peaks, and glacier-carved river valleys. The park’s solitude allows for a unique chance to experience true wilderness, where human footprints are fleeting and ecosystems remain untouched. Wildlife is abundant, with caribou herds, moose, wolves, bears, Dall sheep, and migratory birds inhabiting the area.\n\nThis region has been home to Alaska Natives for over 11,000 years, particularly the Iñupiat and Athabaskan peoples, who still maintain deep cultural and subsistence ties to the area. Visitors venturing into the park are not only stepping into a landscape of raw natural beauty but also into a place rich in human history. The timeless interdependence of caribou migrations and Indigenous traditions offers a profound connection to the land.\n\nIt's crucial to remember that this is a park of genuine wilderness. There are no visitor centers, campgrounds, or other facilities typical of other national parks. Access is primarily by air taxi or long overland treks, making careful planning and preparation essential. For those ready to embrace its challenges, Gates of the Arctic offers a rewarding experience of complete immersion in one of the last untrammeled ecosystems on Earth. This is a land where silence prevails, the midnight sun casts its glow, and winter’s auroras dance across the vast horizon—a pure wilderness experience like no other.",
    "Location": "67.78,-153.30",
    "Established": "December 2, 1980",
    "Area": "7,523,897.45 acres (30,448.1 km2)",
    "Annual_Visitors": 9457,
    "Latitude": 67.78,
    "Longitude": -153.3,
    "AllTrails URL": "https://www.alltrails.com/parks/us/alaska/gates-of-the-arctic-national-park",
    "Map Link": "https://www.nps.gov/media/photo/collection-item.htm?pg=7323739&cid=305fb7af-a71b-469b-941e-a98b439c882f&id=3617ecaa-71e3-4e27-a90e-b3cd74d4172f&sid=4bf6cc53-fea4-4a5a-b885-f048bcd184f7&p=1&sort=relevance",
    "Map Type": "Park Map"
  },
  {
    "Name": "Gateway Arch",
    "Description": "Symbolizing the \"Gateway to the West,\" Gateway Arch National Park is a remarkable tribute to the spirit of exploration and the deep history of westward expansion in the United States. At its center stands the iconic Gateway Arch, a stunning stainless steel structure soaring 630 feet into the sky. This architectural marvel—equal in height and width—was completed in the 1960s to celebrate Thomas Jefferson's vision, the historic Lewis and Clark Expedition, and the adventures that fueled America's growth beyond the Mississippi River.\n\nThe park offers more than just a visual spectacle. Short walking trails weave through its grounds, offering peaceful spots to admire scenic views of the mighty Mississippi River and the surrounding urban landscape. For outdoor enthusiasts, this is an ideal place to blend history with a stroll in a lively green space.\n\nHistory buffs will uncover deeper narratives at the Old Courthouse, located across a grassy greenway just west of the Arch. This historic site played a crucial role in the infamous Dred Scott case, a defining legal battle that shaped America's turbulent journey through slavery and civil rights.\n\nBeneath the Arch, an underground museum offers a rich and immersive interpretation of the structure’s engineering, the broader saga of westward expansion, and the human experiences linked to these transformative events in American history. Visitors can also ascend to the top of the Arch in a unique tram ride, where panoramic views of St. Louis and beyond offer a unique perspective.\n\nWhether drawn by the captivating design, the chance to walk in the footsteps of history, or simply the opportunity for a serene moment by the river, Gateway Arch National Park promises a multifaceted experience for both outdoor adventurers and history enthusiasts.",
    "Location": "38.63,-90.19",
    "Established": "February 22, 2018[46]",
    "Area": "192.83 acres (0.8 km2)",
    "Annual_Visitors": 1618774,
    "Latitude": 38.63,
    "Longitude": -90.19,
    "AllTrails URL": "https://www.alltrails.com/parks/us/missouri/gateway-arch-national-park",
    "Map Link": "https://www.nps.gov/media/photo/collection-item.htm?pg=7323739&cid=305fb7af-a71b-469b-941e-a98b439c882f&id=4f0374c2-bb11-4748-aa12-8a55aa1eb43a&sid=8cb0ce13-4876-40fc-8940-6e3cf8d677d2&p=1&sort=relevance",
    "Map Type": "Park Map"
  },
  {
    "Name": "Glacier",
    "Description": "Glacier National Park is a stunning destination where alpine landscapes converge with the rugged beauty of the Rocky Mountains. Featuring majestic peaks, crystal-clear lakes, and the renowned Going-to-the-Sun Road, this park provides endless opportunities for adventure and discovery. It represents the U.S. portion of the Waterton-Glacier International Peace Park, a UNESCO World Heritage Site that emphasizes its global importance.\n\nOne of the park’s most remarkable features is its dynamic ecosystem, highlighted by 26 glaciers rapidly retreating due to climate change. Over 130 named lakes adorn the park's impressive terrain, their pristine waters mirroring the surrounding peaks. These geological wonders originate largely from an ancient overthrust fault, which has exposed rock layers containing fossils from the Paleozoic era, including trilobites, mollusks, giant ferns, and even dinosaur remnants.\n\nFor history and architecture buffs, Glacier offers a window into the past with its historic lodges and chalets, which reflect early 20th-century tourism in the American West. The Going-to-the-Sun Road, an engineering marvel completed in 1932, winds through the heart of the park, delivering awe-inspiring vistas and access to iconic sites.\n\nOutdoor enthusiasts will discover a wilderness rich in biodiversity. From grizzly bears and mountain goats to bald eagles and wolverines, the park is a sanctuary for wildlife. It also boasts over 700 miles of hiking trails, catering to adventurers of all skill levels with paths leading to waterfalls, mountain passes, and hidden valleys.\n\nOne of the park’s unique landmarks is Triple Divide Peak, a geologic wonder where waters flow into three major drainage basins: the Atlantic, Pacific, and Arctic Oceans. This rare feature underscores the park's ecological and hydrological significance.\n\nWhether you're climbing its rugged peaks, kayaking its serene waters, or simply marveling at its untouched beauty, Glacier National Park offers an unrivaled experience that combines natural wonder with cultural and geological significance.",
    "Location": "48.80,-114.00",
    "Established": "May 11, 1910",
    "Area": "1,013,126.39 acres (4,100.0 km2)",
    "Annual_Visitors": 2908458,
    "Latitude": 48.8,
    "Longitude": -114.0,
    "AllTrails URL": "https://www.alltrails.com/parks/us/montana/glacier-national-park",
    "Map Link": "https://www.nps.gov/media/photo/collection-item.htm?pg=7323739&cid=305fb7af-a71b-469b-941e-a98b439c882f&id=9fe2fe28-43af-4574-8dde-2555a2657aca&sid=b261f7eb-69ad-4be3-b8e9-89a3f6943e5e&p=1&sort=relevance",
    "Map Type": "Park Map"
  },
  {
    "Name": "Glacier Bay",
    "Description": "Glacier Bay presents a stunning glimpse into the powerful forces of nature, where tidewater glaciers, rugged mountains, deep fjords, and temperate rainforests come together in an awe-inspiring landscape. Accessible mainly by boat, this natural marvel is a paradise for outdoor enthusiasts, offering incredible opportunities for kayaking, scenic camping, and wildlife observation. Paddling through its calm waters allows visitors to experience calving glaciers and towering ice cliffs up close, while camping along its shores offers a chance to connect with its untouched beauty.\n\nWildlife thrives in this remote Alaskan wilderness. Glacier Bay is home to grizzly bears roaming the forested slopes, mountain goats navigating steep cliffs, humpback whales breaching in its icy waters, and seals resting on icebergs. The sky often echoes with the cries of bald eagles, completing an ecosystem vibrant with life, shaped by its glacial history.\n\nWhen British explorer George Vancouver arrived in 1794, the entire bay was covered by ice. Since then, the glaciers have dramatically retreated over 65 miles, uncovering an evolving landscape continually sculpted by natural forces. As part of a UNESCO World Heritage Site and Biosphere Reserve, Glacier Bay is not only a haven for adventurers but also a captivating site for scientists studying climate change and glacial dynamics.\n\nWith its blend of remarkable scenery, adventurous activities, and abundant wildlife, Glacier Bay provides an unforgettable experience. Whether navigating its icy waters, hiking its trails, or simply soaking in the quiet majesty of this pristine environment, the connection to the natural world here is unparalleled.",
    "Location": "58.50,-137.00",
    "Established": "December 2, 1980",
    "Area": "3,223,383.43 acres (13,044.6 km2)",
    "Annual_Visitors": 545758,
    "Latitude": 58.5,
    "Longitude": -137.0,
    "AllTrails URL": "https://www.alltrails.com/parks/us/alaska/glacier-bay-national-park",
    "Map Link": "https://www.nps.gov/media/photo/collection-item.htm?pg=7323739&cid=305fb7af-a71b-469b-941e-a98b439c882f&id=78ae37a8-e3b9-4494-bc6e-36672b2659fa&sid=269e3a37-9010-4d34-ae03-31a0160741e1&p=1&sort=relevance",
    "Map Type": "Park Map"
  },
  {
    "Name": "Grand Canyon",
    "Description": "Stretching 277 miles in length, reaching depths up to 1 mile, and spanning up to 15 miles wide at various points, the Grand Canyon is one of nature’s most awe-inspiring creations. Sculpted over millions of years by the relentless force of the Colorado River, this immense geological wonder is a masterpiece of erosion, unveiling the vibrant, multicolored layers of the Colorado Plateau. Visitors have the exceptional opportunity to witness a three-tiered canyon system that displays a dynamic timeline of Earth’s history etched into its walls.\n\nOutdoor enthusiasts will find countless ways to explore this legendary landscape. The Bright Angel Trail, one of the most popular and accessible paths, offers a challenging yet rewarding journey into the canyon's depths. For those seeking solitude and adventure, numerous other trails provide varying difficulty levels and unique perspectives, with options available from both the North and South Rims. The South Rim, open year-round, is more developed and boasts breathtaking points like Mather Point and Desert View, while the more secluded North Rim offers a quieter, remote wilderness experience.\n\nBeyond hiking, visitors can experience the canyon from a variety of vantage points. Scenic drives, such as Desert View Drive, reveal expansive vistas where light transforms the rugged terrain throughout the day. For a truly immersive adventure, rafting trips along the Colorado River offer an unmatched perspective of the canyon’s towering walls and hidden waterfalls.\n\nThe Grand Canyon is not just a destination—it’s a living classroom, providing opportunities to learn about geology, ecology, and Native American history. The immense scale, vibrant colors, and dramatic landscapes make it a bucket-list destination for nature lovers, photographers, and adventurers. Whether descending into its depths, marveling from the rims, or exploring its waterways, the Grand Canyon promises an unforgettable connection to the power and beauty of the natural world.",
    "Location": "36.06,-112.14",
    "Established": "February 26, 1919",
    "Area": "1,201,647.03 acres (4,862.9 km2)",
    "Annual_Visitors": 4732101,
    "Latitude": 36.06,
    "Longitude": -112.14,
    "AllTrails URL": "https://www.alltrails.com/parks/us/arizona/grand-canyon-national-park",
    "Map Link": "https://www.nps.gov/media/photo/collection-item.htm?pg=7323739&cid=305fb7af-a71b-469b-941e-a98b439c882f&id=4f2c94ce-953a-4099-afae-49b7565484f4&sid=65d0a3c2-45e0-40f3-be06-fa89fbf489c9&p=1&sort=relevance",
    "Map Type": "Park Map"
  },
  {
    "Name": "Grand Teton",
    "Description": "Grand Teton National Park offers breathtaking mountain landscapes, captivating outdoor experiences, and numerous opportunities for exploration. Dominated by the sharp peaks of the Teton Range, the park’s centerpiece is Grand Teton itself, the tallest mountain in the range, reaching an elevation of 13,775 feet. The park is famous for its diverse network of trails catering to hikers of all skill levels, from peaceful lakeshore walks to demanding backcountry routes that reward visitors with expansive views and tranquility.\n\nVisitors will find an impressive array of lakes, including the iconic Jackson Lake and smaller piedmont lakes such as Jenny Lake and Leigh Lake, whose mirrored surfaces reflect the striking skyline of rugged peaks. These lakes, along with surrounding wetlands and sagebrush plains, foster thriving habitats for a wide variety of wildlife. Keep an eye out for elk, moose, and bison in the lowlands, while eagles and hawks soar above. Grizzly and black bears inhabit the park as well, making it crucial to follow safety guidelines if you're venturing into bear territory.\n\nThe park also holds the historic Jackson Hole Valley, a region preserving a fascinating blend of natural history and cultural heritage. Here, you can explore rustic cabins, historic ranching sites, and cultural landmarks that echo the lives of early settlers and Native American communities.\n\nFor outdoor enthusiasts, Grand Teton offers activities like kayaking, rock climbing, fly fishing, and photography, with endless opportunities to connect with nature. Backcountry camping is a standout experience, offering overnight adventurers a unique chance to immerse themselves in the untouched wilderness far from the crowds. With its pristine alpine environment, diverse ecosystems, and unparalleled scenery, Grand Teton National Park is a destination that promises adventure, inspiration, and lasting memories for all who visit.",
    "Location": "43.73,-110.80",
    "Established": "February 26, 1929",
    "Area": "310,044.36 acres (1,254.7 km2)",
    "Annual_Visitors": 2806223,
    "Latitude": 43.73,
    "Longitude": -110.8,
    "AllTrails URL": "https://www.alltrails.com/parks/us/wyoming/grand-teton-national-park",
    "Map Link": "https://www.nps.gov/media/photo/collection-item.htm?pg=7323739&cid=305fb7af-a71b-469b-941e-a98b439c882f&id=9f35789f-3f7d-447b-9fe7-cb4914e0b6e1&sid=375d897c-449e-4f11-bb64-cb6f9c41130a&p=1&sort=relevance",
    "Map Type": "Park Map"
  },
  {
    "Name": "Great Basin",
    "Description": "Eastern Nevada's high desert is home to Great Basin National Park, blending rugged natural beauty, geological wonders, and rich biodiversity. Dominated by the impressive Wheeler Peak, Nevada's second-highest mountain at over 13,000 feet, the park is a haven for adventurers seeking both excitement and solitude. Hikers can challenge themselves on the Wheeler Peak Summit Trail, explore alpine vistas, and find one of the southernmost rock glaciers in the United States.\n\nAmong the park's most notable treasures are the ancient bristlecone pines, some over 5,000 years old, making them among the oldest living organisms on Earth. Below ground, the limestone Lehman Caves invite visitors into a stunning subterranean world of intricate formations that captivate both avid cavers and casual explorers.\n\nGreat Basin is also a premier spot in the United States for stargazing. Its remote location results in minimal light pollution, offering incredible views of the Milky Way stretching vividly across the heavens. The park hosts astronomy programs and events to help deepen visitors' connection with the celestial wonders.\n\nWildlife enthusiasts will find the park equally compelling, with diverse species ranging from the Townsend's big-eared bat flitting through the twilight to the speedy pronghorn roaming the expansive valleys. Anglers can try their luck in the clear mountain streams, home to the Bonneville cutthroat trout, an iconic native fish of the region.\n\nWhether you're there to summit rugged peaks, explore hidden caves, marvel at ancient trees, or simply enjoy the quiet beauty of one of the nation's least crowded national parks, Great Basin offers an unforgettable escape into the heart of the wild.",
    "Location": "38.98,-114.30",
    "Established": "October 27, 1986",
    "Area": "77,180.00 acres (312.3 km2)",
    "Annual_Visitors": 142115,
    "Latitude": 38.98,
    "Longitude": -114.3,
    "AllTrails URL": "https://www.alltrails.com/parks/us/nevada/great-basin-national-park",
    "Map Link": "https://www.nps.gov/media/photo/collection-item.htm?pg=7323739&cid=305fb7af-a71b-469b-941e-a98b439c882f&id=007eacbe-782f-4e20-b8d0-0f68c8f8e307&sid=83641050-adb8-4d1f-b117-30ea702d82e2&p=1&sort=relevance",
    "Map Type": "Park Map"
  },
  {
    "Name": "Great Sand Dunes",
    "Description": "In Colorado’s San Luis Valley, Great Sand Dunes National Park showcases the tallest sand dunes in North America, some reaching up to 750 feet (230 meters). These dramatic formations are shaped by centuries of wind and water sculpting ancient deposits from the Rio Grande, creating an awe-inspiring landscape that feels both grand and intimate. Beyond the dunes, the park preserves a tapestry of ecosystems, including expansive grasslands, flourishing shrublands, seasonal wetlands, and serene alpine lakes. Towering above it all are six 13,000-foot peaks and old-growth forests, providing a stunning backdrop and opportunities for high-altitude exploration.\n\nAdventure seekers will find plenty of activities, with sandboarding and sledding on the dunes being unique highlights. Hiking trails traverse diverse terrain, offering options for all skill levels. Backcountry camping is a favorite for those looking to immerse themselves in the solitude and natural beauty of this remote area. With its dark skies and minimal light pollution, the park is also perfect for stargazing—on clear nights, the Milky Way and countless constellations are visible in breathtaking detail.\n\nThe Great Sand Dunes are more than just a geological marvel; they’re a vibrant natural sanctuary that invites exploration, discovery, and a deep connection with the outdoors. Whether you're climbing the dunes, hiking to alpine lakes, or marveling at the interplay of light and shadow across the sand, this national park offers an unforgettable experience for nature lovers and adventurers alike.",
    "Location": "37.73,-105.51",
    "Established": "September 24, 2004",
    "Area": "107,345.73 acres (434.4 km2)",
    "Annual_Visitors": 493428,
    "Latitude": 37.73,
    "Longitude": -105.51,
    "AllTrails URL": "https://www.alltrails.com/parks/us/colorado/great-sand-dunes-national-park",
    "Map Link": "https://www.nps.gov/media/photo/collection-item.htm?pg=7323739&cid=305fb7af-a71b-469b-941e-a98b439c882f&id=1dd33a11-0d4a-41ef-afbe-5f8a9d7bec4a&sid=11eead18-7f6e-4756-827f-a1d6ca39e05f&p=1&sort=relevance",
    "Map Type": "Park Map"
  },
  {
    "Name": "Great Smoky Mountains",
    "Description": "Set in the heart of the Appalachian Mountains, Great Smoky Mountains National Park is a treasure trove of natural beauty and biodiversity. Renowned for its signature mist-covered peaks and lush, forested landscapes, the park is a haven for outdoor enthusiasts of all kinds. Its varied terrain, which spans a wide range of elevations, supports an incredible array of life—more than 400 vertebrate species, 100 species of trees, and 5,000 species of plants thrive here, making it one of the most biologically diverse parks in the United States.\n\nHiking is undoubtedly the crown jewel of park activities, offering visitors over 800 miles (1,300 km) of trails to explore. Among these is a 70-mile (110 km) stretch of the iconic Appalachian Trail, which weaves through the park and offers breathtaking views of the surrounding wilderness. From leisurely walks through wildflower meadows to challenging ascents to panoramic vistas, the trails cater to both casual hikers and seasoned trekkers looking for adventure.\n\nBeyond hiking, the park offers a variety of other recreational opportunities. Visitors can cast a line in one of the crystal-clear streams, home to native brook trout and other fish species. Equestrians will find designated trails for horseback riding, providing a unique way to experience the scenic beauty of the area. For history buffs, nearly 80 preserved historic structures, including cabins, barns, and churches, provide a glimpse into the rich cultural heritage of the region, showcasing the life and struggles of the early Appalachian settlers.\n\nWith its mix of stunning landscapes, abundant wildlife, and opportunities for exploration and relaxation, the Great Smoky Mountains National Park offers something for everyone. Whether you're camping under the starry skies, admiring tumbling waterfalls, or simply soaking in the serene beauty of nature, this park promises an unforgettable experience for all who visit.",
    "Location": "35.68,-83.53",
    "Established": "June 15, 1934",
    "Area": "522,426.88 acres (2,114.2 km2)",
    "Annual_Visitors": 12937633,
    "Latitude": 35.68,
    "Longitude": -83.53,
    "AllTrails URL": "https://www.alltrails.com/parks/us/tennessee/great-smoky-mountains-national-park",
    "Map Link": "https://www.nps.gov/media/photo/collection-item.htm?pg=7323739&cid=305fb7af-a71b-469b-941e-a98b439c882f&id=8410e7f4-0499-4e4e-802f-7bbdfb85b5fa&sid=3e946cf8-27e6-4ea3-94b2-1ceec8223539&p=1&sort=relevance",
    "Map Type": "Park Map"
  },
  {
    "Name": "Guadalupe Mountains",
    "Description": "Positioned in the remote beauty of western Texas, Guadalupe Mountains National Park is a haven for outdoor enthusiasts seeking stunning landscapes and a true sense of adventure. Home to Guadalupe Peak, the highest point in Texas at 8,751 feet, the park offers spectacular views and rewarding climbs for hikers. Beyond its towering peaks, the park also features McKittrick Canyon, a hidden gem known for its vibrant fall foliage, especially the striking bigtooth maple trees that color the canyon in vivid hues during autumn.\n\nThe park is part of the expansive Chihuahuan Desert, highlighting an extraordinary mix of desert ecosystems and rugged terrain. It's also a geological treasure trove, boasting a fossilized reef from the Permian era, a reminder of when the area was submerged under an ancient sea over 250 million years ago. This unique feature makes it an exciting destination for geology enthusiasts.\n\nGuadalupe Mountains National Park is an excellent choice for remote hiking and backcountry camping, with over 80 miles of trails that wind through canyons, forests, and high desert landscapes. Wildlife like mule deer, peregrine falcons, and elusive mountain lions enhance the sense of exploration. Whether you're summiting the peaks, discovering ancient fossils, or simply soaking in the serenity of the desert, this park offers a truly memorable outdoor experience.",
    "Location": "31.92,-104.87",
    "Established": "September 30, 1972",
    "Area": "86,367.10 acres (349.5 km2)",
    "Annual_Visitors": 219987,
    "Latitude": 31.92,
    "Longitude": -104.87,
    "AllTrails URL": "https://www.alltrails.com/parks/us/texas/guadalupe-mountains-national-park",
    "Map Link": "https://www.nps.gov/media/photo/collection-item.htm?pg=7323739&cid=305fb7af-a71b-469b-941e-a98b439c882f&id=885d9357-5685-442c-8290-03ba4cd09529&sid=6b503d5d-25b7-44a2-850f-a167fc6b67db&p=1&sort=relevance",
    "Map Type": "Park Map"
  },
  {
    "Name": "Haleakalā",
    "Description": "Haleakalā National Park, situated on the island of Maui, provides an extraordinary blend of natural wonders and outdoor activities, making it a must-see for nature enthusiasts. The park is home to the Haleakalā Volcano, a massive shield volcano with a vast summit crater adorned with striking cinder cones. The volcanic landscape is otherworldly, with dramatic colors and features shaped by centuries of geological activity.\n\nOne of the park’s most renowned experiences is witnessing the sunrise from the summit, where panoramic views often unveil above a sea of clouds. Stargazing here is equally breathtaking, as the high elevation and clear skies offer exceptional conditions for observing the night sky. \n\nHaleakalā also offers diverse hiking opportunities, ranging from trails that navigate the stark lava landscapes of the summit area to lush paths in the Kipahulu region. In the Kipahulu section, visitors can explore verdant rainforests and a series of picturesque freshwater pools and waterfalls. This area is not only visually stunning but also ecologically significant, serving as a habitat for unique species, including the endangered Hawaiian goose (nēnē), the state bird of Hawaii.\n\nFor campers, the park provides two designated campgrounds, allowing for closer immersion in its serene surroundings. Haleakalā National Park is especially notable for its role in protecting biodiversity, boasting the highest number of endangered species of any U.S. national park. Beyond its natural beauty, the park offers a rare opportunity to connect with the unique ecosystems and cultural heritage of Hawaii, making it a destination that rewards exploration and discovery.",
    "Location": "20.72,-156.17",
    "Established": "July 1, 1961",
    "Area": "33,488.98 acres (135.5 km2)",
    "Annual_Visitors": 1087616,
    "Latitude": 20.72,
    "Longitude": -156.17,
    "AllTrails URL": "https://www.alltrails.com/parks/us/hawaii/haleakala-national-park",
    "Map Link": "https://www.nps.gov/media/photo/collection-item.htm?pg=7323739&cid=305fb7af-a71b-469b-941e-a98b439c882f&id=b70421dc-88c0-4da8-b5a6-409578a6ba73&sid=57aeb9f6-24ee-42e4-b03a-2bf20e0f25c1&p=1&sort=relevance",
    "Map Type": "Park Map"
  },
  {
    "Name": "Hawaiʻi Volcanoes",
    "Description": "Hawaiʻi Volcanoes National Park is a captivating destination on the Big Island, showcasing nature's raw intensity. Home to Kīlauea and Mauna Loa, two of Earth's most active volcanoes, the park invites visitors to observe the dynamic processes that craft our planet. Spanning diverse ecosystems, the park transitions from lush tropical forests at sea level to stark lava fields reaching elevations over 13,000 feet (4,000 meters). This exceptional diversity makes it a haven for those seeking exploration.\n\nHiking trails meander through varied landscapes, providing experiences ranging from easy strolls among towering tree ferns to tougher hikes over newly solidified lava flows. The iconic Kīlauea Iki Trail, for example, guides you through a rainforest and into the bed of a former lava lake. For a longer journey, Mauna Loa's backcountry delivers unmatched solitude and sweeping views of the Big Island.\n\nCamping in the park means unforgettable nights beneath starry skies, with chances to hear the volcanic landscape subtly shifting. Ranger-led programs offer insight into the region's cultural and geological significance, with Hawai‘i Volcanoes recognized as both a UNESCO World Heritage Site and a Biosphere Reserve.\n\nWhether fascinated by geological phenomena, eager to explore diverse ecosystems, or drawn to learning about Hawaiian culture’s connection to the land, Hawaiʻi Volcanoes National Park presents a unique experience for every nature enthusiast.",
    "Location": "19.38,-155.20",
    "Established": "August 1, 1916",
    "Area": "344,812.18 acres (1,395.4 km2)",
    "Annual_Visitors": 1580961,
    "Latitude": 19.38,
    "Longitude": -155.2,
    "AllTrails URL": "https://www.alltrails.com/parks/us/hawaii/hawaii-volcanoes-national-park",
    "Map Link": "https://www.nps.gov/media/photo/collection-item.htm?pg=7323739&cid=305fb7af-a71b-469b-941e-a98b439c882f&id=910dd491-61ff-4b9a-90c5-76e96c7f0872&sid=da96a415-0950-447f-9eab-514d5fa90406&p=1&sort=relevance",
    "Map Type": "Park Map"
  },
  {
    "Name": "Hot Springs",
    "Description": "Tucked in the Ouachita Mountains, Hot Springs National Park combines natural beauty, rich history, and relaxation. Its famed thermal springs have attracted visitors for centuries, offering a chance to soak in nature’s warmth amidst historic bathhouses' charm. Established on April 20, 1832, as a federal reserve, Hot Springs bears the distinction of being the oldest area managed by the National Park Service, preceding the park system's official creation.\n\nThe iconic Bathhouse Row, with well-preserved 19th-century buildings, forms the cultural heart of the park. Here, you can explore grand bathhouses, some of which still provide spa treatments using natural thermal waters, showcasing the park’s role as a wellness retreat continuing today.\n\nBeyond its historical structures, the park features verdant trails through the Ouachita Mountains, offering hiking, birdwatching, and nature connection. Trails vary in difficulty, suitable for casual walkers and seasoned hikers alike. The scenic vistas, tranquil woodlands, and diverse flora enhance the park’s allure, ideal for those seeking adventure and tranquility.\n\nUniquely, Hot Springs is the only national park situated within a city, merging urban culture with natural serenity. It held the title of smallest national park until 2018, making its compact size easy to explore over a few days. Whether enjoying history, hiking, or relaxing in thermal waters, Hot Springs National Park provides a distinctive experience for nature lovers and history enthusiasts alike.",
    "Location": "34.51,-93.05",
    "Established": "March 4, 1921",
    "Area": "5,554.15 acres (22.5 km2)",
    "Annual_Visitors": 2646133,
    "Latitude": 34.51,
    "Longitude": -93.05,
    "AllTrails URL": "https://www.alltrails.com/parks/us/arkansas/hot-springs-national-park",
    "Map Link": "https://www.nps.gov/media/photo/collection-item.htm?pg=7323739&cid=305fb7af-a71b-469b-941e-a98b439c882f&id=739704d3-a980-417e-8bf6-acb3af735f97&sid=5c17139f-a8c6-455f-b413-e4302f4233d8&p=1&sort=relevance",
    "Map Type": "Park Map"
  },
  {
    "Name": "Indiana Dunes",
    "Description": "Located along a 20-mile stretch of Lake Michigan, Indiana Dunes National Park is rich in natural beauty and ecological variety. This notable park features sandy beaches, majestic dunes, and diverse habitats, including grassy prairies, lush peat bogs, and serene marshlands. These environments host an impressive range of wildlife, with over 2,000 plant and animal species found here. Birdwatchers, especially, will find a paradise for spotting migratory and resident birds throughout the year.\n\nWith an array of trails winding through its varied landscapes, the park accommodates both casual and serious hikers. Visitors can explore paths through towering dunes, offering breathtaking vistas of Lake Michigan, or wander into wooded areas and wetlands alive with nature's sounds. Each season offers a new perspective, from blooming wildflowers in spring and summer to vibrant autumn foliage and the tranquil beauty of winter snowscapes.\n\nIndiana Dunes also captivates geology enthusiasts, as the dunes themselves tell a fascinating story of glacial movements and wind patterns sculpting this shoreline over millennia. Whether you're drawn to the serene beaches for relaxation, the trails for adventure, or ecosystems to study, this park offers something for everyone, standing as a vibrant testament to the Great Lakes region's life and landscape.",
    "Location": "41.6533,-87.0524",
    "Established": "February 15, 2019",
    "Area": "15,349.08 acres (62.1 km2)",
    "Annual_Visitors": 2834180,
    "Latitude": 41.6533,
    "Longitude": -87.0524,
    "AllTrails URL": "https://www.alltrails.com/parks/us/indiana/indiana-dunes-national-park",
    "Map Link": "https://www.nps.gov/media/photo/collection-item.htm?pg=7323739&cid=305fb7af-a71b-469b-941e-a98b439c882f&id=eb29d4bb-8e29-4a88-9963-04d1b4d92d36&sid=f4526acb-9fe6-4b36-97b1-016e39f838f7&p=1&sort=relevance",
    "Map Type": "Park Map"
  },
  {
    "Name": "Isle Royale",
    "Description": "Isle Royale National Park, in the vastness of Lake Superior, offers solitude and untamed wilderness. Accessible only by ferry, this remote locale is a haven for nature lovers. The park centers around Isle Royale, Lake Superior's largest island, along with more than 400 smaller islands within 4.5 miles of its rugged shores.\n\nFamous for its stunning landscapes and pristine waters, Isle Royale is a paradise for backcountry campers, paddlers, and hikers. The island offers a trail network through dense forests, rocky ridges, and serene shores, inviting exploration. Kayakers and canoeists can venture into hidden coves and channels, experiencing the park’s unspoiled beauty from the water.\n\nFor wildlife enthusiasts, Isle Royale is particularly fascinating. Although the island hosts only 20 mammal species, its unique ecological dynamics have intrigued researchers for years. The predator-prey relationship between wolves and moose is a natural study of evolution and survival in isolation. Observing these animals in their habitat is both rare and humbling.\n\nEnhancing its allure, the waters surrounding Isle Royale contain historic shipwrecks from Lake Superior’s maritime history. These underwater sites attract divers eager to explore relics from past eras. Whether trekking trails, paddling waterways, or simply soaking in the untouched beauty, Isle Royale offers a profound nature connection in one of America's most remote corners.",
    "Location": "48.10,-88.55",
    "Established": "April 3, 1940",
    "Area": "571,790.30 acres (2,314.0 km2)",
    "Annual_Visitors": 25454,
    "Latitude": 48.1,
    "Longitude": -88.55,
    "AllTrails URL": "https://www.alltrails.com/parks/us/michigan/isle-royale-national-park",
    "Map Link": "https://www.nps.gov/media/photo/collection-item.htm?pg=7323739&cid=305fb7af-a71b-469b-941e-a98b439c882f&id=04c7d59d-3a6d-44e7-aa70-850cbbe00b85&sid=7999c7a0-c03a-4818-9e2a-77c9b2056b96&p=1&sort=relevance",
    "Map Type": "Park Map"
  },
  {
    "Name": "Joshua Tree",
    "Description": "Spanning Southern California's rugged terrains, Joshua Tree National Park sits where Colorado and Mojave Deserts converge, creating a captivating mix of ecosystems. This expansive area is famous for its Joshua trees, whose twisted, spiky forms are iconic park symbols. The landscape lures nature seekers, with serene sand dunes, arid lakebeds, jagged mountains, and unique monzogranite formations.\n\nThe park’s varying elevations offer diverse environments, each with unique traits. The higher Mojave Desert hosts dense Joshua tree groves and cooler temperatures, while the lower Colorado Desert features a more arid landscape with creosote bushes, ocotillos, and cholla cacti.\n\nA mecca for rock climbers, Joshua Tree's monoliths and rocky formations, including Hidden Valley and Skull Rock, offer countless climbing routes for all skills. Hikers can follow trails through winding canyons, broad washes, and ancient oases, with possibilities to spot desert wildlife like bighorn sheep, coyotes, and jackrabbits.\n\nCamping beneath the expansive desert night sky is an unforgettable adventure. Far from city lights, this International Dark Sky Park provides spectacular Milky Way views amid a sea of stars. Whether to stargaze, photograph dramatic scenery, or find peace in wide spaces, Joshua Tree National Park has endless rewards for those exploring its striking, otherworldly beauty.",
    "Location": "33.79,-115.90",
    "Established": "October 31, 1994",
    "Area": "795,155.85 acres (3,217.9 km2)",
    "Annual_Visitors": 3058294,
    "Latitude": 33.79,
    "Longitude": -115.9,
    "AllTrails URL": "https://www.alltrails.com/parks/us/california/joshua-tree-national-park",
    "Map Link": "https://www.nps.gov/media/photo/collection-item.htm?pg=7323739&cid=305fb7af-a71b-469b-941e-a98b439c882f&id=ea25e28b-aa66-41a1-93eb-f9801fdab78a&sid=f771c9f0-78dc-424e-999a-a3dbcf75f6c0&p=1&sort=relevance",
    "Map Type": "Park Map"
  },
  {
    "Name": "Katmai",
    "Description": "Located on the remote Alaska Peninsula, Katmai National Park combines natural beauty with rugged wilderness and geological wonder. Known for unparalleled brown bear viewing, the park attracts wildlife enthusiasts and photographers worldwide. Each summer, over 2,000 grizzly bears gather along the Brooks River and other waterways to feast on spawning salmon, creating a remarkable natural spectacle.\n\nBeyond its bear population, Katmai is a haven for diverse wildlife, including caribou, wolves, moose, and elusive wolverines, drawing those eager to discover Alaska’s wild side. The park is also rich in geological marvels. At its core is the Valley of Ten Thousand Smokes, an ash-covered expanse formed by the 1912 Novarupta eruption, one of history's most powerful volcanic events. Visitors can hike or join guided tours to witness this surreal terrain and learn about the forces that shaped it.\n\nDominating the park's horizon, Mount Katmai, a massive stratovolcano, hints at the region's volcanic origins' raw power. Due to its remote location, access is largely by floatplane, adding adventure to the journey. Katmai National Park offers outdoor enthusiasts a haven and a deep appreciation for Alaska's wild beauty and dynamic history.",
    "Location": "58.50,-155.00",
    "Established": "December 2, 1980",
    "Area": "3,674,529.33 acres (14,870.3 km2)",
    "Annual_Visitors": 33908,
    "Latitude": 58.5,
    "Longitude": -155.0,
    "AllTrails URL": "https://www.alltrails.com/parks/us/alaska/katmai-national-park",
    "Map Link": "https://www.nps.gov/media/photo/collection-item.htm?pg=7323739&cid=305fb7af-a71b-469b-941e-a98b439c882f&id=e2856dec-a502-4d6b-8ce7-a59010009df3&sid=2f468cdc-d858-4018-aa78-28ef989a0a01&p=1&sort=relevance",
    "Map Type": "Park Map"
  },
  {
    "Name": "Kenai Fjords",
    "Description": "Located on Alaska's stunning Kenai Peninsula near Seward, Kenai Fjords National Park is a striking wilderness of glaciers, fjords, and a diverse array of wildlife. This park safeguards the vast Harding Icefield, one of the most expansive icefields in the U.S., feeding at least 38 glaciers cascading into rugged, glacier-carved fjords. Visitors can discover both the dramatic vistas and rich ecosystems where land converges with the sea.\n\nExit Glacier is the park's most accessible feature, located just a short drive from Seward. Here, visitors can tackle well-maintained trails for close-up views of the glacier and the surrounding areas, with interpretive signs offering insights into climate change and the glacier's retreat. Beyond Exit Glacier, the park is reachable only by water or foot, making it perfect for those seeking adventure in pristine, remote locales.\n\nFor those interested in the marine environment, boat and kayak tours set off from Seward, venturing deep into the heart of the fjords. These journeys offer unforgettable views of tidewater glaciers dramatically calving into the sea, alongside fantastic wildlife watching. Keep an eye out for humpback whales, orcas, sea otters, harbor seals, Steller sea lions, and various seabirds like puffins and bald eagles. Kayaking offers a closer encounter, allowing you to glide through serene waters amid towering cliffs, cascading waterfalls, and glacier-blue icebergs.\n\nKenai Fjords National Park is a haven for enthusiasts drawn to its mix of rugged beauty and accessibility. Whether hiking, kayaking, or on a boat tour, this park provides a front-row seat to some of Alaska's most breathtaking natural spectacles and a deeper appreciation for the forces that sculpt this awe-inspiring landscape.",
    "Location": "59.92,-149.65",
    "Established": "December 2, 1980",
    "Area": "669,650.05 acres (2,710.0 km2)",
    "Annual_Visitors": 389943,
    "Latitude": 59.92,
    "Longitude": -149.65,
    "AllTrails URL": "https://www.alltrails.com/parks/us/alaska/kenai-fjords-national-park",
    "Map Link": "https://www.nps.gov/media/photo/collection-item.htm?pg=7323739&cid=305fb7af-a71b-469b-941e-a98b439c882f&id=baeb9d79-7a90-4669-9bfb-f491afef6e99&sid=6c045bfd-262b-48e1-8ce8-d265ee212abb&p=1&sort=relevance",
    "Map Type": "Park Map"
  },
  {
    "Name": "Kings Canyon",
    "Description": "Set against the dramatic backdrop of California's Sierra Nevada mountains, Kings Canyon National Park provides a distinctive blend of natural marvels for outdoor enthusiasts to explore. Noted for its deep valleys, towering giant sequoias, and rugged high-country trails, it is a prime spot for hiking, backpacking, and camping.\n\nKings Canyon hosts several groves of giant sequoias, featuring the iconic General Grant Tree. As the world's second-largest tree, the General Grant Tree inspires awe with its size and enduring presence, symbolizing nature’s resilience. Moreover, this ancient tree is known as the United States' \"National Christmas Tree\" due to its majestic stature.\n\nThe Kings River, with its powerful flow, carves the park's namesake canyon into the granite, crafting a landscape excellent for adventure and photography. The San Joaquin River also flows through a sector of the park, highlighting its diverse ecosystems. For those intrigued by subterranean sights, Boyden Cave is a must-see. This limestone cavern along the Kings River boasts stunning stalactites, stalagmites, and flowstones.\n\nKings Canyon National Park, designated in 1940, boasts rich history. It encompasses the former General Grant National Park, established in 1890 as the nation's fourth national park. This historical depth adds layers of significance, bonding visitors to over a century of conservation efforts in the region.\n\nWhether trekking high above the canyon, awestruck by ancient sequoias, or exploring vibrant rivers and caves, Kings Canyon provides an unforgettable nature experience for adventurers of all kinds.",
    "Location": "36.80,-118.55",
    "Established": "March 4, 1940",
    "Area": "461,901.20 acres (1,869.2 km2)",
    "Annual_Visitors": 640986,
    "Latitude": 36.8,
    "Longitude": -118.55,
    "AllTrails URL": "https://www.alltrails.com/parks/us/california/kings-canyon-national-park",
    "Map Link": "https://www.nps.gov/media/photo/collection-item.htm?pg=7323739&cid=305fb7af-a71b-469b-941e-a98b439c882f&id=dd2e2a37-1ec5-4f86-939c-4d37d9136657&sid=37e091db-7d71-4936-8ba4-795ed36ca738&p=1&sort=relevance",
    "Map Type": "Park Map"
  },
  {
    "Name": "Kobuk Valley",
    "Description": "Perched in the remote reaches of northern Alaska, Kobuk Valley National Park is a genuine wilderness offering a rare mix of geological marvel and wildlife spectacle. Covering 61 miles (98 km) of the winding Kobuk River, the park features three distinctive areas of Arctic sand dunes: the Great Kobuk, Little Kobuk, and Hunt River Sand Dunes. These dunes, sculpted over millennia by glaciers and strong winds, rise dramatically to heights of 100 feet (30 m) and can reach summer temperatures of up to 100°F (38°C)—a surprising occurrence in the Arctic Circle.\n\nWhat truly sets Kobuk Valley apart is the dynamic interplay between its environment and wildlife. Twice annually, about half a million caribou embark on their monumental migration through the park. This ancient journey takes them over the dunes and along river bluffs, where keen eyes might spot well-preserved ice age fossils embedded in the earth—a chance to observe one of the globe's great migrations and glimpse prehistoric times.\n\nFor those seeking adventure, Kobuk Valley offers an unmatched chance to explore a truly untamed landscape. With no roads, trails, or marked campsites, the park's pristine allure challenges travelers to rely on their navigation skills and embrace the solitude of the Alaskan wilderness. Paddling the serene Kobuk River, marveling at the Arctic sand dunes, or sighting a caribou herd promise an otherworldly experience for those willing to venture.",
    "Location": "67.55,-159.28",
    "Established": "December 2, 1980",
    "Area": "1,750,716.16 acres (7,084.9 km2)",
    "Annual_Visitors": 16925,
    "Latitude": 67.55,
    "Longitude": -159.28,
    "AllTrails URL": "https://www.alltrails.com/parks/us/alaska/kobuk-valley-national-park",
    "Map Link": "https://www.nps.gov/media/photo/collection-item.htm?pg=7323739&cid=305fb7af-a71b-469b-941e-a98b439c882f&id=1d89e532-8c68-4e5b-bd4e-c786081f27fb&sid=ccc2837c-3b7c-4485-ac86-066a87735d6a&p=1&sort=relevance",
    "Map Type": "Park Map"
  },
  {
    "Name": "Lake Clark",
    "Description": "Deep in the Alaskan wilderness, Lake Clark National Park provides a stunning mix of natural features, making it a paradise for adventurers. This varied landscape hosts active volcanoes, including the imposing Mount Redoubt, and a striking array of glaciers, rivers, and waterfalls. Visitors can explore an array of ecosystems, from temperate rainforests to broad tundra plateaus, all framed by three majestic mountain ranges. The park's pristine lakes and rivers offer fantastic fishing opportunities, while its remote, unspoiled setting is perfect for backcountry camping and hiking. Lake Clark’s dynamic environment is shaped by its four active volcanoes, forming a unique habitat rich in wildlife and geological features. Whether drawn by the serenity of its wilderness or the appeal of its rugged terrain, the park promises unforgettable experiences for every adventurer.",
    "Location": "60.97,-153.42",
    "Established": "December 2, 1980",
    "Area": "2,619,816.49 acres (10,602.0 km2)",
    "Annual_Visitors": 18187,
    "Latitude": 60.97,
    "Longitude": -153.42,
    "AllTrails URL": "https://www.alltrails.com/parks/us/alaska/lake-clark-national-park",
    "Map Link": "https://www.nps.gov/media/photo/collection-item.htm?pg=7323739&cid=305fb7af-a71b-469b-941e-a98b439c882f&id=8a7173c5-c0f0-4655-b842-a50cbabd8727&sid=3df441a0-626f-4c5f-ac76-425763a587e5&p=1&sort=relevance",
    "Map Type": "Park Map"
  },
  {
    "Name": "Lassen Volcanic",
    "Description": "Lassen Volcanic National Park is a captivating destination for those eager to witness a dynamic landscape shaped by volcanic activity. Home to Lassen Peak, the largest lava dome volcano on the planet, the park is unique in containing all four volcano types: shield, cinder cone, composite, and lava dome. Although Lassen Peak's last significant eruption was in 1915, much of the park remains geologically active, showing visitors the powerful forces at play beneath the Earth's surface.\n\nGeothermal features abound in the park, with bubbling mud pots, steaming fumaroles, and vividly colored boiling pools dotting the area. These features, heated by molten rock lying just below the crust, create an otherworldly environment both exciting and educational to explore. Popular sites like Bumpass Hell and Sulphur Works highlight these wonders, offering boardwalks and trails for safe exploration.\n\nFor hikers, the park offers trails ranging from easy walks to challenging routes. Adventurous visitors can ascend Lassen Peak itself, enjoying sweeping views from the summit. Remote areas of the park, such as the Cinder Cone area, feature striking volcanic formations and colorful painted dunes, ensuring each journey is memorable. For those seeking solitude, numerous lesser-known trails meander through lush forests, serene meadows, and pristine alpine lakes.\n\nCamping opportunities abound, allowing immersion in the park's tranquility and stargazing in its clear night skies. Fishing, wildlife watching, and photography attract visitors who appreciate the natural beauty. Whether exploring geothermal wonders, climbing volcanic peaks, or enjoying the peaceful backcountry, Lassen Volcanic National Park offers adventure with a glimpse into Earth's geological story.",
    "Location": "40.49,-121.51",
    "Established": "August 9, 1916",
    "Area": "106,589.02 acres (431.4 km2)",
    "Annual_Visitors": 446291,
    "Latitude": 40.49,
    "Longitude": -121.51,
    "AllTrails URL": "https://www.alltrails.com/parks/us/california/lassen-volcanic-national-park",
    "Map Link": "https://www.nps.gov/media/photo/collection-item.htm?pg=7323739&cid=305fb7af-a71b-469b-941e-a98b439c882f&id=f678c479-177a-46dc-8f50-8f18b9701538&sid=b50de5f0-ad6a-4dec-b800-dafcf9b90996&p=1&sort=relevance",
    "Map Type": "Park Map"
  },
  {
    "Name": "Mammoth Cave",
    "Description": "Mammoth Cave National Park hosts the world's longest known cave system, with over 400 miles of passages to explore. This subterranean wonder is a complex network of tunnels and chambers, rich in both history and geological significance. The cave hosts a variety of unique wildlife, including eight bat species, the eyeless Northern cavefish, cave salamanders, and endangered Kentucky cave shrimp. Each has adapted in extraordinary ways to flourish in this dark, otherworldly environment.\n\nAbove ground, the park offers captivating experiences for outdoor enthusiasts. The Green River flows through the park, providing kayaking, canoeing, and fishing opportunities amid lush, forested surroundings. Over 70 miles of hiking trails traverse diverse landscapes, showcasing sinkholes, springs, and karst terrain hills. Whether exploring the intricate cave passages below or the vibrant beauty above, Mammoth Cave offers a dynamic blend of adventure, science, and scenic tranquility for visitors of varying interests and skill levels.",
    "Location": "37.18,-86.10",
    "Established": "July 1, 1941",
    "Area": "72,472.87 acres (293.3 km2)",
    "Annual_Visitors": 663147,
    "Latitude": 37.18,
    "Longitude": -86.1,
    "AllTrails URL": "https://www.alltrails.com/parks/us/kentucky/mammoth-cave-national-park",
    "Map Link": "https://www.nps.gov/media/photo/collection-item.htm?pg=7323739&cid=305fb7af-a71b-469b-941e-a98b439c882f&id=b04c5c0e-fe2e-4830-b99b-ef953e9796f0&sid=148e51da-494e-413a-b502-5b08bb556560&p=1&sort=relevance",
    "Map Type": "Park Map"
  },
  {
    "Name": "Mesa Verde",
    "Description": "Mesa Verde National Park is a fascinating destination that preserves the history and culture of the Ancestral Puebloan people. Featuring more than 4,000 archaeological sites, including some of the best-preserved cliff dwellings in North America, it provides an unparalleled glimpse into the lives of a civilization that thrived in the Four Corners region for over 700 years. Among its highlights are the Cliff Palace, a complex structure with 150 rooms and 23 ceremonial kivas, and the Balcony House, noted for its narrow passages and tunnels inviting exploration.\n\nOutdoor lovers will discover a wealth of activities, with numerous hiking trails leading to awe-inspiring viewpoints and historic sites within the park's rugged landscapes. Scenic overlooks offer breathtaking views of the canyons and mesas that define this high desert environment. Beyond its archaeological treasures, Mesa Verde offers chances to spot wildlife, stargaze, and connect with nature while appreciating the legacy of the people who lived here centuries ago. Whether you're intrigued by history, seeking adventure, or simply in search of stunning scenery, this park delivers an unforgettable experience.",
    "Location": "37.18,-108.49",
    "Established": "June 29, 1906",
    "Area": "52,485.17 acres (212.4 km2)",
    "Annual_Visitors": 499790,
    "Latitude": 37.18,
    "Longitude": -108.49,
    "AllTrails URL": "https://www.alltrails.com/parks/us/colorado/mesa-verde-national-park",
    "Map Link": "https://www.nps.gov/media/photo/collection-item.htm?pg=7323739&cid=305fb7af-a71b-469b-941e-a98b439c882f&id=e80aa16e-e64f-479d-a000-a4c19d19bb87&sid=1c77fcc4-9f53-48f6-9b92-2d49e6496702&p=1&sort=relevance",
    "Map Type": "Park Map"
  },
  {
    "Name": "Mount Rainier",
    "Description": "Mount Rainier National Park is a place where breathtaking landscapes, ecological diversity, and outdoor adventure beautifully converge. Towering over the region, Mount Rainier is an active stratovolcano and a jewel of the Cascades, standing as the most prominent peak in the range. Its summit and slopes are covered by 26 named glaciers, including Carbon Glacier—the deepest in the U.S.—and Emmons Glacier, the largest by area in the contiguous United States, feeding pristine rivers and crafting a spectacular landscape for exploration.\n\nThe park is famed for its stunning wildflower meadows, bursting with color in the warmer months. Subalpine and alpine forests blanket over half of the park, offering a lush contrast to the rugged, snow-capped peaks. Paradise, located on the mountain's southern slope, lives up to its name with breathtaking views and a reputation as one of the snowiest places on Earth. The spring and summer wildflower displays attract photographers, hikers, and nature lovers, while winter brings opportunities for snowshoeing and other snowy adventures.\n\nFor those seeking an ultimate challenge, Mount Rainier is a popular destination for climbers aiming for its lofty summit. However, if lower-altitude treks are more appealing, the park offers a vast network of diverse trails for all levels. Among the highlights is the Wonderland Trail, a 93-mile loop around the mountain, offering sweeping vistas, river crossings, and the opportunity for a full-circle experience of the mountain. Many embark on this iconic journey from the Longmire Visitor Center, an excellent starting point for learning about the park.\n\nWhether you're drawn by its dramatic peaks, year-round adventure options, or the serenity of its natural beauty, Mount Rainier National Park captures the essence of the Pacific Northwest, blending alpine wonders and forested landscapes into an unforgettable outdoor experience.",
    "Location": "46.85,-121.75",
    "Established": "March 2, 1899",
    "Area": "236,381.64 acres (956.6 km2)",
    "Annual_Visitors": 1622395,
    "Latitude": 46.85,
    "Longitude": -121.75,
    "AllTrails URL": "https://www.alltrails.com/parks/us/washington/mount-rainier-national-park",
    "Map Link": "https://www.nps.gov/media/photo/collection-item.htm?pg=7323739&cid=305fb7af-a71b-469b-941e-a98b439c882f&id=fc0ae667-02bc-4613-9fd3-403aad3c33cc&sid=1482a476-e07d-452b-b1fd-be71a761a0de&p=1&sort=relevance",
    "Map Type": "Park Map"
  },
  {
    "Name": "New River Gorge",
    "Description": "Situated in the rugged Appalachian Mountains of West Virginia, New River Gorge National Park and Preserve provides an exceptional playground for outdoor enthusiasts. The park is celebrated for its world-class whitewater rafting, featuring exhilarating rapids that attract paddlers from around the globe. The New River, among the oldest on the continent, carves through the landscape, creating the deepest river gorge east of the Mississippi River, showcasing erosion's power over millennia.\n\nFor climbers, the park's sandstone cliffs are legendary, offering over 1,400 established routes of varying difficulty. Known for their durability and texture, these cliffs provide ideal conditions for traditional and sport climbing. Trails for hiking and biking wind through the gorge, ranging from easy riverside walks to challenging ridge-top treks rewarding adventurers with expansive views of the surrounding wilderness. Scenic locations like the Grandview overlook offer panoramic vistas, especially striking in the fall when the forested slopes blaze with vibrant colors.\n\nThe park's centerpiece is the iconic New River Gorge Bridge, one of the longest single-span arch bridges globally. It's not only an engineering marvel but also the focal point of the annual \"Bridge Day,\" where thrill-seekers can base jump or rappel from the towering structure.\n\nThe park also preserves unique cultural and historical sites. Visitors can explore the ghost town of Thurmond, offering insight into the region's coal-mining past, or visit Sandstone Falls, where the broad waters of the New River cascade in a serene and picturesque retreat.\n\nBeyond the main park area, an additional 65,165 acres designated as a national preserve covers 53 miles of the New River's winding course. This section allows hunting and fishing, offering even more opportunities for outdoor recreation. With its diverse landscapes, from roaring rapids to tranquil forests, New River Gorge is a paradise for adventure seekers, nature lovers, and history enthusiasts alike.",
    "Location": "38.07,-81.08",
    "Established": "December 27, 2020",
    "Area": "7,021 acres (28.4 km2)[91]",
    "Annual_Visitors": 1593523,
    "Latitude": 38.07,
    "Longitude": -81.08,
    "AllTrails URL": "https://www.alltrails.com/parks/us/west-virginia/new-river-gorge-national-park-and-preserve",
    "Map Link": "https://www.nps.gov/media/photo/collection-item.htm?pg=7323739&cid=305fb7af-a71b-469b-941e-a98b439c882f&id=c50bdefa-05fe-4e26-a554-66ad6b118ddd&sid=fc870e39-3d71-4bd5-ab15-ba89aa1b623a&p=1&sort=relevance",
    "Map Type": "Park Map"
  },
  {
    "Name": "North Cascades",
    "Description": "Nestled in the Pacific Northwest, the North Cascades National Park is a paradise for outdoor enthusiasts seeking untamed wilderness and stunning alpine scenery. Known for its rugged peaks and large glacier network, this remote mountain range offers a captivating glimpse into the region’s geological richness. Stretching between deep river valleys and lofty summits, the park showcases incredible natural diversity, covering eight distinct life zones. These habitats support a vast array of wildlife, including 75 mammal species and over 1,600 species of vascular plants, making it a delight for nature lovers and photographers.\n\nFor hikers and climbers, the park's Stephen Mather Wilderness offers a plethora of opportunities to explore iconic locations such as Cascade Pass, Mount Shuksan, Mount Triumph, and Eldorado Peak. Each trail and climb promises unique vistas, from jagged ridgelines to lush alpine meadows bursting with wildflowers. Besides its land-based adventures, the North Cascades region includes the neighboring Ross Lake and Lake Chelan National Recreation Areas. These calm waters provide chances for kayaking, fishing, or simply enjoying the dramatic peaks reflected on the lake's surface. Managed together, these territories collectively exhibit the unmatched beauty and diversity of the North Cascades, inviting visitors to immerse themselves in one of the United States' wildest and most pristine landscapes.",
    "Location": "48.70,-121.20",
    "Established": "October 2, 1968",
    "Area": "504,780.94 acres (2,042.8 km2)",
    "Annual_Visitors": 30154,
    "Latitude": 48.7,
    "Longitude": -121.2,
    "AllTrails URL": "https://www.alltrails.com/parks/us/washington/north-cascades-national-park",
    "Map Link": "https://www.nps.gov/media/photo/collection-item.htm?pg=7323739&cid=305fb7af-a71b-469b-941e-a98b439c882f&id=0bce42a6-7aca-4193-8c8a-617f898da42a&sid=ec623cbd-2787-48fa-b669-e54d73f176ff&p=1&sort=relevance",
    "Map Type": "Park Map"
  },
  {
    "Name": "Olympic",
    "Description": "Situated on Washington State's Olympic Peninsula, Olympic National Park offers a stunning mix of ecosystems, making it a haven for outdoor enthusiasts and nature lovers. From the rugged Pacific coastline shaped over millennia to moss-covered temperate rainforests and the snow-clad peaks of the Olympic Mountains, this park encompasses unparalleled landscape diversity in a single destination. One of its gems, Mount Olympus, rises to 7,980 feet, capped with glaciers and providing a dramatic backdrop for alpine explorers. \n\nThe park's vibrant rainforests, such as the Hoh and Quinault, are remarkable ecosystems receiving nearly 12 feet (3.7 meters) of rain each year, making them the wettest places in the contiguous United States. Here, lush ferns blanket the ground, towering Sitka spruces and western hemlocks reach skyward, and clear streams meander through the emerald landscape—a paradise for hikers and photographers.\n\nFor those intrigued by the coast, the park's Pacific shoreline features dramatic sea stacks, tide pools brimming with marine life, and untouched beaches perfect for sunset views or camping under the stars. Trail networks like the Hoh River Trail lead adventurers deep into the wilderness, while shorter paths connect to tranquil waterfalls or panoramic viewpoints. Olympic National Park is also a designated World Heritage Site and Biosphere Reserve, underscoring its ecological significance and global importance.\n\nWhether embarking on a multi-day backpacking adventure, enjoying a forest stroll, or marveling at the park’s stunning vistas, Olympic National Park promises an unforgettable experience in one of the most diverse and untouched natural settings in the United States.",
    "Location": "47.97,-123.50",
    "Established": "June 29, 1938",
    "Area": "922,649.41 acres (3,733.8 km2)",
    "Annual_Visitors": 2432972,
    "Latitude": 47.97,
    "Longitude": -123.5,
    "AllTrails URL": "https://www.alltrails.com/parks/us/washington/olympic-national-park",
    "Map Link": "https://www.nps.gov/media/photo/collection-item.htm?pg=7323739&cid=305fb7af-a71b-469b-941e-a98b439c882f&id=d8dcb91a-4eba-467d-861f-16cf66c69272&sid=c7b9c029-7d5e-43f2-8902-3efc7cbb49b6&p=1&sort=relevance",
    "Map Type": "Park Map"
  },
  {
    "Name": "Petrified Forest",
    "Description": "Located in northeastern Arizona, Petrified Forest National Park is an extraordinary destination blending history with outdoor adventure. This captivating desert landscape is renowned for its extensive array of 225-million-year-old petrified wood, offering a glimpse into prehistoric life frozen in stone. The park is part of the Chinle Formation, a geological wonder also featuring the adjacent Painted Desert. Here, visitors find sweeping vistas of eroded cliffs decorated in vibrant hues of red, pink, and orange, thanks to layers of volcanic ash and bentonite clay.\n\nBeyond its striking geology, the park holds remarkable archaeological and paleontological significance. Over 350 protected Native American sites are situated here, preserving the cultural legacy of the ancestral Puebloans who lived in this area. Additionally, the park has revealed dinosaur fossils, offering insights into the creatures that inhabited Earth millions of years ago.\n\nFor those seeking exploration, Petrified Forest National Park provides a variety of scenic hiking trails suitable for different skill levels. These paths guide visitors through alien-like badlands, past hillsides rich in petrified logs, and to petroglyphs etched into rock faces. While camping within the park isn’t permitted, nearby camping alternatives serve as a perfect base for diving into this unique wilderness. Visitors can also witness stunning sunsets that illuminate the Painted Desert or embark on the 28-mile scenic drive to enjoy the park’s remarkable diversity.\n\nWhether you're intrigued by ancient fossils, fascinated by geological marvels, or drawn to historical stories, Petrified Forest National Park presents a remarkable chance to connect with the natural and cultural history of the American Southwest.",
    "Location": "35.07,-109.78",
    "Established": "December 9, 1962",
    "Area": "221,390.21 acres (895.9 km2)",
    "Annual_Visitors": 505209,
    "Latitude": 35.07,
    "Longitude": -109.78,
    "AllTrails URL": "https://www.alltrails.com/parks/us/arizona/petrified-forest-national-park",
    "Map Link": "https://www.nps.gov/media/photo/collection-item.htm?pg=7323739&cid=305fb7af-a71b-469b-941e-a98b439c882f&id=fbbdcfeb-ea75-4b7d-b352-434e3f91439c&sid=ab05a1cb-2d77-4074-903e-c4afba7b4531&p=1&sort=relevance",
    "Map Type": "Park Map"
  },
  {
    "Name": "Pinnacles",
    "Description": "Nestled within California’s Coast Range, Pinnacles National Park is a paradise for outdoor lovers, featuring unique geology, diverse wildlife, and thrilling activities. The park's striking rock formations—towering black and gold monoliths of andesite and rhyolite—are remnants of an ancient volcano, eroded over millions of years into dramatic spires and cliffs. These rugged formations attract rock climbers from around the world, with routes ranging from novice to expert levels.\n\nFor hikers, the park offers an extensive network of trails winding through scenic canyons, rolling chaparral, and oak woodlands. Some trails lead to breathtaking vistas, providing sweeping views of the surrounding wilderness, while others venture into Pinnacles' famous talus caves—formed by massive boulders wedged into narrow gorges. Exploring these caves is a distinctive adventure, flashlight in hand, as they are home to over 13 species of bats, including the rare Townsend's big-eared bat.\n\nPinnacles is also a vital refuge for wildlife enthusiasts. It's one of the few sanctuaries where visitors might spot the endangered California condor soaring above, a species brought back from the brink of extinction through dedicated conservation efforts. The park also supports a thriving population of prairie falcons and countless other bird species, making it a birdwatcher's paradise.\n\nFor those seeking a closer connection to nature, the park offers backcountry camping opportunities under some of California’s clearest night skies—ideal for stargazing and immersing yourself in the tranquility. Whether climbing its rocky pinnacles, hiking its trails, exploring its caves, or marveling at its wildlife, Pinnacles National Park offers an unforgettable mix of adventure and natural beauty.",
    "Location": "36.48,-121.16",
    "Established": "January 10, 2013",
    "Area": "26,685.73 acres (108.0 km2)",
    "Annual_Visitors": 275023,
    "Latitude": 36.48,
    "Longitude": -121.16,
    "AllTrails URL": "https://www.alltrails.com/parks/us/california/pinnacles-national-park",
    "Map Link": "https://www.nps.gov/media/photo/collection-item.htm?pg=7323739&cid=305fb7af-a71b-469b-941e-a98b439c882f&id=245fbfaa-5bec-4d6e-a251-edac22cddb47&sid=81125f92-60b7-4e61-83ec-fccdee855218&p=1&sort=relevance",
    "Map Type": "Park Map"
  },
  {
    "Name": "Redwood",
    "Description": "A visit to Redwood National and State Parks provides an unforgettable journey into one of the world's most magnificent natural landscapes. Home to ancient coastal redwoods—the tallest trees on Earth—this park system protects nearly half of the planet's remaining old-growth redwoods. Amid these towering giants, you'll find lush forests filled with life, dramatic ocean vistas, and endless opportunities for exploration.\n\nThe park includes three major river systems coursing through its richly diverse terrain, carving paths through valleys and feeding vibrant ecosystems. Along its 37 miles (60 km) of protected coastline, visitors can explore pristine beaches, discover tide pools teeming with marine life, and admire striking sea stacks rising from the water. From dense forest canopies to coastal prairies and river estuaries, the park's varied landscapes support a rich variety of plant and animal species, including Roosevelt elk, black bears, and bald eagles.\n\nFor hiking enthusiasts, the park offers a vast trail network, ranging from short, family-friendly walks to challenging backcountry treks. Trails lead through misty redwood groves, past cascading waterfalls, and up to panoramic viewpoints overlooking the Pacific Ocean. Campers can immerse themselves in nature's tranquility, surrounded by the awe-inspiring presence of trees that have stood for thousands of years.\n\nRedwood National and State Parks sit on a geologically active region, enhancing the area's dynamic character. The park’s seismic landscape not only shapes its rivers and cliffs but also serves as a testament to the natural forces that sculpted this incredible environment over millennia.\n\nWhether you’re a nature lover, photographer, or seeking an outdoor retreat, Redwood has something extraordinary to offer. With its rare blend of towering forests, rugged coastline, and thriving ecosystems, the park invites visitors to connect deeply with one of the planet’s most remarkable natural wonders.",
    "Location": "41.30,-124.00",
    "Established": "October 2, 1968",
    "Area": "138,999.37 acres (562.5 km2)",
    "Annual_Visitors": 458400,
    "Latitude": 41.3,
    "Longitude": -124.0,
    "AllTrails URL": "https://www.alltrails.com/parks/us/california/redwood-national-park",
    "Map Link": "https://www.nps.gov/media/photo/collection-item.htm?pg=7323739&cid=305fb7af-a71b-469b-941e-a98b439c882f&id=d8e193ab-a456-4534-bde4-04c5f71429d6&sid=2cf52d31-e288-4b70-ae1c-4a8973b65aed&p=1&sort=relevance",
    "Map Type": "Park Map"
  },
  {
    "Name": "Rocky Mountain",
    "Description": "Set amidst Colorado's stunning landscape, Rocky Mountain National Park boasts a breathtaking fusion of towering peaks, serene alpine lakes, and diverse ecosystems spread across its rugged terrain. Spanning both sides of the Continental Divide, the park offers impressive habitats, from numerous crystal-clear riparian lakes to dense montane and subalpine forests and the windswept alpine tundra. This diversity makes the park a haven for wildlife enthusiasts, supporting species like elk, moose, mule deer, bighorn sheep, black bears, and elusive predators like cougars.\n\nAdventurers flock to destinations like Longs Peak, the park's iconic \"fourteener,\" standing at 14,259 feet, offering a challenging climb for seasoned hikers. Bear Lake is another must-see, a picturesque, accessible spot that reflects the surrounding peaks and provides trailheads to various hikes suitable for all skill levels.\n\nFor those who prefer a scenic drive, the historic Trail Ridge Road is an experience not to be missed. Rising to elevations over 12,000 feet, it offers sweeping views of the valleys and mountains, with chances to spot wildlife and explore trails right off the road. Look out for marmots and pikas among the high-altitude rocks.\n\nRocky Mountain National Park's glacial valleys and igneous peaks provide year-round exploration, from summer wildflower meadows to snowshoeing and wildlife watching in winter. Whether seeking challenging hikes or peaceful solitude, the park's varied landscapes and biodiversity make it a premier destination for outdoor enthusiasts.",
    "Location": "40.40,-105.58",
    "Established": "January 26, 1915",
    "Area": "265,847.74 acres (1,075.8 km2)",
    "Annual_Visitors": 4300424,
    "Latitude": 40.4,
    "Longitude": -105.58,
    "AllTrails URL": "https://www.alltrails.com/parks/us/colorado/rocky-mountain-national-park",
    "Map Link": "https://www.nps.gov/media/photo/collection-item.htm?pg=7323739&cid=305fb7af-a71b-469b-941e-a98b439c882f&id=4bc081d5-6c1f-4666-a865-128f68703615&sid=ea76ab53-0c4f-44d6-9406-cfbde1e3299b&p=1&sort=relevance",
    "Map Type": "Park Map"
  },
  {
    "Name": "Saguaro",
    "Description": "Saguaro National Park, a vibrant sanctuary in the Sonoran Desert, is where towering saguaro cacti make an iconic silhouette against the broad desert skies. The park is divided into two distinct districts, the Rincon Mountain District to the east and the Tucson Mountain District to the west, each offering a unique blend of desert scenery and outdoor adventure.\n\nThis diverse desert ecosystem is home to six distinct biotic communities, showcasing an impressive array of plant and animal life. Beyond the giant saguaro cacti—some living over 150 years and growing to 40 feet tall—you'll find barrel cacti, cholla cacti, and prickly pear cacti scattered across the terrain. The plant life is adapted to the arid climate, exploding into colorful blooms in the spring, adding vibrant colors to the desert.\n\nWildlife enthusiasts can look out for species adapted to this dry environment. Among the notable inhabitants are lesser long-nosed bats, vital pollinators for the saguaro, along with spotted owls and javelinas. In the quiet desert, you might hear a cactus wren or spot a Gila woodpecker during your visit.\n\nThe park offers a range of activities for outdoor enthusiasts. There are numerous hiking trails catering to different skill levels, from easy desert walks to challenging climbs with breathtaking views. Camping is available in the Rincon Mountain District, where backcountry sites provide a true connection to the serenity and isolation of the desert wilderness.\n\nThe park is also an educational treasure, offering insights into the region's natural and cultural history. The saguaro is deeply tied to the culture and ecology of the desert, and learning about its role provides a deeper appreciation for this stunning landscape.\n\nWhether immersing yourself in a quiet desert sunset or exploring the trails, Saguaro National Park provides an unforgettable experience for nature lovers and adventure seekers alike.",
    "Location": "32.25,-110.50",
    "Established": "October 14, 1994",
    "Area": "92,876.75 acres (375.9 km2)",
    "Annual_Visitors": 908194,
    "Latitude": 32.25,
    "Longitude": -110.5,
    "AllTrails URL": "https://www.alltrails.com/parks/us/arizona/saguaro-national-park",
    "Map Link": "https://www.nps.gov/media/photo/collection-item.htm?pg=7323739&cid=305fb7af-a71b-469b-941e-a98b439c882f&id=706ef799-bd6f-4fff-bda4-7c9d05581be8&sid=c9eb629b-c105-4990-9eb3-13a9afc23f43&p=1&sort=relevance | https://www.nps.gov/media/photo/collection-item.htm?pg=7323739&cid=305fb7af-a71b-469b-941e-a98b439c882f&id=896a5b98-90e0-4902-adf4-3ec8c3bab200&sid=c9eb629b-c105-4990-9eb3-13a9afc23f43&p=1&sort=relevance",
    "Map Type": "Multiple Park Maps"
  },
  {
    "Name": "Sequoia",
    "Description": "Nestled within California's Sierra Nevada, Sequoia National Park presents an awe-inspiring mix of towering giant sequoias, dramatic alpine landscapes, and serene valleys. The park is a sanctuary for nature enthusiasts, offering endless opportunities for hiking, backpacking, and scenic camping. It's famed for the Giant Forest, home to some of the largest trees on Earth, including the General Sherman Tree—the largest by volume in the world.\n\nThe park's wonders extend beyond trees. Sequoia protects over 240 caves, each rich with geological formations and underground ecosystems. Its rugged terrain includes a significant stretch of the Sierra Nevada mountain range, featuring Mount Whitney, the tallest peak in the contiguous United States at 14,505 feet.\n\nFor panoramic views, Moro Rock, a striking granite dome, offers a challenging but rewarding climb via a stairway carved into the rock. From its summit, visitors are treated to sweeping views of the surrounding wilderness. The park’s diverse landscapes also support a rich array of wildlife, from black bears and marmots to various bird species.\n\nSequoia National Park is where nature’s grandeur is experienced in all its forms, making it a must-visit for outdoor adventurers and anyone eager to connect with the natural world.",
    "Location": "36.43,-118.68",
    "Established": "September 25, 1890",
    "Area": "404,062.63 acres (1,635.2 km2)",
    "Annual_Visitors": 1153198,
    "Latitude": 36.43,
    "Longitude": -118.68,
    "AllTrails URL": "https://www.alltrails.com/parks/us/california/sequoia-national-park",
    "Map Link": "https://www.nps.gov/media/photo/collection-item.htm?pg=7323739&cid=305fb7af-a71b-469b-941e-a98b439c882f&id=dd2e2a37-1ec5-4f86-939c-4d37d9136657&sid=8558dd8e-8331-4886-a32c-39a4f1a7f996&p=1&sort=relevance",
    "Map Type": "Park Map"
  },
  {
    "Name": "Shenandoah",
    "Description": "Nestled in the Blue Ridge Mountains, Shenandoah National Park offers an ideal retreat for outdoor enthusiasts. Known for its stunning vistas and cascading waterfalls, the park is a haven for hikers, campers, and anyone seeking to immerse in nature. Its rolling hills are covered by thriving hardwood forests, offering habitats for diverse wildlife, from white-tailed deer and black bears to countless bird species.\n\nThe park’s iconic Skyline Drive runs its entire length, a 105-mile scenic roadway known for sweeping views and access to numerous trailheads. The Appalachian Trail also winds through Shenandoah, providing hikers the opportunity to explore this legendary footpath amidst serene landscapes.\n\nIn addition to the Appalachian Trail, Shenandoah boasts over 500 miles of hiking trails ranging from gentle walks to challenging backcountry treks. Many paths lead to awe-inspiring overlooks, peaceful meadows, or the park’s famous waterfalls, particularly vibrant after rain.\n\nWhether enjoying a sunrise from an overlook, spotting wildflowers along the trails, or camping under a starlit sky, Shenandoah’s blend of rugged nature and tranquil beauty makes it a destination worth exploring. With its rich biodiversity, varied trail system, and easy access to natural wonders, it offers something to inspire adventurers of all skill levels.",
    "Location": "38.53,-78.35",
    "Established": "December 26, 1935",
    "Area": "200,445.92 acres (811.2 km2)",
    "Annual_Visitors": 1449300,
    "Latitude": 38.53,
    "Longitude": -78.35,
    "AllTrails URL": "https://www.alltrails.com/parks/us/virginia/shenandoah-national-park",
    "Map Link": "https://www.nps.gov/media/photo/collection-item.htm?pg=7323739&cid=305fb7af-a71b-469b-941e-a98b439c882f&id=eefb165e-1c50-4cee-82ce-7fa63aa675cb&sid=bbfb0de4-febf-482f-b695-566f4fce339c&p=1&sort=relevance",
    "Map Type": "Park Map"
  },
  {
    "Name": "Theodore Roosevelt",
    "Description": "Spread across the dramatic northern badlands, Theodore Roosevelt National Park pays tribute to the conservation legacy of the 26th president of the United States. Encompassing three distinct units, the park offers a captivating mix of history, adventure, and untamed wilderness. President Theodore Roosevelt's historic Maltese Cross Cabin invites visitors to step back in time and learn about the personal experiences that fueled his lifelong dedication to conservation.\n\nOutdoor enthusiasts will discover plenty to explore, from winding scenic drives unveiling sweeping vistas of rugged terrain to extensive backcountry trails traversing remote and varied landscapes. The park is a haven for wildlife, with opportunities to spot American bison roaming the plains, pronghorn darting through grasslands, bighorn sheep scaling rocky slopes, and bands of wild horses embodying the spirit of the West.\n\nWhether you're eager to hike among unique geological formations, spot diverse wildlife, or simply enjoy the tranquility of an unspoiled environment, Theodore Roosevelt National Park provides an authentic and enriching outdoor experience. Here, history and nature blend seamlessly, reflecting a president's values inspired by these very landscapes and his commitment to preserving America's natural treasures.",
    "Location": "46.97,-103.45",
    "Established": "November 10, 1978",
    "Area": "70,446.89 acres (285.1 km2)",
    "Annual_Visitors": 668679,
    "Latitude": 46.97,
    "Longitude": -103.45,
    "AllTrails URL": "https://www.alltrails.com/parks/us/north-dakota/theodore-roosevelt-national-park",
    "Map Link": "https://www.nps.gov/media/photo/collection-item.htm?pg=7323739&cid=305fb7af-a71b-469b-941e-a98b439c882f&id=5f169c66-049e-4f55-8070-2b9c551c9e91&sid=ed2c9696-62ae-439c-8fff-0eeb0755d78a&p=1&sort=relevance | https://www.nps.gov/media/photo/collection-item.htm?pg=7323739&cid=305fb7af-a71b-469b-941e-a98b439c882f&id=0b9717f0-8f0b-490c-8af8-2f240995d5d5&sid=ed2c9696-62ae-439c-8fff-0eeb0755d78a&p=1&sort=relevance | https://www.nps.gov/media/photo/collection-item.htm?pg=7323739&cid=305fb7af-a71b-469b-941e-a98b439c882f&id=e0d2ec38-2e99-4094-85ef-9a324c4ef861&sid=ed2c9696-62ae-439c-8fff-0eeb0755d78a&p=1&sort=relevance",
    "Map Type": "Multiple Park Maps"
  },
  {
    "Name": "Virgin Islands",
    "Description": "Located on the picturesque island of Saint John, Virgin Islands National Park is a paradise for outdoor enthusiasts and nature lovers. The park is famed for its pristine tropical beaches, crystal-clear waters, and vibrant coral reefs, creating an ideal setting for snorkeling, kayaking, and exploring marine life. Beyond the shoreline, mangrove forests and seagrass beds teem with biodiversity, offering a closer look at the delicate ecosystems thriving in this Caribbean haven.\n\nHistory buffs will find intrigue in the park’s cultural heritage. Scattered across the landscape are ancient Taíno archaeological sites that offer a glimpse into the lives of the island’s indigenous people. Visitors can also explore the ruins of sugar plantations dating back to the colonial era, remnants of a time when Saint John played a pivotal role in the global sugar trade.\n\nThe park's diverse offerings make it much more than just a beach destination. Whether you're camping under the stars, paddling along serene coastlines, hiking lush trails, or immersing yourself in the area's rich cultural history, Virgin Islands National Park invites you to connect with its natural beauty and storied past. With so much to experience, it’s a place that encourages both adventure and reflection.",
    "Location": "18.33,-64.73",
    "Established": "August 2, 1956",
    "Area": "15,052.33 acres (60.9 km2)",
    "Annual_Visitors": 196752,
    "Latitude": 18.33,
    "Longitude": -64.73,
    "AllTrails URL": "https://www.alltrails.com/parks/us-virgin-islands/virgin-islands-national-park",
    "Map Link": "https://www.nps.gov/media/photo/collection-item.htm?pg=7323739&cid=305fb7af-a71b-469b-941e-a98b439c882f&id=b30ea551-542f-40d0-a0dd-dacdd716f61c&sid=d5675249-faee-4893-8539-0c4127c67fec&p=1&sort=relevance",
    "Map Type": "Park Map"
  },
  {
    "Name": "Voyageurs",
    "Description": "Voyageurs National Park offers a blend of breathtaking natural beauty, rich cultural history, and exceptional water-based recreation opportunities. Situated along the U.S.-Canada border, the park is defined by its vast network of interconnected waterways, making it a premier destination for canoeing, kayaking, and island camping enthusiasts. At its heart are four expansive lakes—Rainy, Kabetogama, Namakan, and Sand Point—framed by a landscape sculpted by ancient glaciers. Visitors can explore towering bluffs, intricate rock gardens, secluded bays, and over 500 islands scattered across the waters.\n\nBeyond its striking landscapes, Voyageurs is steeped in history. For thousands of years, this area was home to the Ojibwe people, whose enduring connection to the land is reflected in the region’s name and cultural landmarks. The park also commemorates the French-Canadian fur traders, or voyageurs, who navigated these waters during the 18th and 19th centuries as part of the fur trade. The allure of gold later brought miners to the area, adding another chapter to Voyageurs’ storied past. Several preserved historic buildings and sites throughout the park offer glimpses into these diverse eras.\n\nFishing enthusiasts will find ample opportunities to catch walleye, northern pike, smallmouth bass, and more. For those seeking land-based adventure, trails wind through forests and along lakeshores, offering stunning views and a chance to spot local wildlife such as bald eagles, moose, and black bears. The park is also renowned for its night skies; far from city lights, it provides incredible stargazing opportunities and occasional views of the northern lights. Whether paddling through peaceful waters, soaking in vibrant sunsets, or exploring the area’s layered history, Voyageurs National Park promises an unforgettable outdoor experience.",
    "Location": "48.50,-92.88",
    "Established": "April 8, 1975",
    "Area": "218,222.35 acres (883.1 km2)",
    "Annual_Visitors": 221434,
    "Latitude": 48.5,
    "Longitude": -92.88,
    "AllTrails URL": "https://www.alltrails.com/parks/us/minnesota/voyageurs-national-park",
    "Map Link": "https://www.nps.gov/media/photo/collection-item.htm?pg=7323739&cid=305fb7af-a71b-469b-941e-a98b439c882f&id=04a21afb-ad47-4ae9-a196-925699d75640&sid=b958ffb9-3498-4006-af8f-429e8160f687&p=1&sort=relevance",
    "Map Type": "Park Map"
  },
  {
    "Name": "White Sands",
    "Description": "Nestled within the mountain-ringed Tularosa Basin in southern New Mexico, White Sands National Park boasts the largest gypsum dune field on Earth. Spanning the southern portion of a 275-square-mile expanse, these dazzling white dunes, composed entirely of gypsum crystals, create an otherworldly landscape. Unlike typical sand, gypsum doesn’t retain heat, so the dunes remain cool to the touch, perfect for year-round exploration.\n\nOutdoor enthusiasts will find plenty to enjoy here. The park offers a variety of experiences, from scenic strolls on trails like the Interdune Boardwalk to more adventurous treks like the Alkali Flat Trail, which takes you deep into the heart of the dunes. Visitors of all ages can indulge in sand sledding, a favorite activity that involves sliding down the sparkling slopes on sleds available at the visitor center.\n\nAs night falls, White Sands transforms into a stargazer's paradise. With minimal light pollution and expansive skies, the dunes offer an unparalleled opportunity to witness the brilliance of the Milky Way and countless constellations. The park regularly hosts ranger-led Full Moon Hikes and other night programs highlighting the area's unique beauty after dark.\n\nPlanning your visit requires noting that White Sands is surrounded by White Sands Missile Range, an active military testing site. Periodic closures of the park may occur during missile tests, so checking for updates before your visit is essential. Despite this, the striking natural formations, endless recreational opportunities, and unique night skies make White Sands National Park a must-visit destination for outdoor enthusiasts and nature lovers.",
    "Location": "32.78,-106.17",
    "Established": "December 20, 2019[111]",
    "Area": "146,344.31 acres (592.2 km2)",
    "Annual_Visitors": 705127,
    "Latitude": 32.78,
    "Longitude": -106.17,
    "AllTrails URL": "https://www.alltrails.com/parks/us/new-mexico/white-sands-national-park",
    "Map Link": "https://www.nps.gov/media/photo/collection-item.htm?pg=7323739&cid=305fb7af-a71b-469b-941e-a98b439c882f&id=1da1a6be-0621-4ac2-a69a-73305158dca2&sid=abd1f4c8-a7ca-4c58-83ee-82a2d653576d&p=1&sort=relevance",
    "Map Type": "Park Map"
  },
  {
    "Name": "Wind Cave",
    "Description": "Tucked away in the rolling hills of South Dakota, Wind Cave National Park offers a captivating blend of subterranean wonders and above-ground beauty. Beneath the surface lies one of the longest caves in the world, famed for its intricate boxwork formations—delicate calcite structures resembling honeycombs rarely found elsewhere. The cave also features frostwork, fragile needle-like crystal growths that dazzle explorers with their intricate beauty. Adding to the cave’s mystique, it “breathes” as air flows in and out, caused by changes in atmospheric pressure.\n\nAbove ground, the park transitions into a stunning mixed-grass prairie, speckled with iconic American wildlife. Visitors can spot herds of bison grazing against a backdrop of wide-open skies, prairie dogs popping in and out of their burrows, and perhaps catch a glimpse of the elusive black-footed ferret, one of the rarest mammals in North America. Beyond the prairie, ponderosa pine forests rise, providing a home for majestic elk and stealthy mountain lions. The park’s rich ecosystem makes it a haven for wildlife enthusiasts and hikers alike.\n\nWind Cave holds deep cultural significance for the Lakota people, who consider it a sacred site of creation. Exploring this park, with its geological marvels, diverse ecosystems, and cultural history, offers a multifaceted experience for outdoor enthusiasts and those seeking a deeper connection to nature.",
    "Location": "43.57,-103.48",
    "Established": "January 9, 1903",
    "Area": "33,970.84 acres (137.5 km2)",
    "Annual_Visitors": 607418,
    "Latitude": 43.57,
    "Longitude": -103.48,
    "AllTrails URL": "https://www.alltrails.com/parks/us/south-dakota/wind-cave-national-park",
    "Map Link": "https://www.nps.gov/media/photo/collection-item.htm?pg=7323739&cid=305fb7af-a71b-469b-941e-a98b439c882f&id=b36e6786-5888-4dbc-905a-5bc895d46346&sid=9d8d162d-f15c-45fa-9c37-13a7bf5d2c4d&p=1&sort=relevance",
    "Map Type": "Park Map"
  },
  {
    "Name": "Wrangell–St. Elias",
    "Description": "Wrangell–St. Elias National Park and Preserve, the largest national park in the United States, spans a vast and remote wilderness filled with glaciers, towering mountain ranges, and endless opportunities for adventure. This remarkable destination is where the Alaska, Chugach, Wrangell, and Saint Elias mountain ranges converge, creating a rugged landscape with some of North America’s tallest peaks and volcanic formations. Among these giants is Mount Saint Elias, which soars to 18,008 feet, standing as the second-tallest peak in both the United States and Canada.\n\nGlaciers dominate over a quarter of the park’s area, forming an otherworldly expanse of ice and snow. Highlights include the massive Hubbard Glacier, a tidewater glacier extending into Disenchantment Bay; the sprawling Malaspina Glacier, a rare piedmont glacier fanning out onto coastal plains; and the Nabesna Glacier, one of the longest valley glaciers in North America. These icy features shape the park’s dramatic topography and provide striking contrasts to the lush tundra and boreal forests found at lower elevations.\n\nFor outdoor enthusiasts, Wrangell–St. Elias offers unparalleled exploration opportunities. Remote camping, backcountry hiking, and mountaineering allow visitors to experience the park’s pristine wilderness firsthand. In this environment largely untouched by modern development, adventurers can immerse themselves in a truly wild landscape. Wildlife such as bears, moose, mountain goats, and caribou roam the park, enhancing the sense of connection with nature.\n\nWhether drawn to the challenge of scaling icy peaks, the fascination of exploring glacier-carved valleys, or the serenity of camping beneath endless stars, this vast and awe-inspiring park invites you to discover a unique piece of Alaska.",
    "Location": "61.00,-142.00",
    "Established": "December 2, 1980",
    "Area": "8,323,146.48 acres (33,682.6 km2)",
    "Annual_Visitors": 65236,
    "Latitude": 61.0,
    "Longitude": -142.0,
    "AllTrails URL": "https://www.alltrails.com/parks/us/alaska/wrangell-st-elias-national-park-preserve",
    "Map Link": "https://www.nps.gov/media/photo/collection-item.htm?pg=7323739&cid=305fb7af-a71b-469b-941e-a98b439c882f&id=43237bf4-4d5b-4e69-84f4-8e9e10e7bca2&sid=b8cab70c-adbe-48ef-8723-ef0a4c2e8810&p=1&sort=relevance",
    "Map Type": "Park Map"
  },
  {
    "Name": "Yellowstone",
    "Description": "Yellowstone National Park, established in 1872 as the first national park in the world, is a treasure trove of natural wonders and a haven for outdoor enthusiasts. Spanning over 2 million acres in the heart of the United States, Yellowstone is renowned for its unique geothermal features, extraordinary landscapes, and abundant wildlife. The park lies atop the Yellowstone Caldera, one of the largest active volcanic systems on the planet. This activity creates a vast network of geothermal areas, including bubbling mud pots, steaming fumaroles, and rainbow-hued hot springs like the iconic Grand Prismatic Spring. Yellowstone boasts over 500 geysers, with the most famous being Old Faithful, which punctuates the landscape with its impressive eruptions, delighting visitors with both predictability and power.\n\nThe park’s rugged beauty is further defined by the Grand Canyon of the Yellowstone River, a dramatic, yellow-tinged chasm carved by the river over millennia. Its striking colors and thundering waterfalls, including the awe-inspiring Lower Falls, offer breathtaking viewpoints and excellent hiking opportunities. Yellowstone is also crossed by four mountain ranges, providing a backdrop of towering peaks and expansive vistas for adventurers exploring its trails or backcountry.\n\nWildlife lovers will find Yellowstone to be one of the richest ecosystems in North America. More than 60 species of mammals call the park home, including apex predators like grizzly bears, black bears, wolves, and elusive lynxes, as well as large grazers such as bison and elk. The park’s bison herd, the oldest and largest in the country, is a particularly extraordinary sight. Birdwatchers can enjoy spotting a variety of species, from majestic bald eagles to trumpeter swans.\n\nBeyond its natural spectacles, Yellowstone offers a range of outdoor activities including hiking, camping, fishing, and cross-country skiing in winter. Its extensive trail system caters to visitors of all skill levels, from short day hikes to challenging backcountry treks. Each season reveals a different facet of the park’s beauty, making Yellowstone a destination worth visiting time and time again.",
    "Location": "44.60,-110.50",
    "Established": "March 1, 1872",
    "Area": "2,219,790.71 acres (8,983.2 km2)",
    "Annual_Visitors": 3290242,
    "Latitude": 44.6,
    "Longitude": -110.5,
    "AllTrails URL": "https://www.alltrails.com/parks/us/wyoming/yellowstone-national-park",
    "Map Link": "https://www.nps.gov/media/photo/collection-item.htm?pg=7323739&cid=305fb7af-a71b-469b-941e-a98b439c882f&id=dc30085e-3713-4a8f-856b-19ac1c566066&sid=9fafd61e-8128-475f-bb36-02f1bcb63c93&p=1&sort=relevance",
    "Map Type": "Park Map"
  },
  {
    "Name": "Yosemite",
    "Description": "Nestled in California's Sierra Nevada mountains, Yosemite National Park is renowned for its breathtaking natural beauty and endless outdoor adventure opportunities. Known worldwide for its towering granite giants, cascading waterfalls, and ancient groves of giant sequoias, the park offers something remarkable at every turn. The iconic Half Dome and El Capitan loom majestically over the glacier-carved Yosemite Valley, drawing climbers and photographers alike. El Capitan, one of the world’s most challenging climbing destinations, and Half Dome, with its exhilarating hiking route, stand as testaments to the park's dramatic geology.\n\nYosemite Falls, plunging 2,425 feet (739 meters), ranks as one of the tallest waterfalls in North America and is a must-see for visitors, especially during the spring when snowmelt powers its flow. The park also boasts other magnificent waterfalls like Bridalveil Fall and Vernal Fall, accessible via picturesque trails.\n\nBeyond its iconic landmarks, Yosemite is home to three giant sequoia groves, where you can stand in the shadows of some of the oldest and tallest trees on Earth. The Mariposa Grove, the largest of these, offers trails to see wonders like the Grizzly Giant and the Tunnel Tree. These ancient giants provide a window into the forest's rich ecological history.\n\nThe park's diverse ecosystems range from lush meadows and rugged high-country terrain to pristine wilderness that supports a wide variety of plant and animal species. Many, such as the Sierra Nevada bighorn sheep or the Yosemite toad, are rare and found only in this region. For those eager to explore, Yosemite offers over 750 miles of hiking trails, from serene walks through meadows to multi-day backcountry treks leading to remote alpine lakes and peaks.\n\nYosemite's appeal extends year-round, with each season bringing its own unique experience. Spring features roaring waterfalls and blooming wildflowers, summer is perfect for rock climbing, camping, and stargazing, fall offers quieter crowds and vibrant autumn colors, and winter transforms the park into a snowy oasis, opening opportunities for snowshoeing, cross-country skiing, and even ice skating at the Curry Village rink.\n\nWhether you're an avid climber, a devoted hiker, or simply someone seeking to connect with nature, Yosemite National Park's awe-inspiring landscapes and diverse ecosystems provide an unforgettable experience, blending adventure with tranquility in one of America’s most treasured outdoor destinations.",
    "Location": "37.83,-119.50",
    "Established": "October 1, 1890",
    "Area": "761,747.50 acres (3,082.7 km2)",
    "Annual_Visitors": 3667550,
    "Latitude": 37.83,
    "Longitude": -119.5,
    "AllTrails URL": "https://www.alltrails.com/parks/us/california/yosemite-national-park",
    "Map Link": "https://www.nps.gov/media/photo/collection-item.htm?pg=7323739&cid=305fb7af-a71b-469b-941e-a98b439c882f&id=c51f64fd-51dc-400e-b562-d02789c95933&sid=72ac2be9-bc64-4248-b383-7fa251c57e5f&p=1&sort=relevance",
    "Map Type": "Park Map"
  },
  {
    "Name": "Zion",
    "Description": "Zion National Park showcases a captivating blend of natural wonders, making it a favorite among outdoor enthusiasts. Known for its dramatic steep canyon walls, the park is home to a network of trails catering to all levels of hikers. Whether you're looking for a relaxed stroll or a challenging adventure, Zion delivers with its wide array of options. Among its most iconic experiences is hiking The Narrows, a stunning journey through the Virgin River's slot canyon, where hikers wade through water beneath towering sandstone walls.\n\nSituated at the meeting point of the Colorado Plateau, Great Basin, and Mojave Desert, Zion's unique geography has created a landscape that is both diverse and awe-inspiring. Sandstone formations dominate the scenery, with dramatic mesas, intricate rock towers, and deep canyons shaped over millions of years. The Virgin River serves as the lifeblood of the park, shaping its terrain and sustaining its ecosystems.\n\nZion’s wilderness is divided into four distinct ecosystems: desert, riparian, woodland, and coniferous forest. This variety supports a wide range of plant and animal species, making it a fascinating destination for wildlife watchers and nature lovers. Visitors might catch glimpses of desert bighorn sheep along the cliffs, peregrine falcons soaring through the skies, or rare plant species tucked away in shaded alcoves.\n\nFor those who enjoy camping and extended exploration, Zion offers numerous campgrounds that provide access to its breathtaking landscapes. Stargazers will find the park an enchanting spot, as its remote location offers clear, dark skies perfect for observing constellations and the Milky Way. Whether drawn to its geological wonders, hiking opportunities, or ecosystems teeming with life, Zion National Park promises a memorable outdoor experience with something to inspire every adventurer.",
    "Location": "37.30,-113.05",
    "Established": "November 19, 1919",
    "Area": "147,242.66 acres (595.9 km2)",
    "Annual_Visitors": 4692417,
    "Latitude": 37.3,
    "Longitude": -113.05,
    "AllTrails URL": "https://www.alltrails.com/parks/us/utah/zion-national-park",
    "Map Link": "https://www.nps.gov/media/photo/collection-item.htm?pg=7323739&cid=305fb7af-a71b-469b-941e-a98b439c882f&id=7b9188c0-d895-4d8c-acd2-e7df9a911c15&sid=a132afac-aaf3-41a0-9904-f2daf5189264&p=1&sort=relevance",
    "Map Type": "Park Map"
  }
]