[
  {
    "Name": "Acadia",
    "Description": "Nestled along the rugged coastline of Maine, Acadia National Park is a paradise for outdoor enthusiasts, offering a stunning mix of granite peaks, pristine lakes, dense woodlands, and dramatic oceanfront views. Spanning much of Mount Desert Island and several smaller coastal islands, the park is home to a diverse range of ecosystems, including freshwater, estuary, forest, and intertidal habitats. Its iconic Cadillac Mountain holds the distinction of being the tallest mountain on the Atlantic coast of the United States, and it’s one of the first places in the country to catch the sunrise during certain times of the year.\n\nAcadia's network of over 150 miles of trails provides opportunities for hikers of all skill levels, from gentle shoreline strolls to challenging summit ascents. The park also features historic carriage roads, perfect for biking or leisurely walks, surrounded by stone bridges and sweeping views of nature. For water lovers, kayaking along the coastline or enjoying a peaceful moment at Jordan Pond offers unforgettable experiences. Wildlife enthusiasts may spot peregrine falcons, white-tailed deer, or seals basking along the rocky shorelines.\n\nBeyond its natural beauty, the park invites visitors to immerse themselves in its rich cultural history, from the legacies of the Wabanaki people to the conservation efforts of early 20th-century visionaries. Whether you're seeking adventure, serenity, or a connection to the wild landscapes of coastal New England, Acadia National Park offers something truly special for every visitor.",
    "Location": "44.35,-68.21",
    "Established": "February 26, 1919",
    "Area": "49,071.40 acres (198.6 km2)",
    "Annual_Visitors": 3970260,
    "Latitude": 44.35,
    "Longitude": -68.21,
    "AllTrails URL": "https://www.alltrails.com/parks/us/maine/acadia-national-park",
    "Map Link": "https://www.nps.gov/media/photo/collection-item.htm?pg=7323739&cid=305fb7af-a71b-469b-941e-a98b439c882f&id=1cd3d4aa-098b-47d3-94fd-85ff6f09dd95&sid=970f5fb5-9f0e-41fc-be95-7f8cd56c2a98&p=1&sort=relevance | https://www.nps.gov/media/photo/collection-item.htm?pg=7323739&cid=305fb7af-a71b-469b-941e-a98b439c882f&id=c1d90731-8b77-4740-9ed2-98f94298b986&sid=970f5fb5-9f0e-41fc-be95-7f8cd56c2a98&p=1&sort=relevance | https://www.nps.gov/media/photo/collection-item.htm?pg=7323739&cid=305fb7af-a71b-469b-941e-a98b439c882f&id=d525b116-93e8-4dd9-b489-2f273b3bc39d&sid=970f5fb5-9f0e-41fc-be95-7f8cd56c2a98&p=1&sort=relevance | https://www.nps.gov/media/photo/collection-item.htm?pg=7323739&cid=305fb7af-a71b-469b-941e-a98b439c882f&id=132ea4e6-d44e-4b39-8b10-b0736881a693&sid=970f5fb5-9f0e-41fc-be95-7f8cd56c2a98&p=1&sort=relevance",
    "Map Type": "Multiple Park Maps"
  },
  {
    "Name": "American Samoa",
    "Description": "Nestled in the heart of the South Pacific, the National Park of American Samoa offers a unique blend of untamed tropical wilderness, vibrant Samoan culture, and diverse ecosystems. Spanning three islands—Tutuila, Ofu, and Ta‘ū—this remote park showcases lush rainforests, striking volcanic peaks, crystal-clear waters, and immaculate white sand beaches. Its vibrant coral reefs are a snorkeler’s paradise, teeming with life and home to over 900 species of fish and various marine creatures, including sea turtles.\n\nFor wildlife enthusiasts, the park is a haven. Keep an eye out for the majestic flying foxes, large fruit bats that play a critical role in pollinating the rainforest. Birdwatchers can delight in sightings of brown boobies, white terns, and other sea and forest birds that thrive in this untouched ecosystem. The park’s diverse terrain also offers plenty of opportunities for hikers, with trails leading through dense rainforests to rewarding viewpoints of the surrounding coastline and ocean vistas.\n\nBeyond its natural beauty, the park is deeply intertwined with the cultural heritage of the Samoan people, who have lived in harmony with these lands and waters for thousands of years. Visitors can experience the traditional fa’a Samoa way of life, which emphasizes respect for family, community, and the natural environment. Whether exploring ancient volcanic landscapes, relaxing on serene beaches, or learning about local culture, this southernmost U.S. national park provides an unforgettable adventure for nature lovers and outdoor enthusiasts alike.",
    "Location": "-14.25,-170.68",
    "Established": "October 31, 1988",
    "Area": "8,256.67 acres (33.4 km2)",
    "Annual_Visitors": 12135,
    "Latitude": -14.25,
    "Longitude": -170.68,
    "AllTrails URL": "https://www.alltrails.com/parks/american-samoa/national-park-of-american-samoa",
    "Map Link": "https://www.nps.gov/media/photo/collection-item.htm?pg=7323739&cid=305fb7af-a71b-469b-941e-a98b439c882f&id=58b16aee-da36-4476-8a1e-5dedb87267fb&sid=fffb07a3-2679-422b-8101-002808988853&p=1&sort=relevance | https://www.nps.gov/media/photo/collection-item.htm?pg=7323739&cid=305fb7af-a71b-469b-941e-a98b439c882f&id=0e3794e8-0012-4706-9453-c570db38f886&sid=fffb07a3-2679-422b-8101-002808988853&p=1&sort=relevance | https://www.nps.gov/media/photo/collection-item.htm?pg=7323739&cid=305fb7af-a71b-469b-941e-a98b439c882f&id=14357be2-4ffc-4d0f-a38f-27bfda28b35f&sid=fffb07a3-2679-422b-8101-002808988853&p=1&sort=relevance",
    "Map Type": "Multiple Park Maps"
  },
  {
    "Name": "Arches",
    "Description": "Nestled in Utah's high desert, Arches National Park is home to a breathtaking collection of over 2,000 natural sandstone arches, making it one of the most unique and inspiring landscapes in the world. This iconic park boasts famous features like Delicate Arch, a freestanding marvel often called the park's crown jewel, the impossibly thin Landscape Arch, and the striking double-curve of Double Arch. Beyond its arches, the park also showcases awe-inspiring geologic formations like towering stone pinnacles, slender rock fins, and gravity-defying balancing rocks, offering plenty to marvel at during your visit.\n\nThe beauty of Arches is the result of millions of years of erosion and a desert climate that has sculpted the landscape into this natural wonder. Visitors will notice the biological soil crusts that play a critical role in sustaining life in this harsh environment. These living soil layers help prevent erosion, retain water, and support plant growth. Scattered throughout the park are also \"potholes,\" natural depressions in the rock that collect water, creating miniature ecosystems that support desert life.\n\nOutdoor enthusiasts will find plenty to explore, from tranquil viewpoints along paved roads to challenging trails like the Devil's Garden, which takes hikers deep into the park's backcountry to see rugged arches and dramatic rock formations. Sunrise and sunset offer especially stunning views as the park's red rocks glow with warm, shifting hues. Whether you're seeking a leisurely exploration or an adventurous trek, Arches provides an unforgettable journey into the heart of the desert's raw, sculptural beauty.",
    "Location": "38.68,-109.57",
    "Established": "November 12, 1971",
    "Area": "76,678.98 acres (310.3 km2)",
    "Annual_Visitors": 1460652,
    "Latitude": 38.68,
    "Longitude": -109.57,
    "AllTrails URL": "https://www.alltrails.com/parks/us/utah/arches-national-park",
    "Map Link": "https://www.nps.gov/media/photo/collection-item.htm?pg=7323739&cid=305fb7af-a71b-469b-941e-a98b439c882f&id=6aefc09f-6995-41df-abf6-54896840430d&sid=fd1c8d80-3025-47cc-927a-fdc5d3d55acf&p=1&sort=relevance",
    "Map Type": "Park Map"
  },
  {
    "Name": "Badlands",
    "Description": "The Badlands, located in southwestern South Dakota within the White River drainage basin, offer a strikingly rugged landscape shaped over millions of years. This unique collection of buttes, pinnacles, spires, and expansive mixed-grass prairies creates a dramatic setting for outdoor exploration. Known for its scenic vistas and diverse ecosystems, the park is particularly celebrated for housing the largest known collection of late Eocene and Oligocene mammal fossils, making it a haven for paleontology enthusiasts.\n\nFor nature and wildlife lovers, the Badlands are home to an array of remarkable species. Visitors may encounter herds of bison grazing across the open grasslands, catch sight of nimble bighorn sheep navigating rocky terrains, or spot elusive black-footed ferrets—the rarest mammal in North America. Prairie dogs, with their intricate underground colonies, add an additional layer of ecological interest to the area.\n\nIdeal for campers and backcountry hikers, the park provides numerous opportunities for adventure and solitude. Trails and open spaces invite exploration, whether it’s trekking across stark badland formations or immersing oneself in the tranquility of prairie landscapes. With its combination of dramatic geology, rich fossil history, and thriving wildlife, the Badlands promise an unforgettable experience for those eager to connect with the natural world.",
    "Location": "43.75,-102.50",
    "Established": "November 10, 1978",
    "Area": "242,755.94 acres (982.4 km2)",
    "Annual_Visitors": 1006809,
    "Latitude": 43.75,
    "Longitude": -102.5,
    "AllTrails URL": "https://www.alltrails.com/parks/us/south-dakota/badlands-national-park",
    "Map Link": "https://www.nps.gov/media/photo/collection-item.htm?pg=7323739&cid=305fb7af-a71b-469b-941e-a98b439c882f&id=0dcec1e8-2033-4c6c-902e-0598aa07e7e7&sid=f3267ad0-b21f-4bd9-ba15-f5f99fda2612&p=1&sort=relevance",
    "Map Type": "Park Map"
  },
  {
    "Name": "Big Bend",
    "Description": "Big Bend National Park is a haven for outdoor enthusiasts, offering a rich blend of striking landscapes, diverse ecosystems, and endless opportunities for exploration. Situated in a remote region of West Texas, the park is named after the sweeping curve of the Rio Grande that outlines its southern border, forming a natural divide between the United States and Mexico. Spanning over 800,000 acres, it is a vast and secluded expanse of Chihuahuan Desert, dramatic canyons, and the rugged Chisos Mountains.\n\nThe park is renowned for its backcountry experiences, with an array of hiking and camping options that range from beginner-friendly routes to challenging wilderness adventures. Trails lead explorers through arid desert flats, lush mountain canyons, and along the winding course of the Rio Grande, offering breathtaking views and a chance to encounter unique plant and animal species. Big Bend’s isolation makes it one of the least light-polluted areas in the continental U.S., providing some of the clearest stargazing opportunities you’ll find anywhere.\n\nGeologically, the park is a treasure trove, home to an impressive collection of Cretaceous and Tertiary fossils, including dinosaur bones and prehistoric marine life. Archaeological sites within the park reveal evidence of human habitation that dates back thousands of years, showcasing the cultural artifacts of Native American peoples who once thrived here.\n\nWhether you’re drawn to the challenge of summiting Emory Peak, paddling through the dramatic limestone walls of Santa Elena Canyon, or simply soaking in the solitude and vastness of the desert, Big Bend offers a mix of adventure, history, and natural beauty that is hard to match. Explore its varied landscapes and you’ll discover why this remote destination is a favorite among those seeking a deeper connection with the wilderness.",
    "Location": "29.25,-103.25",
    "Established": "June 12, 1944",
    "Area": "801,163.21 acres (3,242.2 km2)",
    "Annual_Visitors": 514107,
    "Latitude": 29.25,
    "Longitude": -103.25,
    "AllTrails URL": "https://www.alltrails.com/parks/us/texas/big-bend-national-park",
    "Map Link": "https://www.nps.gov/media/photo/collection-item.htm?pg=7323739&cid=305fb7af-a71b-469b-941e-a98b439c882f&id=a1647b7e-fdee-4350-891a-afbd28331d1c&sid=37f6c99b-3df4-43b8-bd7f-b72cc502a603&p=1&sort=relevance",
    "Map Type": "Park Map"
  },
  {
    "Name": "Biscayne",
    "Description": "Biscayne National Park offers a unique experience for outdoor enthusiasts, with the majority of its wonders lying beneath the surface of the water. Located at the northern end of the Florida Keys, this park is a haven for adventurers eager to explore diverse marine ecosystems through activities like snorkeling, boating, and kayaking. The park is home to four interconnected habitats: vibrant coral reefs teeming with marine life, lush mangrove forests that act as critical nurseries for fish and other wildlife, the sparkling expanse of Biscayne Bay, and the islands of the Florida Keys, each with its own ecological significance.\n\nThe park provides a habitat for a remarkable array of wildlife, including species that are federally threatened or endangered. Visitors might catch a glimpse of the gentle West Indian manatee, the elusive American crocodile, or one of the many sea turtles that frequent the waters, such as the green sea turtle or loggerhead. Even birdwatchers have something to look forward to, as the park is a seasonal home for the peregrine falcon, the world’s fastest bird.\n\nBeyond its natural beauty, Biscayne also boasts a fascinating blend of history and culture. The islands and waters carry remnants of human activity spanning thousands of years, from ancient indigenous settlements to shipwrecks that tell tales of maritime adventures and mishaps. With over 95% of the park submerged, it offers an unparalleled opportunity to explore a vibrant underwater world where colorful coral formations, tropical fish, and other marine life flourish.\n\nWhether you’re gliding through the calm waters by boat, snorkeling among the reefs, or hiking along the mangroves, Biscayne National Park is an incredible destination for discovery, relaxation, and adventure. It’s a reminder of the intricate connections between land, sea, and life, making it a must-visit for anyone passionate about nature and the outdoors.",
    "Location": "25.65,-80.08",
    "Established": "June 28, 1980",
    "Area": "172,971.11 acres (700.0 km2)",
    "Annual_Visitors": 701023,
    "Latitude": 25.65,
    "Longitude": -80.08,
    "AllTrails URL": "https://www.alltrails.com/parks/us/florida/biscayne-national-park",
    "Map Link": "https://www.nps.gov/media/photo/collection-item.htm?pg=7323739&cid=305fb7af-a71b-469b-941e-a98b439c882f&id=17a58f6c-3201-460b-8dd7-e69be6860896&sid=a9b0eb59-21d5-4ddb-88fa-98de97c3bb1b&p=1&sort=relevance",
    "Map Type": "Park Map"
  },
  {
    "Name": "Black Canyon of the Gunnison",
    "Description": "Carved by millions of years of geological forces, Black Canyon of the Gunnison National Park showcases one of the most striking landscapes in North America. The park is home to incredibly steep, narrow canyons with towering cliffs that plunge dramatically into the Gunnison River below. These sheer walls of Precambrian-era gneiss and schist, some of the oldest exposed rock on the continent, appear almost black when cloaked in shadow, giving the canyon its name.\n\nThis rugged terrain offers a distinct sense of solitude and adventure, drawing outdoor enthusiasts with its challenging rock climbing routes and remote hiking trails. The Gunnison River, which cuts through a quarter of the park, provides prime opportunities for experienced kayakers and rafters seeking whitewater thrills through steep rapids surrounded by canyon walls that measure up to 2,700 feet from rim to riverbed in places.\n\nWildlife lovers will find a diverse ecosystem thriving among the park's contrasts of light and darkness, including peregrine falcons, mule deer, and golden eagles. Spectacular views await at scenic overlooks along the South Rim Road, while the less-visited North Rim provides a quieter, more serene experience. Whether you’re an adventurer ready to explore the canyon’s depths or a traveler in search of breathtaking vistas, Black Canyon offers a rare glimpse into the raw and untamed power of nature.",
    "Location": "38.57,-107.72",
    "Established": "October 21, 1999",
    "Area": "30,779.83 acres (124.6 km2)",
    "Annual_Visitors": 297257,
    "Latitude": 38.57,
    "Longitude": -107.72,
    "AllTrails URL": "https://www.alltrails.com/parks/us/colorado/black-canyon-of-the-gunnison-national-park",
    "Map Link": "https://www.nps.gov/media/photo/collection-item.htm?pg=7323739&cid=305fb7af-a71b-469b-941e-a98b439c882f&id=4c4ee03f-0ebb-4650-8001-6cd07a6bf6f4&sid=2ec6427a-5ea7-43b5-9b01-63eff5d6d43e&p=1&sort=relevance",
    "Map Type": "Park Map"
  },
  {
    "Name": "Bryce Canyon",
    "Description": "Nestled on southern Utah's Paunsaugunt Plateau, Bryce Canyon stands out as a geological wonder renowned for its striking hoodoo rock formations. These eroded sandstone spires, ranging in height and vibrant hues, fill the park’s natural amphitheaters, creating a surreal and captivating landscape. Visitors can take in breathtaking views from a variety of scenic overlooks, each offering a unique perspective on the intricate labyrinth of hoodoos. \n\nFor those eager to explore on foot, Bryce Canyon features a network of hiking trails that cater to all skill levels, from easy strolls along the rim to more challenging routes like the Navajo Loop Trail, which descends into the heart of the formations. Sunrise and Sunset Points are particularly popular for their dramatic lighting, ideal for photography enthusiasts or anyone eager to witness nature’s artistry at its best.\n\nThe park’s history is as rich as its landscape. Originally home to Native American tribes, including the Paiute people, the area later became a settlement for Mormon pioneers in the 19th century. This cultural legacy adds depth to the park’s story, making a visit to Bryce Canyon not just a visual experience, but a journey through time.\n\nOutdoor enthusiasts will also appreciate the park's opportunities for stargazing, thanks to its designation as an International Dark Sky Park. With minimal light pollution and clear desert skies, Bryce Canyon offers some of the best views of the Milky Way and constellations in the country. Whether you come for the geology, history, or the chance to gaze up at an endless night sky, Bryce Canyon leaves an impression as vast and inspiring as its iconic formations.",
    "Location": "37.57,-112.18",
    "Established": "February 25, 1928",
    "Area": "35,835.08 acres (145.0 km2)",
    "Annual_Visitors": 2354660,
    "Latitude": 37.57,
    "Longitude": -112.18,
    "AllTrails URL": "https://www.alltrails.com/parks/us/utah/bryce-canyon-national-park",
    "Map Link": "https://www.nps.gov/media/photo/collection-item.htm?pg=7323739&cid=305fb7af-a71b-469b-941e-a98b439c882f&id=7f36e7a7-d1ef-4cea-95e4-3cff345c0574&sid=1a381e42-6a9b-4b65-a6bd-12c391ea2646&p=1&sort=relevance",
    "Map Type": "Park Map"
  },
  {
    "Name": "Canyonlands",
    "Description": "Canyonlands National Park offers a breathtaking expanse of red rock canyons, towering pinnacles, and dramatic desert landscapes that are a haven for outdoor enthusiasts. Shaped over millions of years by the relentless forces of the Colorado River, the Green River, and their tributaries, this park is a masterpiece of geological artistry. Its maze-like canyons, colossal buttes, and flat-topped mesas create a terrain that beckons exploration and rewards adventure seekers. \n\nThe park is divided into three distinct districts, each with its own personality: Island in the Sky features sweeping vistas from sheer cliff edges, The Needles is known for colorful spires and challenging trails, and The Maze offers a remote backcountry experience for seasoned adventurers. Thousands of rock pinnacles, natural arches, and dramatic overlooks are scattered across the landscape, making it a photographer’s dream and a playground for hikers and mountain bikers alike. \n\nHistory enthusiasts will appreciate the park’s rich cultural heritage, as it holds evidence of Ancient Pueblo peoples, including petroglyphs, dwellings, and artifacts that tell the story of those who once thrived in this rugged environment. Whether you're scaling an exposed trail, cycling over slickrock, or marveling at the expansive night sky, Canyonlands inspires awe and offers countless opportunities to connect with nature in its most raw and untamed form.",
    "Location": "38.2,-109.93",
    "Established": "September 12, 1964",
    "Area": "337,597.83 acres (1,366.2 km2)",
    "Annual_Visitors": 779147,
    "Latitude": 38.2,
    "Longitude": -109.93,
    "AllTrails URL": "https://www.alltrails.com/parks/us/utah/canyonlands-national-park",
    "Map Link": "https://www.nps.gov/media/photo/collection-item.htm?pg=7323739&cid=305fb7af-a71b-469b-941e-a98b439c882f&id=49148eb2-baad-4ae1-b862-49f696e41fb2&sid=75eb2aa9-37f8-49b0-a9bc-8f75d8e933c1&p=1&sort=relevance",
    "Map Type": "Park Map"
  },
  {
    "Name": "Capitol Reef",
    "Description": "Nestled in south-central Utah, Capitol Reef National Park is a treasure trove of geological and cultural wonders, offering a serene escape for outdoor enthusiasts. Known for its striking white sandstone domes, sheer cliffs, and ancient petroglyphs etched by Indigenous peoples, the park is a remarkable blend of natural beauty and human history. At its heart lies the Waterpocket Fold, a stunning 100-mile (160-kilometer) long monocline, where layers of the Earth's crust are dramatically folded, revealing millions of years of geologic history. Adventurers will find a mesmerizing landscape of rugged monoliths, weathered buttes, and otherworldly sandstone formations, including a dome that bears a striking resemblance to the United States Capitol.\n\nCapitol Reef is a haven for remote camping, where you can revel in the park’s solitude under dark, star-drenched skies. Hikers can explore a variety of trails ranging from short, family-friendly walks to challenging backcountry treks that lead to sweeping vistas, hidden canyons, and desert oases. Beyond its natural splendor, the park also preserves remnants of early Mormon pioneer settlements, including historic orchards where visitors can still pick seasonal fruit.\n\nWhether you're intrigued by geology, history, or simply the allure of remote wilderness, Capitol Reef offers a chance to connect with nature in a peaceful, uncrowded setting. It's an ideal destination for anyone seeking to explore Utah’s dramatic desert landscapes while uncovering the stories etched into its rocks and canyons.",
    "Location": "38.20,-111.17",
    "Established": "December 18, 1971",
    "Area": "241,904.50 acres (979.0 km2)",
    "Annual_Visitors": 1227608,
    "Latitude": 38.2,
    "Longitude": -111.17,
    "AllTrails URL": "https://www.alltrails.com/parks/us/utah/capitol-reef-national-park",
    "Map Link": "https://www.nps.gov/media/photo/collection-item.htm?pg=7323739&cid=305fb7af-a71b-469b-941e-a98b439c882f&id=21ef0a46-5097-4859-9acb-ec9d2c308358&sid=3a0c4914-2256-4498-902a-f4b01a2bc5ae&p=1&sort=relevance",
    "Map Type": "Park Map"
  },
  {
    "Name": "Carlsbad Caverns",
    "Description": "Carlsbad Caverns National Park is a remarkable destination featuring a network of over 119 caves, formed through the fascinating process of sulfuric acid dissolution. Among these, the longest cave stretches over 120 miles (190 kilometers), providing a glimpse into the vastness of this subterranean world. A standout attraction within the park is the Big Room, a massive chamber nearly 4,000 feet (1,200 meters) in length, making it one of the largest and most awe-inspiring cave rooms in North America. \n\nBeyond its impressive geological features, Carlsbad Caverns is home to abundant wildlife. The caves themselves serve as a roost for over 400,000 Mexican free-tailed bats, along with sixteen other bat species, creating a vibrant ecosystem beneath the surface. Visitors often gather during the summer months to witness the mesmerizing bat flight program, where thousands of bats emerge at dusk in an unforgettable natural spectacle.\n\nAbove ground, the park transitions into the rugged beauty of the Chihuahuan Desert, offering trails for hiking and opportunities to explore the unique desert flora and fauna. Nearby, Rattlesnake Springs provides a lush oasis and a popular spot for birdwatching, with over 300 bird species documented in the area.\n\nFor those looking to dive deeper into the caves, the park offers a variety of guided tours, ranging from beginner-friendly walks to more challenging spelunking adventures for experienced cavers. Additionally, camping facilities are available within the vicinity, allowing outdoor enthusiasts to fully immerse themselves in the serene natural surroundings. Carlsbad Caverns National Park is not only a wonder of the underground world but also a gateway to appreciating the diverse landscapes and wildlife of this extraordinary region.",
    "Location": "32.17,-104.44",
    "Established": "May 14, 1930",
    "Area": "46,766.45 acres (189.3 km2)",
    "Annual_Visitors": 390932,
    "Latitude": 32.17,
    "Longitude": -104.44,
    "AllTrails URL": "https://www.alltrails.com/parks/us/new-mexico/carlsbad-caverns-national-park",
    "Map Link": "https://www.nps.gov/media/photo/collection-item.htm?pg=7323739&cid=305fb7af-a71b-469b-941e-a98b439c882f&id=e6e19d73-fae6-4968-8c44-331dd9378ab2&sid=b207c9e4-139e-49e0-a271-b97692575485&p=1&sort=relevance",
    "Map Type": "Park Map"
  },
  {
    "Name": "Channel Islands",
    "Description": "Nestled off the coast of Southern California, Channel Islands National Park offers a truly distinctive outdoor experience. Encompassing five of the eight Channel Islands, this protected area is a haven for nature lovers, rich in both natural beauty and cultural history. Nearly half of the park lies beneath the ocean’s surface, making it an extraordinary destination for those who enjoy kayaking, snorkeling, and diving. The underwater environment is teeming with marine life and features stunning kelp forests and unique sea caves waiting to be explored.\n\nOn land, the park boasts a rare Mediterranean ecosystem, shaped over millennia and first inhabited by the Chumash people. Outdoor enthusiasts can discover this rich history through ranger-led and self-guided tours, as well as by exploring ancient archaeological sites on the islands. Home to over 2,000 species of plants and animals, the islands are known for their biodiversity. Remarkably, 145 of these species, including the tiny yet resilient island fox, are found nowhere else on Earth. This makes the park a naturalist’s paradise, offering countless opportunities to witness unique flora and fauna.\n\nWith no shops, paved roads, or permanent lodging, Channel Islands National Park fosters a sense of isolation and tranquility. For those seeking adventure, the islands offer some of the most remote and pristine hiking trails in California, alongside opportunities for backcountry camping under star-filled skies. Accessible only by ferry or private boat, the islands are a world apart from the bustling mainland. Ferry services operate regularly, providing transportation from Ventura and Oxnard harbors.\n\nWhether you're drawn to its rugged cliffs, distinctive wildlife, or the lure of the sea, Channel Islands National Park invites exploration and rewards visitors with unforgettable experiences both above and below the water.",
    "Location": "34.01,-119.42",
    "Established": "March 5, 1980",
    "Area": "249,561.00 acres (1,009.9 km2)",
    "Annual_Visitors": 323245,
    "Latitude": 34.01,
    "Longitude": -119.42,
    "AllTrails URL": "https://www.alltrails.com/parks/us/california/channel-islands-national-park",
    "Map Link": "https://www.nps.gov/media/photo/collection-item.htm?pg=7323739&cid=305fb7af-a71b-469b-941e-a98b439c882f&id=08a73c40-c1ef-4ce9-9a36-03688678bd92&sid=3145e9b1-1702-4d2f-85b0-64ed3fc8de9b&p=1&sort=relevance",
    "Map Type": "Park Map"
  },
  {
    "Name": "Congaree",
    "Description": "Nestled along the Congaree River, this national park preserves the largest remaining expanse of old-growth bottomland hardwood forest in the United States, offering a rare and immersive glimpse into a unique ecosystem. The park is a haven for outdoor enthusiasts, with opportunities for kayaking, canoeing, and hiking that allow visitors to explore its diverse landscapes at their own pace. Towering trees—some of which rank among the tallest in the eastern United States—create a dramatic canopy that shades the rich floodplain below, while seasonal flooding nourishes the area’s abundant plant and wildlife.\n\nA highlight for many visitors is the Boardwalk Loop, an elevated pathway that winds through the heart of the swamp, providing a closer look at the park’s unique flora and fauna without disturbing its delicate ecosystem. As you journey along this 2.4-mile loop, keep an eye out for wildlife such as river otters, deer, wild turkeys, and a wide variety of birds, making Congaree a prime destination for wildlife observation and birdwatching.\n\nThe park’s waterways, including Cedar Creek, invite paddlers to experience the serene beauty of the floodplain from a different perspective, gliding beneath towering bald cypress and water tupelo trees draped in Spanish moss. Whether you’re navigating the waterways, hiking the trails, or simply soaking in the tranquility of the forest, Congaree offers countless opportunities to connect with nature and appreciate the ecological significance of this preserved landscape. It’s a destination that combines adventure with a sense of quiet wonder, inviting visitors to step into a world that has remained untouched by time.",
    "Location": "33.78,-80.78",
    "Established": "November 10, 2003",
    "Area": "26,692.60 acres (108.0 km2)",
    "Annual_Visitors": 204522,
    "Latitude": 33.78,
    "Longitude": -80.78,
    "AllTrails URL": "https://www.alltrails.com/parks/us/south-carolina/congaree-national-park",
    "Map Link": "https://www.nps.gov/media/photo/collection-item.htm?pg=7323739&cid=305fb7af-a71b-469b-941e-a98b439c882f&id=30f2efb0-2dbd-4a61-bdfd-e18cb41cda1d&sid=ed1900da-95c3-41fb-a78f-2a6aa0a826fb&p=1&sort=relevance",
    "Map Type": "Park Map"
  },
  {
    "Name": "Crater Lake",
    "Description": "Crater Lake is a mesmerizing destination renowned for its strikingly deep, clear blue waters set within the remnants of an ancient volcano. Formed over 7,700 years ago when Mount Mazama erupted and collapsed, the caldera now cradles the deepest lake in the United States, plunging to depths of 1,943 feet. Its vivid blue hue and exceptional water clarity have captivated visitors for generations, making it a natural wonder rooted in geologic history.  \n\nThe lake’s unique setting is enriched by intriguing volcanic formations, including Wizard Island, a cinder cone rising from the western side of the lake, and the Phantom Ship, a rugged rock outcrop resembling a small, ghostly schooner. As there are no rivers or streams flowing in or out of Crater Lake, its waters are replenished solely by precipitation, setting the stage for pristine and pure conditions.\n\nOutdoor enthusiasts will find an abundance of opportunities to explore this serene landscape. Challenging hiking trails meander through forests, along the caldera rim, and down to the water's edge. The iconic Rim Trail offers breathtaking panoramic views, while the Cleetwood Cove Trail provides the only access to the lake itself, where seasonal boat tours allow close-up exploration of Wizard Island and other geologic features. For a more immersive experience, the park also offers overnight camping in quiet, scenic surroundings, perfect for stargazing under unpolluted skies.\n\nWhether you're drawn to the park for its fascinating geology, crystal-clear waters, or opportunities for adventure, Crater Lake is a destination that combines natural beauty and tranquility with a sense of wonder and discovery.",
    "Location": "42.94,-122.1",
    "Established": "May 22, 1902",
    "Area": "183,224.05 acres (741.5 km2)",
    "Annual_Visitors": 527259,
    "Latitude": 42.94,
    "Longitude": -122.1,
    "AllTrails URL": "https://www.alltrails.com/parks/us/oregon/crater-lake-national-park",
    "Map Link": "https://www.nps.gov/media/photo/collection-item.htm?pg=7323739&cid=305fb7af-a71b-469b-941e-a98b439c882f&id=207bace8-c27a-4a9c-b1c2-9239778b6d2d&sid=c818cc1a-fae5-4749-8c2f-413f6e832f45&p=1&sort=relevance",
    "Map Type": "Park Map"
  },
  {
    "Name": "Cuyahoga Valley",
    "Description": "Nestled in the heart of Ohio, Cuyahoga Valley National Park offers a blend of natural beauty, outdoor recreation, and rich history, making it a unique destination for nature lovers and history buffs alike. The park’s forested trails wind through rolling hills, leading to serene waterfalls like the picturesque Brandywine Falls, one of the park's iconic landmarks. Alongside its natural features, the park provides a glimpse into the region's 19th-century heritage, with exhibits highlighting early rural life and preserved historic homes and structures scattered throughout the landscape.\n\nCyclists and hikers are drawn to the Ohio and Erie Canal Towpath Trail, a flat, accessible route that follows the historic canal where mules once pulled canal boats through the waterway’s locks. This trail offers a peaceful way to experience the park’s diverse scenery and is popular for both leisurely strolls and more vigorous adventures. The park also boasts opportunities for birdwatching, with habitats that attract a variety of species year-round, making it a favorite destination for wildlife enthusiasts.\n\nFor a different perspective, visitors can climb aboard the Cuyahoga Valley Scenic Railroad, which runs through the park and offers a relaxing ride with stunning views of the surrounding landscape. This unique experience allows guests to immerse themselves in the beauty of the area while learning about its cultural and natural history.\n\nWhether you're interested in exploring the park's quiet forests, delving into its historical offerings, or simply enjoying the sounds of cascading waterfalls and chirping birds, Cuyahoga Valley National Park provides something for everyone. Its mix of outdoor activities, educational exhibits, and opportunities for discovery ensures an enriching visit for all who make their way to this picturesque slice of Ohio.",
    "Location": "41.24,-81.55",
    "Established": "October 11, 2000",
    "Area": "32,571.89 acres (131.8 km2)",
    "Annual_Visitors": 2913312,
    "Latitude": 41.24,
    "Longitude": -81.55,
    "AllTrails URL": "https://www.alltrails.com/parks/us/ohio/cuyahoga-valley-national-park",
    "Map Link": "https://www.nps.gov/media/photo/collection-item.htm?pg=7323739&cid=305fb7af-a71b-469b-941e-a98b439c882f&id=b33bd45b-7e9a-4e4c-91f4-59594f0be686&sid=e7c2eb87-835e-4254-9eac-52ebca02aca8&p=1&sort=relevance",
    "Map Type": "Park Map"
  },
  {
    "Name": "Death Valley",
    "Description": "Death Valley is a stark and captivating landscape, known as the hottest, driest, and lowest place in the United States. Located within the Mojave Desert, this iconic national park offers an otherworldly experience for outdoor enthusiasts. It is home to Badwater Basin, the lowest point in North America at 282 feet (86 meters) below sea level. Here, the vast salt flats stretch endlessly, creating a strikingly unique and desolate panorama. During summer, daytime temperatures often soar beyond 130°F (54°C), making it one of the hottest places on Earth.\n\nDespite its extreme environment, Death Valley is teeming with natural diversity. The park encompasses a wide variety of landscapes, from rugged canyons and colorful badlands to rolling sand dunes and jagged mountain ranges. Towering peaks, such as Telescope Peak, rise over 11,000 feet, offering breathtaking views and cooler temperatures for hikers willing to make the trek. Over 1,000 plant species have adapted to thrive here, including the resilient creosote bush and vibrant spring wildflowers that transform the desert after rare rains.\n\nDeath Valley also preserves a rich geologic and cultural history. Ancient lakebeds, volcanic craters, and layered rock formations tell stories of Earth’s dynamic processes over millions of years. Adventurers can explore narrow slot canyons, such as Golden Canyon, or marvel at Ubehebe Crater, a stunning volcanic feature. Historic sites, like the remnants of mining operations and ghost towns, give a glimpse into the lives of those who sought fortune in this unforgiving environment.\n\nFor star enthusiasts, the park’s remote location provides incredibly dark skies, making it one of the best places in the world for stargazing. Summer nights, though warm, offer unmatched opportunities to witness the Milky Way in vivid detail. Trails, scenic drives, and overlooks like Zabriskie Point and Dante’s View make it easy to experience Death Valley’s raw beauty, no matter your skill level or interest.\n\nWhether you’re drawn to the sheer extremes of the environment, the dramatic landscapes, or the fascinating history, Death Valley is a destination that continuously surprises and inspires. Be sure to come prepared with plenty of water, sun protection, and a sense of adventure as you explore this unforgettable desert wilderness.",
    "Location": "36.24,-116.82",
    "Established": "October 31, 1994",
    "Area": "3,408,395.63 acres (13,793.3 km2)",
    "Annual_Visitors": 1128862,
    "Latitude": 36.24,
    "Longitude": -116.82,
    "AllTrails URL": "https://www.alltrails.com/parks/us/california/death-valley-national-park",
    "Map Link": "https://www.nps.gov/media/photo/collection-item.htm?pg=7323739&cid=305fb7af-a71b-469b-941e-a98b439c882f&id=a5bcc3bf-7a8b-409d-88cc-3490c7866551&sid=88d71596-26ed-41d9-894d-af0cae633f88&p=1&sort=relevance",
    "Map Type": "Park Map"
  },
  {
    "Name": "Denali",
    "Description": "Centered around Mount Denali, the towering 20,310-foot peak that holds the distinction of being the tallest and most prominent mountain in North America, this national park offers a wealth of opportunities for outdoor enthusiasts. Denali National Park and Preserve encompasses a stunningly diverse landscape, from expansive boreal forests to rugged alpine terrain draped with long, glacial icefields. A single 92-mile road, much of which is accessible only via scheduled tour buses, winds through the park's unspoiled wilderness, leading adventurous visitors toward breathtaking destinations such as Wonder Lake.\n\nThe park is a haven for wildlife, offering a chance to spot iconic Alaskan creatures like grizzly bears, moose, caribou, Dall sheep, and wolves. Bird enthusiasts will also delight in the diversity of avian life, which includes golden eagles, ptarmigans, and migratory species that fill the summer skies. Whether you're traversing the backcountry with a backpack and a sense of adventure or enjoying the more accessible areas along the park road, Denali promises a connection to a raw and untamed natural world.\n\nFor those passionate about hiking, the park stands out as a backcountry paradise, where there are no marked trails, allowing visitors to explore undisturbed terrain guided only by maps, compasses, and their own instincts. This level of freedom, coupled with the pristine environment, makes Denali a unique destination for seasoned adventurers seeking solitude and immersion in nature. \n\nVisitors can also experience the dynamic interplay of seasons, with the summer months offering wildflower-filled tundra, nearly endless daylight, and a chance to experience the midnight sun. Meanwhile, autumn colors enhance the landscape in stunning reds and golds, and the colder months create opportunities for seeing the aurora borealis dancing across the night sky.\n\nWhether you're drawn to Denali for its dramatic mountain vistas, its thriving wildlife, or the freedom to explore untouched wilderness, this park is a showcase of Alaska's extraordinary beauty and a world-class destination for nature lovers.",
    "Location": "63.33,-150.50",
    "Established": "February 26, 1917",
    "Area": "4,740,911.16 acres (19,185.8 km2)",
    "Annual_Visitors": 427562,
    "Latitude": 63.33,
    "Longitude": -150.5,
    "AllTrails URL": "https://www.alltrails.com/parks/us/alaska/denali-national-park",
    "Map Link": "https://www.nps.gov/media/photo/collection-item.htm?pg=7323739&cid=305fb7af-a71b-469b-941e-a98b439c882f&id=0ad819c9-157f-4dc8-af40-a9de3755a0f6&sid=8993673c-d3a6-4b83-8c9c-88b14764c192&p=1&sort=relevance",
    "Map Type": "Park Map"
  },
  {
    "Name": "Dry Tortugas",
    "Description": "Located at the far western edge of the Florida Keys, Dry Tortugas National Park is a hidden gem combining rich history, vibrant marine ecosystems, and breathtaking landscapes. Accessible only by boat or seaplane, this remote park offers visitors an unparalleled sense of adventure and tranquility. At its heart lies Fort Jefferson, a sprawling Civil War-era fortress and the largest brick masonry structure in the Americas. The fort itself is a fascinating piece of history, with its towering walls and storied past offering a window into 19th-century military life.\n\nSurrounding the islands, the park's pristine waters are teeming with marine life. Its undisturbed coral reefs showcase stunning biodiversity, making it a paradise for snorkelers and divers. Brightly colored fish dart among the corals, while the remnants of historic shipwrecks add an air of mystery to underwater exploration. Kayaking allows for an up-close experience with the park’s crystal-clear waters, where paddlers can weave through seagrass beds and spot sea turtles, rays, and various bird species.\n\nThe Dry Tortugas are also a haven for birdwatchers, particularly during migration seasons when many species make their stop here. With its isolated location, the park offers incredible stargazing opportunities, untainted by urban light pollution.\n\nWhether you’re visiting to explore the fort, discover the wonders beneath the waves, or simply escape the bustle of daily life, Dry Tortugas National Park promises a truly unforgettable experience for outdoor enthusiasts and history buffs alike.",
    "Location": "24.63,-82.87",
    "Established": "October 26, 1992",
    "Area": "64,701.22 acres (261.8 km2)",
    "Annual_Visitors": 78488,
    "Latitude": 24.63,
    "Longitude": -82.87,
    "AllTrails URL": "https://www.alltrails.com/parks/us/florida/dry-tortugas-national-park",
    "Map Link": "https://www.nps.gov/media/photo/collection-item.htm?pg=7323739&cid=305fb7af-a71b-469b-941e-a98b439c882f&id=727a46d8-8e71-4e48-9807-4e4acd93c7c6&sid=c19754ce-fd4d-4d00-acd8-522f99bdf9dd&p=1&sort=relevance",
    "Map Type": "Park Map"
  },
  {
    "Name": "Everglades",
    "Description": "The Everglades offer a unique subtropical wilderness unlike any other in the United States, blending diverse ecosystems of mangroves, marshes, and tropical rainforests. Recognized as the largest tropical wilderness in the country, this expansive area serves as both a key marine estuary and a vital refuge for an incredible variety of wildlife. It is home to 36 protected species, including the elusive Florida panther, the ancient American crocodile, and the gentle West Indian manatee. These species highlight the critical importance of the Everglades for biodiversity and conservation.\n\nVisitors can explore the park's vast wetlands through airboat tours, which provide thrilling close-up views of this intricate ecosystem. The Everglades also cater to outdoor enthusiasts with opportunities for wildlife viewing, birdwatching, hiking, kayaking, and backcountry camping. The dynamic landscape, characterized by its flowing \"river of grass\" and thriving mangrove forests, supports a delicate balance of freshwater and saltwater habitats, making it a hub for ecological diversity.\n\nHowever, the Everglades have faced challenges due to human impact. Portions of the wetlands have been drained and developed over the past century, leading to habitat loss and disrupted water flow. Ongoing restoration efforts strive to repair these disruptions and revive the natural processes that are essential for the park's ecosystem to thrive.\n\nExploring the Everglades is an invitation to immerse yourself in a rare and remarkable environment teeming with life and to learn about the intricate connections that sustain this fragile yet resilient wilderness. For lovers of nature and adventure, the Everglades offer a chance to witness the beauty and complexity of one of the most extraordinary ecosystems in the world.",
    "Location": "25.32,-80.93",
    "Established": "May 30, 1934",
    "Area": "1,508,938.57 acres (6,106.5 km2)",
    "Annual_Visitors": 1155193,
    "Latitude": 25.32,
    "Longitude": -80.93,
    "AllTrails URL": "https://www.alltrails.com/parks/us/florida/everglades-national-park",
    "Map Link": "https://www.nps.gov/media/photo/collection-item.htm?pg=7323739&cid=305fb7af-a71b-469b-941e-a98b439c882f&id=5238bf1e-d52a-470d-89ef-56b18a95bdd6&sid=51f0a1c9-be0a-42df-a2b2-ea59f003c743&p=1&sort=relevance",
    "Map Type": "Park Map"
  },
  {
    "Name": "Gates of the Arctic",
    "Description": "Located entirely above the Arctic Circle, Gates of the Arctic National Park and Preserve stands as a vast, untouched wilderness in northern Alaska. This remote expanse is nestled within the rugged Brooks Range, offering unparalleled opportunities for backcountry camping, hiking, and exploration. With no established roads, trails, or facilities, the park is a haven for adventurous outdoor enthusiasts seeking solitude and a direct connection to pristine nature.\n\nSpanning over 8.4 million acres, Gates of the Arctic is the northernmost national park in the United States and one of its most wild. Visitors should be prepared for self-reliant travel through varied terrain, including alpine valleys, sweeping tundra, towering peaks, and glacier-carved river valleys. The park’s solitude allows for a rare opportunity to experience true wilderness, where human footprints are fleeting and ecosystems thrive undisturbed. Wildlife is abundant, with caribou herds, moose, wolves, bears, Dall sheep, and migratory birds populating the land.\n\nThis region has been home to Alaska Natives for over 11,000 years, particularly the Iñupiat and Athabaskan peoples, who continue to maintain deep cultural and subsistence ties to the area. Visitors venturing into the park are not only stepping into a landscape of raw natural beauty but also into a space steeped in human history. The timeless interdependence of the caribou migrations and Indigenous traditions offers a profound connection to the land.\n\nIt’s important to remember that this is a park of true wilderness. There are no visitor centers, campgrounds, or other infrastructure common in other national parks. Access is generally by air taxi or long overland treks, making careful planning and preparation essential. For those willing to embrace its challenges, Gates of the Arctic offers a rewarding experience of immersion in one of the last untrammeled ecosystems on Earth. This is a place where silence dominates, the midnight sun casts its glow, and winter’s auroras dance across the vast horizon — a pure wilderness experience like no other.",
    "Location": "67.78,-153.30",
    "Established": "December 2, 1980",
    "Area": "7,523,897.45 acres (30,448.1 km2)",
    "Annual_Visitors": 9457,
    "Latitude": 67.78,
    "Longitude": -153.3,
    "AllTrails URL": "https://www.alltrails.com/parks/us/alaska/gates-of-the-arctic-national-park",
    "Map Link": "https://www.nps.gov/media/photo/collection-item.htm?pg=7323739&cid=305fb7af-a71b-469b-941e-a98b439c882f&id=3617ecaa-71e3-4e27-a90e-b3cd74d4172f&sid=4bf6cc53-fea4-4a5a-b885-f048bcd184f7&p=1&sort=relevance",
    "Map Type": "Park Map"
  },
  {
    "Name": "Gateway Arch",
    "Description": "Marking the symbolic \"Gateway to the West,\" Gateway Arch National Park is a striking tribute to the spirit of exploration and the profound history of westward expansion in the United States. At the heart of it stands the iconic Gateway Arch, a shimmering stainless steel monument rising 630 feet into the sky. This architectural masterpiece—equal in height and width—was completed in the 1960s to honor Thomas Jefferson's vision, the historic Lewis and Clark Expedition, and the adventures that spurred America's growth beyond the Mississippi River.\n\nThe park offers more than just a visual marvel. Short walking trails wind through its grounds, providing peaceful spots to take in scenic views of the mighty Mississippi River and the surrounding landscape. For outdoor enthusiasts, it's the perfect place to absorb history while enjoying a stroll in a vibrant urban green space.\n\nHistory buffs will find deeper narratives nearby at the Old Courthouse, located across a grassy greenway just west of the Arch. This historic building played a pivotal role in the infamous Dred Scott case, a defining legal battle that shaped the nation's troubled journey through slavery and civil rights.\n\nBeneath the Arch, an underground museum awaits, offering a rich and immersive interpretation of the structure’s engineering, the broader story of westward expansion, and the human experiences tied to these transformative events in American history. Visitors can also ascend to the top of the Arch in a unique tram ride, where panoramic views of St. Louis and the surrounding area offer a once-in-a-lifetime perspective.\n\nWhether you're drawn by the captivating design, the chance to walk in the footsteps of history, or simply the opportunity for a tranquil moment by the river, Gateway Arch National Park promises a multifaceted experience for outdoor adventurers and history enthusiasts alike.",
    "Location": "38.63,-90.19",
    "Established": "February 22, 2018[46]",
    "Area": "192.83 acres (0.8 km2)",
    "Annual_Visitors": 1618774,
    "Latitude": 38.63,
    "Longitude": -90.19,
    "AllTrails URL": "https://www.alltrails.com/parks/us/missouri/gateway-arch-national-park",
    "Map Link": "https://www.nps.gov/media/photo/collection-item.htm?pg=7323739&cid=305fb7af-a71b-469b-941e-a98b439c882f&id=4f0374c2-bb11-4748-aa12-8a55aa1eb43a&sid=8cb0ce13-4876-40fc-8940-6e3cf8d677d2&p=1&sort=relevance",
    "Map Type": "Park Map"
  },
  {
    "Name": "Glacier",
    "Description": "Glacier National Park is a breathtaking destination where alpine landscapes meet the rugged beauty of the Rocky Mountains. Featuring soaring peaks, crystal-clear lakes, and the renowned Going-to-the-Sun Road, this park offers endless opportunities for adventure and discovery. It forms the U.S. portion of the Waterton-Glacier International Peace Park, a UNESCO World Heritage Site that underscores its global significance.\n\nOne of the park’s most striking features is its dynamic ecosystem, highlighted by 26 glaciers that are rapidly retreating due to climate change. Over 130 named lakes punctuate the park's stunning terrain, their pristine waters reflecting the surrounding peaks. These geological wonders stem largely from an ancient overthrust fault, which has exposed layers of rock containing fossils from the Paleozoic era, including trilobites, mollusks, giant ferns, and even remnants of dinosaurs.\n\nFor history and architecture enthusiasts, Glacier offers a glimpse into the past with its historic lodges and chalets, which reflect early 20th-century tourism in the American West. The Going-to-the-Sun Road, a marvel of engineering completed in 1932, winds its way through the heart of the park, providing awe-inspiring vistas and access to some of its most iconic sites.\n\nOutdoor enthusiasts will discover a wilderness teeming with biodiversity. From grizzly bears and mountain goats to bald eagles and wolverines, the park is a sanctuary for wildlife. It also boasts over 700 miles of hiking trails, catering to adventurers of all skill levels with paths that lead to waterfalls, mountain passes, and hidden valleys.\n\nOne of the park’s unique landmarks is Triple Divide Peak, a geologic phenomenon where waters flow into three major drainage basins: the Atlantic, Pacific, and Arctic Oceans. This rare feature underscores the park's ecological and hydrological importance.\n\nWhether you're climbing its rugged peaks, kayaking its serene waters, or simply marveling at its untouched beauty, Glacier National Park offers an unparalleled experience that combines natural wonder with cultural and geological significance.",
    "Location": "48.80,-114.00",
    "Established": "May 11, 1910",
    "Area": "1,013,126.39 acres (4,100.0 km2)",
    "Annual_Visitors": 2908458,
    "Latitude": 48.8,
    "Longitude": -114.0,
    "AllTrails URL": "https://www.alltrails.com/parks/us/montana/glacier-national-park",
    "Map Link": "https://www.nps.gov/media/photo/collection-item.htm?pg=7323739&cid=305fb7af-a71b-469b-941e-a98b439c882f&id=9fe2fe28-43af-4574-8dde-2555a2657aca&sid=b261f7eb-69ad-4be3-b8e9-89a3f6943e5e&p=1&sort=relevance",
    "Map Type": "Park Map"
  },
  {
    "Name": "Glacier Bay",
    "Description": "Glacier Bay offers a breathtaking glimpse into the dynamic forces of nature, where tidewater glaciers, rugged mountains, deep fjords, and temperate rainforests come together in one stunning landscape. Accessible primarily by boat, this natural wonder is a paradise for outdoor enthusiasts, offering incredible opportunities for kayaking, scenic camping, and wildlife observation. Paddling through its serene waters allows visitors to get an up-close look at calving glaciers and towering ice cliffs, while camping along its shores brings a chance to immerse yourself in its untouched beauty.\n\nWildlife thrives in this remote Alaskan wilderness. Glacier Bay is home to grizzly bears roaming the forested slopes, mountain goats navigating steep cliffs, humpback whales breaching in its cold waters, and seals resting on icebergs. The skies are often alive with the cries of bald eagles, completing a vibrant ecosystem shaped by its glacial history.\n\nWhen British explorer George Vancouver arrived in 1794, the entire bay was blanketed by ice. Since then, the glaciers have dramatically retreated over 65 miles, revealing an evolving landscape that continues to be shaped by natural forces. As part of a UNESCO World Heritage Site and Biosphere Reserve, Glacier Bay is not just a haven for adventurers but also a fascinating place for scientists studying climate change and glacial dynamics.\n\nWith its blend of striking scenery, adventurous activities, and abundant wildlife, Glacier Bay provides an unforgettable experience. Whether you're navigating its icy waters, hiking its trails, or simply soaking in the quiet majesty of this pristine environment, the connection to the natural world here is unparalleled.",
    "Location": "58.50,-137.00",
    "Established": "December 2, 1980",
    "Area": "3,223,383.43 acres (13,044.6 km2)",
    "Annual_Visitors": 545758,
    "Latitude": 58.5,
    "Longitude": -137.0,
    "AllTrails URL": "https://www.alltrails.com/parks/us/alaska/glacier-bay-national-park",
    "Map Link": "https://www.nps.gov/media/photo/collection-item.htm?pg=7323739&cid=305fb7af-a71b-469b-941e-a98b439c882f&id=78ae37a8-e3b9-4494-bc6e-36672b2659fa&sid=269e3a37-9010-4d34-ae03-31a0160741e1&p=1&sort=relevance",
    "Map Type": "Park Map"
  },
  {
    "Name": "Grand Canyon",
    "Description": "Spanning 277 miles in length, reaching depths of up to 1 mile, and stretching as wide as 15 miles at certain points, the Grand Canyon is one of nature’s most awe-inspiring creations. Sculpted over millions of years by the persistent force of the Colorado River, this immense geological wonder is a masterpiece of erosion, revealing the vibrant, multicolored layers of the Colorado Plateau. Visitors have the rare opportunity to witness a three-tiered canyon system that showcases a dynamic timeline of Earth’s history etched into its walls.\n\nOutdoor enthusiasts will find countless ways to explore this iconic landscape. The Bright Angel Trail, one of the most popular and accessible paths, offers a challenging yet rewarding journey into the depths of the canyon. For those seeking solitude and adventure, numerous other trails provide varying levels of difficulty and unique perspectives, with options available from both the North and South Rims. The South Rim, open year-round, is more developed and boasts breathtaking viewpoints like Mather Point and Desert View, while the less-visited North Rim offers a quieter, more remote wilderness experience.\n\nBeyond hiking, visitors can experience the canyon from a variety of vantage points. Scenic drives, such as Desert View Drive, reveal expansive vistas where the play of light transforms the rugged terrain throughout the day. For a truly immersive adventure, rafting trips along the Colorado River provide an unparalleled perspective of the canyon’s towering walls and hidden waterfalls.\n\nThe Grand Canyon isn’t just a destination—it’s a living classroom, with opportunities to learn about geology, ecology, and Native American history. The immense scale, vibrant colors, and dramatic landscapes make it a bucket-list destination for nature lovers, photographers, and adventurers alike. Whether you're descending into its depths, marveling from the rims, or exploring its waterways, the Grand Canyon promises an unforgettable connection to the power and beauty of the natural world.",
    "Location": "36.06,-112.14",
    "Established": "February 26, 1919",
    "Area": "1,201,647.03 acres (4,862.9 km2)",
    "Annual_Visitors": 4732101,
    "Latitude": 36.06,
    "Longitude": -112.14,
    "AllTrails URL": "https://www.alltrails.com/parks/us/arizona/grand-canyon-national-park",
    "Map Link": "https://www.nps.gov/media/photo/collection-item.htm?pg=7323739&cid=305fb7af-a71b-469b-941e-a98b439c882f&id=4f2c94ce-953a-4099-afae-49b7565484f4&sid=65d0a3c2-45e0-40f3-be06-fa89fbf489c9&p=1&sort=relevance",
    "Map Type": "Park Map"
  },
  {
    "Name": "Grand Teton",
    "Description": "Grand Teton National Park offers awe-inspiring mountain landscapes, captivating outdoor experiences, and abundant opportunities for exploration. Dominated by the jagged peaks of the Teton Range, the park’s centerpiece is Grand Teton itself, the tallest mountain in the range, reaching an elevation of 13,775 feet. The park is renowned for its diverse network of trails that cater to hikers of all skill levels, from serene lakeshore strolls to challenging backcountry routes that reward visitors with sweeping views and solitude. \n\nVisitors will find an impressive collection of lakes, including the iconic Jackson Lake and smaller piedmont lakes such as Jenny Lake and Leigh Lake, whose mirrored surfaces reflect the dramatic skyline of rocky peaks. These lakes, along with the surrounding wetlands and sagebrush plains, create thriving habitats for a wide variety of wildlife. Keep an eye out for elk, moose, and bison in the lowlands, while eagles and hawks soar overhead. Grizzly and black bears inhabit the park as well, so it's crucial to follow safety guidelines if you're venturing into bear country.\n\nThe park also holds the historic Jackson Hole Valley, a region that preserves a fascinating blend of natural history and human heritage. Here, you can explore rustic cabins, historic ranching sites, and cultural landmarks that echo the lives of early settlers and Native American communities.\n\nFor outdoor enthusiasts, Grand Teton offers activities like kayaking, rock climbing, fly fishing, and photography, with endless opportunities to connect with nature. Backcountry camping is a standout experience, offering overnight adventurers a unique chance to immerse themselves in the untouched wilderness far from the crowds. With its pristine alpine environment, diverse ecosystems, and unparalleled scenery, Grand Teton National Park is a destination that promises adventure, inspiration, and lasting memories for all who visit.",
    "Location": "43.73,-110.80",
    "Established": "February 26, 1929",
    "Area": "310,044.36 acres (1,254.7 km2)",
    "Annual_Visitors": 2806223,
    "Latitude": 43.73,
    "Longitude": -110.8,
    "AllTrails URL": "https://www.alltrails.com/parks/us/wyoming/grand-teton-national-park",
    "Map Link": "https://www.nps.gov/media/photo/collection-item.htm?pg=7323739&cid=305fb7af-a71b-469b-941e-a98b439c882f&id=9f35789f-3f7d-447b-9fe7-cb4914e0b6e1&sid=375d897c-449e-4f11-bb64-cb6f9c41130a&p=1&sort=relevance",
    "Map Type": "Park Map"
  },
  {
    "Name": "Great Basin",
    "Description": "Nestled in the high desert of eastern Nevada, Great Basin National Park offers a stunning blend of rugged natural beauty, geological wonders, and rich biodiversity. Dominated by the towering Wheeler Peak, Nevada's second-highest mountain at over 13,000 feet, the park is a haven for outdoor enthusiasts seeking adventure and solitude. Hikers can challenge themselves on the Wheeler Peak Summit Trail, explore alpine landscapes, and discover one of the southernmost rock glaciers in the United States.\n\nAmong the park's most remarkable treasures are the ancient bristlecone pines, some of which are over 5,000 years old, making them among the oldest living organisms on Earth. Below ground, the limestone Lehman Caves invite visitors into a mesmerizing subterranean world of intricate stalactites, stalagmites, and rare shield formations that captivate both avid cavers and casual explorers.\n\nGreat Basin is also one of the best places in the United States to experience the night sky in all its glory. Its remote location makes light pollution nearly nonexistent, offering incredible stargazing opportunities where the Milky Way stretches vividly across the heavens. The park even hosts astronomy programs and events to help visitors deepen their connection with the celestial wonders.\n\nWildlife lovers will find the park equally compelling, with diverse species ranging from the Townsend's big-eared bat flitting through the twilight to the fleet-footed pronghorn roaming the expansive valleys. Anglers can try their luck in the clear mountain streams, home to the Bonneville cutthroat trout, an iconic native fish of the region.\n\nWhether you're there to summit rugged peaks, explore hidden caves, marvel at ancient trees, or simply bask in the quiet beauty of one of the nation's least crowded national parks, Great Basin offers an unforgettable escape into the heart of the wild.",
    "Location": "38.98,-114.30",
    "Established": "October 27, 1986",
    "Area": "77,180.00 acres (312.3 km2)",
    "Annual_Visitors": 142115,
    "Latitude": 38.98,
    "Longitude": -114.3,
    "AllTrails URL": "https://www.alltrails.com/parks/us/nevada/great-basin-national-park",
    "Map Link": "https://www.nps.gov/media/photo/collection-item.htm?pg=7323739&cid=305fb7af-a71b-469b-941e-a98b439c882f&id=007eacbe-782f-4e20-b8d0-0f68c8f8e307&sid=83641050-adb8-4d1f-b117-30ea702d82e2&p=1&sort=relevance",
    "Map Type": "Park Map"
  },
  {
    "Name": "Great Sand Dunes",
    "Description": "Nestled in Colorado’s San Luis Valley, Great Sand Dunes National Park boasts the tallest sand dunes in North America, some towering up to 750 feet (230 meters). These dramatic formations are the result of centuries of wind and water sculpting ancient deposits from the Rio Grande, creating an awe-inspiring landscape that feels both vast and intimate. Beyond the dunes, the park preserves a rich mosaic of ecosystems, including expansive grasslands, thriving shrublands, seasonal wetlands, and tranquil alpine lakes. Towering above it all are six 13,000-foot peaks and old-growth forests, providing a stunning backdrop and opportunities for high-altitude exploration.\n\nAdventure enthusiasts will find no shortage of activities, with sandboarding and sledding on the dunes being unique highlights. Hiking trails wind through diverse terrain, offering options for all skill levels. Backcountry camping is a favorite for those looking to immerse themselves in the solitude and natural beauty of this remote area. Thanks to its dark skies and minimal light pollution, the park is also ideal for stargazing—on clear nights, the Milky Way and countless constellations are visible in breathtaking detail.\n\nThe Great Sand Dunes are more than just a geological wonder; they’re a thriving natural haven that invites exploration, discovery, and a deep connection with the outdoors. Whether you're climbing the dunes, trekking to alpine lakes, or simply marveling at the ever-changing interplay of light and shadow across the sand, this national park offers an unforgettable experience for nature lovers and adventurers alike.",
    "Location": "37.73,-105.51",
    "Established": "September 24, 2004",
    "Area": "107,345.73 acres (434.4 km2)",
    "Annual_Visitors": 493428,
    "Latitude": 37.73,
    "Longitude": -105.51,
    "AllTrails URL": "https://www.alltrails.com/parks/us/colorado/great-sand-dunes-national-park",
    "Map Link": "https://www.nps.gov/media/photo/collection-item.htm?pg=7323739&cid=305fb7af-a71b-469b-941e-a98b439c882f&id=1dd33a11-0d4a-41ef-afbe-5f8a9d7bec4a&sid=11eead18-7f6e-4756-827f-a1d6ca39e05f&p=1&sort=relevance",
    "Map Type": "Park Map"
  },
  {
    "Name": "Great Smoky Mountains",
    "Description": "Nestled in the heart of the Appalachian Mountains, the Great Smoky Mountains National Park is a treasure trove of natural beauty and biodiversity. Renowned for its signature mist-covered peaks and lush, forested landscapes, the park is a haven for outdoor enthusiasts of all kinds. Its varied terrain, which spans a wide range of elevations, supports an incredible array of life—more than 400 vertebrate species, 100 species of trees, and 5,000 species of plants thrive here, making it one of the most biologically diverse parks in the United States.\n\nHiking is undoubtedly the crown jewel of park activities, offering visitors over 800 miles (1,300 km) of trails to explore. Among these is a 70-mile (110 km) stretch of the iconic Appalachian Trail, which weaves through the park and offers stunning views of the surrounding wilderness. From leisurely walks through wildflower meadows to challenging ascents to panoramic vistas, the trails cater to both casual hikers and seasoned trekkers looking for adventure.\n\nBeyond hiking, the park boasts a variety of other recreational opportunities. Visitors can cast a line in one of the crystal-clear streams, home to native brook trout and other fish species. Equestrians will find designated trails for horseback riding, adding a unique way to experience the scenic beauty of the area. For history buffs, nearly 80 preserved historic structures, including cabins, barns, and churches, provide a glimpse into the rich cultural heritage of the region, showcasing the life and struggles of the early Appalachian settlers.\n\nWith its mix of breathtaking landscapes, abundant wildlife, and opportunities for exploration and relaxation, the Great Smoky Mountains National Park offers something for everyone. Whether you're camping under the starry skies, marveling at tumbling waterfalls, or simply soaking in the quiet serenity of nature, this park promises an unforgettable experience for all who visit.",
    "Location": "35.68,-83.53",
    "Established": "June 15, 1934",
    "Area": "522,426.88 acres (2,114.2 km2)",
    "Annual_Visitors": 12937633,
    "Latitude": 35.68,
    "Longitude": -83.53,
    "AllTrails URL": "https://www.alltrails.com/parks/us/tennessee/great-smoky-mountains-national-park",
    "Map Link": "https://www.nps.gov/media/photo/collection-item.htm?pg=7323739&cid=305fb7af-a71b-469b-941e-a98b439c882f&id=8410e7f4-0499-4e4e-802f-7bbdfb85b5fa&sid=3e946cf8-27e6-4ea3-94b2-1ceec8223539&p=1&sort=relevance",
    "Map Type": "Park Map"
  },
  {
    "Name": "Guadalupe Mountains",
    "Description": "Nestled in the remote beauty of western Texas, Guadalupe Mountains National Park is a haven for outdoor enthusiasts seeking stunning landscapes and a true sense of adventure. Home to Guadalupe Peak, the highest point in Texas at 8,751 feet, the park offers breathtaking views and rewarding climbs for hikers. Beyond its towering peaks, the park also features McKittrick Canyon, a hidden gem known for its vibrant fall foliage, particularly the striking bigtooth maple trees that paint the canyon in vivid hues during autumn.\n\nThe park is part of the vast Chihuahuan Desert, showcasing an extraordinary blend of desert ecosystems and rugged terrain. It's also a geological treasure trove, containing a fossilized reef from the Permian era, a reminder of when the area was submerged under an ancient sea over 250 million years ago. This unique feature makes it an exciting destination for geology enthusiasts.\n\nGuadalupe Mountains National Park is an excellent choice for remote hiking and backcountry camping, with over 80 miles of trails that wind through canyons, forests, and high desert landscapes. Wildlife like mule deer, peregrine falcons, and elusive mountain lions add to the sense of exploration. Whether you're summiting the peaks, marveling at ancient fossils, or simply soaking in the serenity of the desert, this park offers a truly memorable outdoor experience.",
    "Location": "31.92,-104.87",
    "Established": "September 30, 1972",
    "Area": "86,367.10 acres (349.5 km2)",
    "Annual_Visitors": 219987,
    "Latitude": 31.92,
    "Longitude": -104.87,
    "AllTrails URL": "https://www.alltrails.com/parks/us/texas/guadalupe-mountains-national-park",
    "Map Link": "https://www.nps.gov/media/photo/collection-item.htm?pg=7323739&cid=305fb7af-a71b-469b-941e-a98b439c882f&id=885d9357-5685-442c-8290-03ba4cd09529&sid=6b503d5d-25b7-44a2-850f-a167fc6b67db&p=1&sort=relevance",
    "Map Type": "Park Map"
  },
  {
    "Name": "Haleakalā",
    "Description": "Haleakalā National Park, located on the island of Maui, offers an extraordinary blend of natural wonders and outdoor activities, making it a must-visit destination for nature enthusiasts. The park is home to the Haleakalā Volcano, a massive shield volcano with a vast summit crater dotted with striking cinder cones. The volcanic landscape is otherworldly, with dramatic colors and features shaped by centuries of geological activity.\n\nOne of the park’s most renowned experiences is witnessing the sunrise from the summit, where panoramic views often unfold above a sea of clouds. Stargazing here is equally awe-inspiring, as the high elevation and clear skies create exceptional conditions for observing the night sky. \n\nHaleakalā also offers diverse hiking opportunities, ranging from trails that traverse the stark lava landscapes of the summit area to lush paths in the Kipahulu region. In the Kipahulu section, visitors can explore verdant rainforests and a series of picturesque freshwater pools and waterfalls. This area is not only visually stunning but also ecologically significant, serving as a habitat for unique species, including the endangered Hawaiian goose (nēnē), the state bird of Hawaii.\n\nFor campers, the park provides two designated campgrounds, allowing for closer immersion in its serene surroundings. Haleakalā National Park is particularly notable for its role in protecting biodiversity, boasting the highest number of endangered species of any U.S. national park. Beyond its natural beauty, the park offers a rare opportunity to connect with the unique ecosystems and cultural heritage of Hawaii, making it a destination that rewards exploration and discovery.",
    "Location": "20.72,-156.17",
    "Established": "July 1, 1961",
    "Area": "33,488.98 acres (135.5 km2)",
    "Annual_Visitors": 1087616,
    "Latitude": 20.72,
    "Longitude": -156.17,
    "AllTrails URL": "https://www.alltrails.com/parks/us/hawaii/haleakala-national-park",
    "Map Link": "https://www.nps.gov/media/photo/collection-item.htm?pg=7323739&cid=305fb7af-a71b-469b-941e-a98b439c882f&id=b70421dc-88c0-4da8-b5a6-409578a6ba73&sid=57aeb9f6-24ee-42e4-b03a-2bf20e0f25c1&p=1&sort=relevance",
    "Map Type": "Park Map"
  },
  {
    "Name": "Hawaiʻi Volcanoes",
    "Description": "Hawaiʻi Volcanoes National Park is a captivating destination on the Big Island, where the raw power of nature is on full display. Home to Kīlauea and Mauna Loa, two of the planet's most active volcanoes, the park offers visitors a chance to witness the dynamic processes that shape our Earth. Spanning a remarkable range of ecosystems, the park transitions from lush tropical forests near sea level to stark, otherworldly lava fields that climb to elevations exceeding 13,000 feet (4,000 meters). This incredible diversity makes it a paradise for outdoor enthusiasts seeking exploration and discovery.\n\nHiking trails weave through the park’s varied landscapes, offering experiences that range from easy walks through towering tree ferns to challenging treks across freshly hardened lava flows. The iconic Kīlauea Iki Trail, for instance, takes you through a rainforest and down into the floor of a once-molten lava lake. For those looking for a longer adventure, the backcountry areas of Mauna Loa provide unparalleled solitude and sweeping vistas of the Big Island.\n\nCamping within the park allows for unforgettable nights under star-filled skies, with opportunities to hear the sounds of the volcanic landscape subtly shifting and breathing. Visitors can also enjoy ranger-led programs to learn about the cultural and geological significance of the region, as Hawai‘i Volcanoes is recognized as both a UNESCO World Heritage Site and a Biosphere Reserve.\n\nWhether you’re drawn by the allure of active geological wonders, the chance to experience a range of ecosystems in one place, or the opportunity to learn about the deep connections between the land and traditional Hawaiian culture, Hawaiʻi Volcanoes National Park offers something truly unique for every nature lover.",
    "Location": "19.38,-155.20",
    "Established": "August 1, 1916",
    "Area": "344,812.18 acres (1,395.4 km2)",
    "Annual_Visitors": 1580961,
    "Latitude": 19.38,
    "Longitude": -155.2,
    "AllTrails URL": "https://www.alltrails.com/parks/us/hawaii/hawaii-volcanoes-national-park",
    "Map Link": "https://www.nps.gov/media/photo/collection-item.htm?pg=7323739&cid=305fb7af-a71b-469b-941e-a98b439c882f&id=910dd491-61ff-4b9a-90c5-76e96c7f0872&sid=da96a415-0950-447f-9eab-514d5fa90406&p=1&sort=relevance",
    "Map Type": "Park Map"
  },
  {
    "Name": "Hot Springs",
    "Description": "Tucked into the heart of the Ouachita Mountains, Hot Springs National Park offers a unique blend of natural beauty, rich history, and relaxing experiences. Its namesake thermal springs have drawn visitors for centuries, providing a rare opportunity to soak in nature’s warmth while surrounded by the charm of the park’s historic bathhouses. Established on April 20, 1832, as a federal reserve, Hot Springs holds the distinction of being the oldest area managed by the National Park Service, predating the official creation of the park system. \n\nThe iconic Bathhouse Row, a collection of beautifully preserved 19th-century architecture, serves as the cultural centerpiece of the park. Here, you can explore the grand, historic bathhouses, several of which still offer spa treatments using the natural thermal waters. These buildings highlight the park’s unique role as a retreat for wellness and relaxation, a tradition that continues to this day.\n\nBeyond its historic structures, the park features lush, forested trails that wind through the Ouachita Mountains, offering outdoor enthusiasts endless opportunities for hiking, birdwatching, and connecting with nature. The trails vary in difficulty, catering to everyone from casual walkers to seasoned hikers. The scenic vistas, quiet woodlands, and diverse plant life add to the park’s appeal, creating an ideal destination for those seeking both adventure and tranquility.\n\nInterestingly, Hot Springs is the only national park located within a city, blending urban culture with the serenity of the natural world. It held the title of the smallest national park until 2018, yet its compact size makes it accessible and easy to explore in just a few days. Whether you’re soaking in the history, hiking through the forest, or relaxing in the thermal waters, Hot Springs National Park offers an experience unlike any other, making it a must-visit destination for nature lovers and history buffs alike.",
    "Location": "34.51,-93.05",
    "Established": "March 4, 1921",
    "Area": "5,554.15 acres (22.5 km2)",
    "Annual_Visitors": 2646133,
    "Latitude": 34.51,
    "Longitude": -93.05,
    "AllTrails URL": "https://www.alltrails.com/parks/us/arkansas/hot-springs-national-park",
    "Map Link": "https://www.nps.gov/media/photo/collection-item.htm?pg=7323739&cid=305fb7af-a71b-469b-941e-a98b439c882f&id=739704d3-a980-417e-8bf6-acb3af735f97&sid=5c17139f-a8c6-455f-b413-e4302f4233d8&p=1&sort=relevance",
    "Map Type": "Park Map"
  },
  {
    "Name": "Indiana Dunes",
    "Description": "Nestled along a 20-mile stretch of Lake Michigan's southern shore, Indiana Dunes National Park offers outdoor enthusiasts a destination rich in natural beauty and ecological diversity. This remarkable park features sandy beaches, towering dunes, and a variety of habitats, including grassy prairies, lush peat bogs, and serene marsh wetlands. These environments support an astonishing range of wildlife, with over 2,000 plant and animal species calling the area home. Birdwatchers, in particular, will find this park a haven for spotting migratory and resident birds throughout the year.\n\nWith an assortment of trails weaving through its diverse landscapes, the park accommodates both casual hikers and serious trekkers. Visitors can explore paths that meander past the dunes, offering striking views of Lake Michigan, or venture into shaded woodlands and wetlands alive with the sounds of nature. Each season provides a different perspective, from blooming wildflowers in spring and summer to the vibrant foliage in fall and the quiet beauty of winter snowscapes.\n\nIndiana Dunes is also a unique destination for geology lovers, as the dunes themselves are part of a fascinating story of glacial movements and wind patterns that have shaped this shoreline over thousands of years. Whether you're drawn to the tranquil beaches for a day of relaxation, the trails for a challenging outdoor adventure, or the rich ecosystems for observation and study, this park offers something for everyone. It’s a living, breathing testament to the intricate web of life and land along the Great Lakes.",
    "Location": "41.6533,-87.0524",
    "Established": "February 15, 2019",
    "Area": "15,349.08 acres (62.1 km2)",
    "Annual_Visitors": 2834180,
    "Latitude": 41.6533,
    "Longitude": -87.0524,
    "AllTrails URL": "https://www.alltrails.com/parks/us/indiana/indiana-dunes-national-park",
    "Map Link": "https://www.nps.gov/media/photo/collection-item.htm?pg=7323739&cid=305fb7af-a71b-469b-941e-a98b439c882f&id=eb29d4bb-8e29-4a88-9963-04d1b4d92d36&sid=f4526acb-9fe6-4b36-97b1-016e39f838f7&p=1&sort=relevance",
    "Map Type": "Park Map"
  },
  {
    "Name": "Isle Royale",
    "Description": "Isle Royale National Park, tucked away in the vast expanse of Lake Superior, offers an unmatched experience for those seeking solitude and untamed wilderness. Accessible only by ferry from the mainland, this remote destination is a haven for outdoor enthusiasts. The park centers around Isle Royale, the largest island in Lake Superior, and also encompasses more than 400 smaller islands within 4.5 miles of its rugged shores.\n\nKnown for its breathtaking landscapes and pristine waterways, Isle Royale is a paradise for backcountry campers, paddlers, and hikers. The island features a network of trails that weave through dense forests, rocky ridges, and serene shorelines, inviting exploration at every turn. Kayakers and canoeists can navigate the island's secluded coves and channels, with opportunities to encounter the park’s abundant natural beauty from the water.\n\nWildlife lovers will find Isle Royale particularly intriguing. The island is home to only 20 mammal species, yet its unique ecological dynamics have captivated researchers for decades. The interplay between the predator-prey relationship of wolves and moose on the island is an ongoing natural study of evolution and survival in an isolated ecosystem. Observing these animals in their natural habitat is a rare and humbling experience.\n\nAdding to its allure, the waters around Isle Royale are dotted with historic shipwrecks, remnants of Lake Superior’s storied maritime history. These underwater sites attract divers eager to explore the preserved relics of a bygone era. Whether you’re trekking its trails, paddling its waterways, or simply soaking in the vast, unspoiled beauty, Isle Royale offers a profound connection to nature in one of the most remote corners of the United States.",
    "Location": "48.10,-88.55",
    "Established": "April 3, 1940",
    "Area": "571,790.30 acres (2,314.0 km2)",
    "Annual_Visitors": 25454,
    "Latitude": 48.1,
    "Longitude": -88.55,
    "AllTrails URL": "https://www.alltrails.com/parks/us/michigan/isle-royale-national-park",
    "Map Link": "https://www.nps.gov/media/photo/collection-item.htm?pg=7323739&cid=305fb7af-a71b-469b-941e-a98b439c882f&id=04c7d59d-3a6d-44e7-aa70-850cbbe00b85&sid=7999c7a0-c03a-4818-9e2a-77c9b2056b96&p=1&sort=relevance",
    "Map Type": "Park Map"
  },
  {
    "Name": "Joshua Tree",
    "Description": "Spanning the rugged terrains of Southern California, Joshua Tree National Park is where the Colorado and Mojave Deserts meet, creating a fascinating blend of contrasting ecosystems. This vast expanse is renowned for its namesake Joshua trees, whose twisted, spiky silhouettes stand as iconic symbols of the park. Outdoor enthusiasts are drawn to the diversity of its landscapes, which range from serene bleached sand dunes and barren dry lakebeds to jagged mountain ranges and intricate clusters of monzogranite rock formations.\n\nThe park’s varying elevations offer an array of environments to explore, each with its own unique character. The Mojave Desert, at higher elevations, is home to the dense groves of Joshua trees and cooler temperatures, while the lower-elevation Colorado Desert presents a starker, more arid landscape dotted with creosote bushes, ocotillos, and cholla cacti.\n\nFor rock climbers and boulderers, Joshua Tree is a world-class destination. Its stunning monoliths and rocky formations, such as the famous Hidden Valley and Skull Rock, provide countless routes suitable for all skill levels. Hikers will find trails that wind through twisting canyons, vast washes, and ancient oases, offering opportunities to spot desert wildlife like bighorn sheep, coyotes, and jackrabbits.\n\nCamping under the desert’s expansive night sky is an unforgettable experience. Far removed from city lights, this International Dark Sky Park treats visitors to breathtaking views of the Milky Way and a blanket of stars. Whether you’re there to stargaze, photograph the dramatic desert scenery, or simply find stillness in its wide-open spaces, Joshua Tree National Park offers endless rewards for those who venture into its striking, otherworldly beauty.",
    "Location": "33.79,-115.90",
    "Established": "October 31, 1994",
    "Area": "795,155.85 acres (3,217.9 km2)",
    "Annual_Visitors": 3058294,
    "Latitude": 33.79,
    "Longitude": -115.9,
    "AllTrails URL": "https://www.alltrails.com/parks/us/california/joshua-tree-national-park",
    "Map Link": "https://www.nps.gov/media/photo/collection-item.htm?pg=7323739&cid=305fb7af-a71b-469b-941e-a98b439c882f&id=ea25e28b-aa66-41a1-93eb-f9801fdab78a&sid=f771c9f0-78dc-424e-999a-a3dbcf75f6c0&p=1&sort=relevance",
    "Map Type": "Park Map"
  },
  {
    "Name": "Katmai",
    "Description": "Nestled on the remote Alaska Peninsula, Katmai National Park offers a stunning blend of natural beauty, rugged wilderness, and geological wonder. Renowned for its extraordinary brown bear viewing opportunities, the park draws both wildlife enthusiasts and photographers from around the world. Each summer, over 2,000 grizzly bears congregate along the Brooks River and other waterways to feast on spawning salmon, creating an unforgettable spectacle of nature in action.\n\nBeyond its thriving bear population, Katmai serves as a sanctuary for diverse wildlife, including caribou, wolves, moose, and elusive wolverines, making it a prime destination for those eager to explore Alaska’s wild side. The park is also a treasure trove of geological marvels. At its heart lies the Valley of Ten Thousand Smokes, a vast ash-covered landscape formed by the cataclysmic 1912 eruption of Novarupta, one of the most powerful volcanic events in recorded history. Visitors can hike or embark on guided tours to witness this surreal terrain and learn about the forces that shaped it.\n\nDominating the park’s horizon is Mount Katmai, a massive stratovolcano that still hints at the raw power of the region's volcanic origins. Due to the park's remote location, access is primarily by floatplane, adding an extra layer of adventure to the journey. Katmai National Park provides not only a haven for outdoor enthusiasts but also a profound appreciation for the untamed beauty and dynamic history of Alaska's wilderness.",
    "Location": "58.50,-155.00",
    "Established": "December 2, 1980",
    "Area": "3,674,529.33 acres (14,870.3 km2)",
    "Annual_Visitors": 33908,
    "Latitude": 58.5,
    "Longitude": -155.0,
    "AllTrails URL": "https://www.alltrails.com/parks/us/alaska/katmai-national-park",
    "Map Link": "https://www.nps.gov/media/photo/collection-item.htm?pg=7323739&cid=305fb7af-a71b-469b-941e-a98b439c882f&id=e2856dec-a502-4d6b-8ce7-a59010009df3&sid=2f468cdc-d858-4018-aa78-28ef989a0a01&p=1&sort=relevance",
    "Map Type": "Park Map"
  },
  {
    "Name": "Kenai Fjords",
    "Description": "Located on Alaska's stunning Kenai Peninsula near the town of Seward, Kenai Fjords National Park is a breathtaking wilderness of glaciers, fjords, and diverse wildlife. The park serves as the guardian of the expansive Harding Icefield, one of the largest icefields in the United States, and the source of at least 38 glaciers that cascade into rugged, glacier-carved fjords. Visitors can explore both the dramatic landscapes and the rich ecosystems where land meets sea.\n\nExit Glacier is the park's most accessible feature, reachable by a short drive from Seward. Here, visitors can hike well-maintained trails that offer close-up views of the glacier and the surrounding landscape, as well as interpretive signs that provide insight into the effects of climate change and the glacier's ongoing retreat. Beyond Exit Glacier, the rest of the park is only accessible by water or on foot, making it an ideal destination for those seeking adventure in pristine, remote settings.\n\nFor a closer look at the marine environment, boat and kayak tours depart from Seward and take visitors deep into the heart of the fjords. These excursions offer unforgettable views of tidewater glaciers calving spectacularly into the sea, along with opportunities to observe an abundance of wildlife. Keep your eyes peeled for humpback whales, orcas, sea otters, harbor seals, Steller sea lions, and a variety of seabirds such as puffins and bald eagles. Kayaking allows for a more intimate experience, letting you silently glide through calm waters surrounded by towering cliffs, cascading waterfalls, and the occasional pop of glacier-blue icebergs.\n\nKenai Fjords National Park is a haven for outdoor enthusiasts drawn to its combination of rugged beauty and accessibility. Whether you're hiking, kayaking, or on a boat tour, this park offers a front-row seat to some of Alaska's most spectacular natural wonders and a deeper appreciation for the forces of nature that continue to shape this awe-inspiring landscape.",
    "Location": "59.92,-149.65",
    "Established": "December 2, 1980",
    "Area": "669,650.05 acres (2,710.0 km2)",
    "Annual_Visitors": 389943,
    "Latitude": 59.92,
    "Longitude": -149.65,
    "AllTrails URL": "https://www.alltrails.com/parks/us/alaska/kenai-fjords-national-park",
    "Map Link": "https://www.nps.gov/media/photo/collection-item.htm?pg=7323739&cid=305fb7af-a71b-469b-941e-a98b439c882f&id=baeb9d79-7a90-4669-9bfb-f491afef6e99&sid=6c045bfd-262b-48e1-8ce8-d265ee212abb&p=1&sort=relevance",
    "Map Type": "Park Map"
  },
  {
    "Name": "Kings Canyon",
    "Description": "Set against the stunning backdrop of California's Sierra Nevada mountains, Kings Canyon National Park offers a unique blend of natural wonders for outdoor enthusiasts to explore. The park is renowned for its deep valleys, towering giant sequoias, and rugged high-country trails, making it a prime destination for hiking, backpacking, and camping.\n\nKings Canyon is home to several groves of giant sequoias, including the iconic General Grant Tree. As the world's second-largest measured tree, the General Grant Tree inspires awe not only for its size but also for its enduring presence, standing as a symbol of nature's resilience and grandeur. In fact, this ancient tree has also earned the title of the United States' \"National Christmas Tree\" due to its majestic stature.\n\nThe Kings River, with its powerful flow, has carved the granite walls of the park's namesake canyon, creating a dramatic landscape that's perfect for adventure and photography. The San Joaquin River also runs through a portion of the park, highlighting the diversity of ecosystems within its boundaries. If you're interested in exploring underground marvels, Boyden Cave is a must-visit. This limestone cavern, located along the Kings River, features stunning stalactites, stalagmites, and flowstones.\n\nKings Canyon National Park, officially designated as such in 1940, boasts a rich history as well. It absorbed the earlier General Grant National Park, which had been established in 1890 as the nation's fourth national park. This historical depth adds another layer of significance to your visit, connecting you to over a century of conservation efforts in the region. \n\nWhether you're trekking high above the canyon on remote alpine trails, marveling at ancient groves of colossal trees, or exploring vibrant rivers and caves, Kings Canyon offers an unforgettable outdoor experience for nature lovers of all kinds.",
    "Location": "36.80,-118.55",
    "Established": "March 4, 1940",
    "Area": "461,901.20 acres (1,869.2 km2)",
    "Annual_Visitors": 640986,
    "Latitude": 36.8,
    "Longitude": -118.55,
    "AllTrails URL": "https://www.alltrails.com/parks/us/california/kings-canyon-national-park",
    "Map Link": "https://www.nps.gov/media/photo/collection-item.htm?pg=7323739&cid=305fb7af-a71b-469b-941e-a98b439c882f&id=dd2e2a37-1ec5-4f86-939c-4d37d9136657&sid=37e091db-7d71-4936-8ba4-795ed36ca738&p=1&sort=relevance",
    "Map Type": "Park Map"
  },
  {
    "Name": "Kobuk Valley",
    "Description": "Nestled in the remote expanses of northern Alaska, Kobuk Valley National Park is a true wilderness treasure that promises a unique blend of geological wonder and wildlife spectacle. Spanning 61 miles (98 km) of the winding Kobuk River, the park is home to three distinct regions of Arctic sand dunes: the Great Kobuk, Little Kobuk, and Hunt River Sand Dunes. These dunes, sculpted over millennia by glacial activity and strong winds, rise dramatically to heights of up to 100 feet (30 m) and, during summer, can reach temperatures as high as 100°F (38°C)—an unexpected phenomenon in the Arctic Circle.\n\nWhat truly sets Kobuk Valley apart is the dynamic interplay of its environment and wildlife. Twice each year, approximately half a million caribou undertake their monumental migration through the park. This ancient journey carries the caribou across the dunes and along steep river bluffs, where sharp eyes can spot well-preserved ice age fossils embedded in the earth. It's a chance to witness one of the world's great natural migrations while simultaneously catching a glimpse into prehistoric times.\n\nFor adventurous visitors, Kobuk Valley offers an unparalleled opportunity to explore a truly untamed landscape. The absence of roads, trails, or marked campsites adds to the park’s pristine allure, challenging travelers to rely on their navigation skills and embrace the solitude of the Alaskan wilderness. Whether you’re paddling the serene waters of the Kobuk River, marveling at the unexpected sight of Arctic sand dunes, or scanning the horizon for a herd of caribou, this park promises an otherworldly experience for those who seek it.",
    "Location": "67.55,-159.28",
    "Established": "December 2, 1980",
    "Area": "1,750,716.16 acres (7,084.9 km2)",
    "Annual_Visitors": 16925,
    "Latitude": 67.55,
    "Longitude": -159.28,
    "AllTrails URL": "https://www.alltrails.com/parks/us/alaska/kobuk-valley-national-park",
    "Map Link": "https://www.nps.gov/media/photo/collection-item.htm?pg=7323739&cid=305fb7af-a71b-469b-941e-a98b439c882f&id=1d89e532-8c68-4e5b-bd4e-c786081f27fb&sid=ccc2837c-3b7c-4485-ac86-066a87735d6a&p=1&sort=relevance",
    "Map Type": "Park Map"
  },
  {
    "Name": "Lake Clark",
    "Description": "Nestled in the heart of the Alaskan wilderness, Lake Clark National Park offers a stunning blend of natural features, making it a paradise for outdoor enthusiasts. This diverse landscape is home to active volcanoes, including the imposing Mount Redoubt, as well as a striking array of glaciers, rivers, and waterfalls that punctuate the terrain. Visitors can explore a variety of ecosystems, from temperate rainforests to the sprawling tundra plateau, all framed by three majestic mountain ranges. The park's pristine lakes and rivers provide outstanding opportunities for fishing, while its remote, unspoiled setting makes it ideal for backcountry camping and hiking. Lake Clark’s dynamic environment is shaped by its four active volcanoes, creating a unique habitat teeming with wildlife and extraordinary geological features. Whether you’re drawn by the serenity of its wilderness or the excitement of its rugged terrain, this park offers something unforgettable for every adventurer.",
    "Location": "60.97,-153.42",
    "Established": "December 2, 1980",
    "Area": "2,619,816.49 acres (10,602.0 km2)",
    "Annual_Visitors": 18187,
    "Latitude": 60.97,
    "Longitude": -153.42,
    "AllTrails URL": "https://www.alltrails.com/parks/us/alaska/lake-clark-national-park",
    "Map Link": "https://www.nps.gov/media/photo/collection-item.htm?pg=7323739&cid=305fb7af-a71b-469b-941e-a98b439c882f&id=8a7173c5-c0f0-4655-b842-a50cbabd8727&sid=3df441a0-626f-4c5f-ac76-425763a587e5&p=1&sort=relevance",
    "Map Type": "Park Map"
  },
  {
    "Name": "Lassen Volcanic",
    "Description": "Lassen Volcanic National Park is a fascinating destination for outdoor enthusiasts, offering a rare and dynamic landscape shaped by volcanic activity. Home to Lassen Peak, the largest lava dome volcano in the world, the park is unique in that it contains all four types of volcanoes: shield, cinder cone, composite, and lava dome. While Lassen Peak's last significant eruption occurred in 1915, much of the park remains geologically active, giving visitors an up-close look at the powerful forces beneath the Earth's surface.\n\nGeothermal features are a highlight of the park, with bubbling mud pots, steaming fumaroles, and vividly colored boiling pools scattered throughout the area. Many of these features are heated by molten rock lying just below the Earth's crust, creating an otherworldly environment that is both exciting and educational to explore. Popular areas like Bumpass Hell and Sulphur Works showcase these hydrothermal wonders, with boardwalks and trails that allow you to safely experience their heat and beauty.\n\nFor those who love hiking, the park offers a variety of trails that range from easy walks to challenging routes. Adventurous hikers can ascend Lassen Peak itself, enjoying sweeping panoramic views from the summit. Remote areas of the park, such as the Cinder Cone area, feature striking volcanic formations and colorful painted dunes, making every journey a memorable experience. If you're looking for a quieter hike, there are numerous lesser-known trails through lush forests, serene mountain meadows, and pristine alpine lakes.\n\nCamping opportunities abound, allowing visitors to immerse themselves in the park's tranquility and stargaze in its dark, clear night skies. Fishing, wildlife viewing, and photography also draw visitors who appreciate the area's natural beauty. Whether you're exploring its geothermal wonders, climbing volcanic peaks, or enjoying the peaceful backcountry, Lassen Volcanic National Park is a destination that combines adventure with a unique glimpse into Earth's geological story.",
    "Location": "40.49,-121.51",
    "Established": "August 9, 1916",
    "Area": "106,589.02 acres (431.4 km2)",
    "Annual_Visitors": 446291,
    "Latitude": 40.49,
    "Longitude": -121.51,
    "AllTrails URL": "https://www.alltrails.com/parks/us/california/lassen-volcanic-national-park",
    "Map Link": "https://www.nps.gov/media/photo/collection-item.htm?pg=7323739&cid=305fb7af-a71b-469b-941e-a98b439c882f&id=f678c479-177a-46dc-8f50-8f18b9701538&sid=b50de5f0-ad6a-4dec-b800-dafcf9b90996&p=1&sort=relevance",
    "Map Type": "Park Map"
  },
  {
    "Name": "Mammoth Cave",
    "Description": "Mammoth Cave National Park is home to the world’s longest known cave system, offering over 400 miles of mapped passageways waiting to be explored. This subterranean wonder is an intricate network of tunnels and chambers, rich in history and geological significance. The cave supports an array of unique wildlife, including eight species of bats, the eyeless Northern cavefish, cave salamanders, and the endangered Kentucky cave shrimp. Each of these creatures has adapted in extraordinary ways to thrive in the dark, otherworldly environment of the cave.\n\nAbove ground, the park offers an equally captivating experience for outdoor enthusiasts. The Green River flows serenely through the park, providing excellent opportunities for kayaking, canoeing, and fishing amidst lush, forested surroundings. Over 70 miles of hiking trails wind through diverse landscapes, showcasing sinkholes, springs, and rolling hills of karst terrain. Whether exploring the intricate cave passages below or enjoying the vibrant natural beauty above ground, Mammoth Cave offers a dynamic blend of adventure, science, and scenic tranquility—perfect for visitors of all interests and skill levels.",
    "Location": "37.18,-86.10",
    "Established": "July 1, 1941",
    "Area": "72,472.87 acres (293.3 km2)",
    "Annual_Visitors": 663147,
    "Latitude": 37.18,
    "Longitude": -86.1,
    "AllTrails URL": "https://www.alltrails.com/parks/us/kentucky/mammoth-cave-national-park",
    "Map Link": "https://www.nps.gov/media/photo/collection-item.htm?pg=7323739&cid=305fb7af-a71b-469b-941e-a98b439c882f&id=b04c5c0e-fe2e-4830-b99b-ef953e9796f0&sid=148e51da-494e-413a-b502-5b08bb556560&p=1&sort=relevance",
    "Map Type": "Park Map"
  },
  {
    "Name": "Mesa Verde",
    "Description": "Mesa Verde National Park is a remarkable destination that safeguards the rich history and culture of the Ancestral Puebloan people. Home to more than 4,000 archaeological sites, including some of the most well-preserved cliff dwellings in North America, it offers an incredible glimpse into the lives of this ancient civilization, which thrived in the Four Corners region for over 700 years. Among its many highlights are the Cliff Palace, an intricate structure with 150 rooms and 23 ceremonial kivas, and the Balcony House, known for its tight passages and tunnels that visitors can explore. \n\nOutdoors enthusiasts will find plenty to enjoy, with numerous hiking trails leading to stunning viewpoints and historic sites nestled within the park's rugged landscapes. Scenic overlooks provide breathtaking views of the canyons and mesas that define this high desert environment. In addition to its archaeological wonders, Mesa Verde offers opportunities for wildlife spotting, stargazing, and immersing yourself in nature while connecting with the rich heritage of the people who called this area home centuries ago. Whether you're captivated by history, drawn to adventure, or simply seeking awe-inspiring scenery, this park promises an unforgettable experience.",
    "Location": "37.18,-108.49",
    "Established": "June 29, 1906",
    "Area": "52,485.17 acres (212.4 km2)",
    "Annual_Visitors": 499790,
    "Latitude": 37.18,
    "Longitude": -108.49,
    "AllTrails URL": "https://www.alltrails.com/parks/us/colorado/mesa-verde-national-park",
    "Map Link": "https://www.nps.gov/media/photo/collection-item.htm?pg=7323739&cid=305fb7af-a71b-469b-941e-a98b439c882f&id=e80aa16e-e64f-479d-a000-a4c19d19bb87&sid=1c77fcc4-9f53-48f6-9b92-2d49e6496702&p=1&sort=relevance",
    "Map Type": "Park Map"
  },
  {
    "Name": "Mount Rainier",
    "Description": "Mount Rainier National Park is a destination that seamlessly weaves together breathtaking landscapes, ecological diversity, and opportunities for outdoor adventure. Dominating the skyline, Mount Rainier is an active stratovolcano and a crown jewel of the Cascades, standing as the range’s most prominent peak. Its summit and slopes are blanketed by 26 named glaciers, including Carbon Glacier—the thickest in the U.S.—and Emmons Glacier, the largest by area in the contiguous United States. These icy giants feed pristine rivers and create a remarkable landscape for visitors to explore.\n\nThe park is celebrated for its stunning wildflower meadows, which burst into vibrant bloom during the warmer months. Subalpine and alpine forests blanket more than half of the park, providing a lush contrast to the rugged, snow-clad peaks above. Paradise, located on the mountain’s southern slope, lives up to its name with jaw-dropping views and a reputation as one of the snowiest places on Earth. In the spring and summer, the area's wildflower-covered terrain lures photographers, hikers, and nature enthusiasts alike, while winter offers opportunities for snowshoeing and other snowy adventures.\n\nFor those seeking the ultimate outdoor challenge, Mount Rainier is a popular destination for climbers attempting to summit its lofty heights. However, if trekking at lower altitudes is more appealing, the park offers a vast network of diverse trails that cater to all levels. Among the highlights is the Wonderland Trail, a 93-mile journey that loops around the entire mountain, offering sweeping vistas, river crossings, and the chance to experience the mountain from every angle. Many start this iconic trek from the Longmire Visitor Center, which also serves as an excellent introduction to the park’s history and features.\n\nWhether you’re drawn by its dramatic peaks, year-round adventure opportunities, or the serenity of its natural beauty, Mount Rainier National Park captures the spirit of the Pacific Northwest. It’s a destination where alpine wonders and forested landscapes come together to create an unforgettable outdoor experience.",
    "Location": "46.85,-121.75",
    "Established": "March 2, 1899",
    "Area": "236,381.64 acres (956.6 km2)",
    "Annual_Visitors": 1622395,
    "Latitude": 46.85,
    "Longitude": -121.75,
    "AllTrails URL": "https://www.alltrails.com/parks/us/washington/mount-rainier-national-park",
    "Map Link": "https://www.nps.gov/media/photo/collection-item.htm?pg=7323739&cid=305fb7af-a71b-469b-941e-a98b439c882f&id=fc0ae667-02bc-4613-9fd3-403aad3c33cc&sid=1482a476-e07d-452b-b1fd-be71a761a0de&p=1&sort=relevance",
    "Map Type": "Park Map"
  },
  {
    "Name": "New River Gorge",
    "Description": "Located in the rugged Appalachian Mountains of West Virginia, New River Gorge National Park and Preserve offers an extraordinary playground for outdoor enthusiasts. The park is renowned for its world-class whitewater rafting, offering thrilling rapids that draw paddlers from across the globe. The New River itself, one of the oldest rivers on the continent, carves through the landscape to create the deepest river gorge east of the Mississippi River, a stunning testament to the power of erosion over countless millennia.\n\nFor climbers, the park's sandstone cliffs are legendary, with over 1,400 established climbing routes of varying difficulty levels. These cliffs, known for their durability and texture, provide perfect conditions for both traditional and sport climbing. Hiking and biking trails weave through the gorge, ranging from easy riverside strolls to challenging ridge-top treks that reward adventurers with sweeping views of the surrounding wilderness. Scenic spots like the Grandview overlook offer panoramic vistas, especially breathtaking in the fall when the forested slopes explode with vibrant colors.\n\nThe centerpiece of the park is the iconic New River Gorge Bridge, one of the longest single-span arch bridges in the world. It's not only a marvel of engineering but also the focal point of the annual \"Bridge Day,\" an event where thrill-seekers can base jump or rappel from the towering structure.\n\nThe park also preserves unique cultural and historical sites. Visitors can explore the ghost town of Thurmond, which offers a glimpse into the region's coal-mining history, or visit Sandstone Falls, where the broad, cascading waters of the New River create a serene and picturesque retreat.\n\nBeyond the main park, the protected area includes an additional 65,165 acres designated as a national preserve, covering 53 miles of the New River's winding path. This section allows hunting and fishing, providing further opportunities for outdoor recreation. With its diverse landscapes, from roaring rapids to tranquil forests, New River Gorge is a haven for adventure seekers, nature lovers, and history buffs alike.",
    "Location": "38.07,-81.08",
    "Established": "December 27, 2020",
    "Area": "7,021 acres (28.4 km2)[91]",
    "Annual_Visitors": 1593523,
    "Latitude": 38.07,
    "Longitude": -81.08,
    "AllTrails URL": "https://www.alltrails.com/parks/us/west-virginia/new-river-gorge-national-park-and-preserve",
    "Map Link": "https://www.nps.gov/media/photo/collection-item.htm?pg=7323739&cid=305fb7af-a71b-469b-941e-a98b439c882f&id=c50bdefa-05fe-4e26-a554-66ad6b118ddd&sid=fc870e39-3d71-4bd5-ab15-ba89aa1b623a&p=1&sort=relevance",
    "Map Type": "Park Map"
  },
  {
    "Name": "North Cascades",
    "Description": "Nestled in the Pacific Northwest, the North Cascades National Park is a haven for outdoor enthusiasts seeking untamed wilderness and breathtaking alpine beauty. Known for its rugged peaks and extensive network of glaciers, this remote mountain range offers a striking glimpse into the region’s rich geological history. Stretching between deep river valleys and soaring summits, the park boasts an incredible natural diversity, encompassing eight distinct life zones. These habitats support an astonishing array of wildlife, including 75 mammal species and over 1,600 species of vascular plants, making it a paradise for nature lovers and photographers alike.\n\nFor hikers and climbers, the park's Stephen Mather Wilderness offers a wealth of opportunities to explore iconic destinations such as Cascade Pass, Mount Shuksan, Mount Triumph, and Eldorado Peak. Each trail and ascent promises unique vistas, from jagged ridgelines to lush alpine meadows teeming with wildflowers. In addition to its land-based adventures, the North Cascades includes the adjoining Ross Lake and Lake Chelan National Recreation Areas. These tranquil waters provide opportunities for kayaking, fishing, and simply soaking in the dramatic backdrop of towering peaks reflected on the lake surface. Managed together, these areas collectively showcase the unparalleled beauty and diversity of the North Cascades region, inviting visitors to immerse themselves in one of the wildest and most pristine landscapes in the United States.",
    "Location": "48.70,-121.20",
    "Established": "October 2, 1968",
    "Area": "504,780.94 acres (2,042.8 km2)",
    "Annual_Visitors": 30154,
    "Latitude": 48.7,
    "Longitude": -121.2,
    "AllTrails URL": "https://www.alltrails.com/parks/us/washington/north-cascades-national-park",
    "Map Link": "https://www.nps.gov/media/photo/collection-item.htm?pg=7323739&cid=305fb7af-a71b-469b-941e-a98b439c882f&id=0bce42a6-7aca-4193-8c8a-617f898da42a&sid=ec623cbd-2787-48fa-b669-e54d73f176ff&p=1&sort=relevance",
    "Map Type": "Park Map"
  },
  {
    "Name": "Olympic",
    "Description": "Nestled on Washington State's Olympic Peninsula, Olympic National Park offers an extraordinary blend of ecosystems, making it a haven for outdoor enthusiasts and nature lovers alike. From rugged Pacific coastline shaped by millennia of tides to moss-draped temperate rainforests and the snow-capped peaks of the Olympic Mountains, this park encompasses an unparalleled diversity of landscapes in a single destination. One of its crown jewels, Mount Olympus, rises to 7,980 feet, crowned in glaciers and offering a striking backdrop for explorers venturing into the alpine wilderness. \n\nThe park’s vibrant rainforests, including the Hoh and Quinault, are remarkable ecosystems that receive nearly 12 feet (3.7 meters) of rainfall annually, making them the wettest places in the contiguous United States. Here, lush ferns carpet the ground, towering Sitka spruces and western hemlocks stretch skyward, and crystal-clear streams meander through the emerald expanse—a paradise for hikers and photographers alike.\n\nFor those drawn to the coast, the park’s Pacific shoreline offers dramatic sea stacks, tide pools teeming with marine life, and pristine beaches perfect for sunset views or overnight camping under the stars. Trail networks like the Hoh River Trail guide adventurers deep into the wilderness, while shorter paths lead to serene waterfalls or panoramic viewpoints. Olympic National Park is also a designated World Heritage Site and Biosphere Reserve, attesting to its ecological significance and global importance.\n\nWhether you're setting out on a multi-day backpacking trip, enjoying a leisurely forest stroll, or simply marveling at the park’s breathtaking vistas, Olympic National Park promises an unforgettable experience in one of the most diverse and untouched natural landscapes in the United States.",
    "Location": "47.97,-123.50",
    "Established": "June 29, 1938",
    "Area": "922,649.41 acres (3,733.8 km2)",
    "Annual_Visitors": 2432972,
    "Latitude": 47.97,
    "Longitude": -123.5,
    "AllTrails URL": "https://www.alltrails.com/parks/us/washington/olympic-national-park",
    "Map Link": "https://www.nps.gov/media/photo/collection-item.htm?pg=7323739&cid=305fb7af-a71b-469b-941e-a98b439c882f&id=d8dcb91a-4eba-467d-861f-16cf66c69272&sid=c7b9c029-7d5e-43f2-8902-3efc7cbb49b6&p=1&sort=relevance",
    "Map Type": "Park Map"
  },
  {
    "Name": "Petrified Forest",
    "Description": "Located in northeastern Arizona, Petrified Forest National Park is an extraordinary destination for outdoor enthusiasts and history buffs alike. This captivating desert landscape is famous for its vast concentration of 225-million-year-old petrified wood, offering a glimpse into prehistoric life preserved in stone. The park forms part of the Chinle Formation, a geological treasure trove that also features the neighboring Painted Desert. Here, you'll find sweeping vistas of eroded cliffs adorned in vibrant shades of red, pink, and orange, thanks to layers of volcanic ash and bentonite clay. \n\nBeyond its mesmerizing geology, the park holds an archaeological and paleontological significance that's hard to rival. Over 350 protected Native American sites dot the area, preserving the cultural heritage of the ancestral Puebloans who once called this region home. Additionally, the park has unearthed dinosaur fossils that provide a window into the creatures that roamed Earth's landscapes millions of years ago.\n\nFor those seeking exploration, Petrified Forest National Park offers a range of scenic hiking trails catering to various skill levels. These trails lead visitors through otherworldly badlands, stark landscapes rich in petrified logs, and petroglyphs etched into rock faces. While camping directly within the park isn’t allowed, nearby camping options provide an ideal base for immersing yourself in this unique wilderness. Visitors can also enjoy breathtaking sunsets that set the Painted Desert aglow or take a journey along the 28-mile scenic drive to experience the park’s striking diversity.\n\nWhether you're captivated by ancient fossils, fascinated by geological wonders, or drawn to the stories of past civilizations, Petrified Forest National Park delivers a remarkable opportunity to connect with the natural and cultural history of the American Southwest.",
    "Location": "35.07,-109.78",
    "Established": "December 9, 1962",
    "Area": "221,390.21 acres (895.9 km2)",
    "Annual_Visitors": 505209,
    "Latitude": 35.07,
    "Longitude": -109.78,
    "AllTrails URL": "https://www.alltrails.com/parks/us/arizona/petrified-forest-national-park",
    "Map Link": "https://www.nps.gov/media/photo/collection-item.htm?pg=7323739&cid=305fb7af-a71b-469b-941e-a98b439c882f&id=fbbdcfeb-ea75-4b7d-b352-434e3f91439c&sid=ab05a1cb-2d77-4074-903e-c4afba7b4531&p=1&sort=relevance",
    "Map Type": "Park Map"
  },
  {
    "Name": "Pinnacles",
    "Description": "Nestled within California’s Coast Range, Pinnacles National Park is a haven for outdoor enthusiasts, offering a combination of unique geology, diverse wildlife, and exhilarating activities. The park’s striking rock formations—towering black and gold monoliths of andesite and rhyolite—are remnants of an ancient volcano, eroded over millions of years into dramatic spires and cliffs. These rugged structures draw rock climbers from far and wide, offering routes that range from novice-friendly to advanced challenges.\n\nFor hikers, the park boasts an extensive network of trails that wind through scenic canyons, rolling chaparral, and oak woodlands. Some trails lead to stunning vistas, providing panoramic views of the surrounding wilderness, while others venture into Pinnacles’ famed talus caves—formed by massive boulders wedged into narrow gorges. Exploring these caves is a one-of-a-kind adventure, with flashlight in hand, as they serve as a home to over 13 species of bats, including the rare Townsend’s big-eared bat.\n\nPinnacles is also an essential refuge for wildlife enthusiasts. The park is one of the few sanctuaries where visitors might spot the endangered California condor soaring overhead, a species brought back from the brink of extinction through intensive conservation efforts. Additionally, it supports a thriving population of prairie falcons, alongside countless other bird species that make this area a birdwatcher’s paradise.\n\nFor those seeking a deeper connection to nature, the park offers backcountry camping opportunities under some of California’s clearest night skies—perfect for stargazing and immersing yourself in the peaceful environment. Whether you’re climbing its rocky pinnacles, hiking its rugged trails, exploring its shadowy caves, or marveling at its wildlife, Pinnacles National Park delivers an unforgettable blend of adventure and natural beauty.",
    "Location": "36.48,-121.16",
    "Established": "January 10, 2013",
    "Area": "26,685.73 acres (108.0 km2)",
    "Annual_Visitors": 275023,
    "Latitude": 36.48,
    "Longitude": -121.16,
    "AllTrails URL": "https://www.alltrails.com/parks/us/california/pinnacles-national-park",
    "Map Link": "https://www.nps.gov/media/photo/collection-item.htm?pg=7323739&cid=305fb7af-a71b-469b-941e-a98b439c882f&id=245fbfaa-5bec-4d6e-a251-edac22cddb47&sid=81125f92-60b7-4e61-83ec-fccdee855218&p=1&sort=relevance",
    "Map Type": "Park Map"
  },
  {
    "Name": "Redwood",
    "Description": "A visit to Redwood National and State Parks offers an unforgettable experience in one of the world's most breathtaking natural landscapes. Home to ancient coastal redwoods—the tallest trees on Earth—this park system preserves nearly half of the planet's remaining old-growth redwoods. Amidst these towering giants, you'll find lush forests teeming with life, dramatic ocean vistas, and countless opportunities for outdoor exploration. \n\nThe park features three major river systems running through its richly diverse terrain, carving paths through valleys and feeding into the vibrant ecosystems. Along its 37 miles (60 km) of protected coastline, visitors can explore pristine beaches, uncover tide pools brimming with marine life, and marvel at striking seastacks rising from the water. From the dense forest canopies to coastal prairies and river estuaries, the park's varied landscapes support an impressive array of plant and animal species, including Roosevelt elk, black bears, and bald eagles.\n\nFor hiking enthusiasts, the park offers an extensive trail network ranging from short, family-friendly walks to challenging backcountry treks. Trails lead you through misty redwood groves, past cascading waterfalls, and up to panoramic viewpoints overlooking the Pacific Ocean. Campers can immerse themselves in the tranquility of nature, surrounded by the awe-inspiring presence of trees that have stood for thousands of years.\n\nRedwood National and State Parks sit atop a geologically active region, adding to the area's dynamic character. The park’s active seismic landscape not only shapes its rivers and cliffs but also serves as a reminder of the natural forces that have sculpted this incredible environment over millennia.\n\nWhether you’re a nature lover, a photographer, or simply seeking respite in the outdoors, Redwood offers something extraordinary. With its rare combination of towering forests, rugged coastline, and thriving ecosystems, this park invites visitors to connect deeply with one of the planet’s most remarkable natural treasures.",
    "Location": "41.30,-124.00",
    "Established": "October 2, 1968",
    "Area": "138,999.37 acres (562.5 km2)",
    "Annual_Visitors": 458400,
    "Latitude": 41.3,
    "Longitude": -124.0,
    "AllTrails URL": "https://www.alltrails.com/parks/us/california/redwood-national-park",
    "Map Link": "https://www.nps.gov/media/photo/collection-item.htm?pg=7323739&cid=305fb7af-a71b-469b-941e-a98b439c882f&id=d8e193ab-a456-4534-bde4-04c5f71429d6&sid=2cf52d31-e288-4b70-ae1c-4a8973b65aed&p=1&sort=relevance",
    "Map Type": "Park Map"
  },
  {
    "Name": "Rocky Mountain",
    "Description": "Set amidst the stunning landscape of Colorado, Rocky Mountain National Park showcases a breathtaking combination of towering peaks, serene alpine lakes, and diverse ecosystems spread across its rugged terrain. Spanning both sides of the Continental Divide, the park offers an impressive variety of habitats, from more than 150 crystal-clear riparian lakes to dense montane and subalpine forests and the windswept, treeless alpine tundra. This diversity makes the park a haven for wildlife enthusiasts, as it supports a wide range of species, including elk, moose, mule deer, bighorn sheep, black bears, and even elusive predators like cougars.\n\nAdventurers and visitors are drawn to signature destinations like Longs Peak, the park's iconic \"fourteener,\" standing at 14,259 feet, offering a challenging yet rewarding climb for seasoned hikers. Another must-see is Bear Lake, a picturesque, accessible spot that reflects the surrounding peaks and provides trailheads to numerous hikes suited for all skill levels. \n\nFor those preferring a scenic drive, the historic Trail Ridge Road is an experience not to miss. As you ascend to elevations exceeding 12,000 feet, you'll be treated to sweeping panoramic views of the surrounding valleys and mountains, interspersed with opportunities to spot wildlife and explore short trails right off the road. Keep an eye out for marmots and pika scurrying among the high-altitude rocks.\n\nRocky Mountain National Park's glacial valleys and igneous mountains offer year-round opportunities for exploration, from wildflower-laden meadows in the warmer months to snowshoeing and wildlife watching during the quiet winter season. Whether you're seeking challenging hikes, peaceful solitude, or the chance to connect with nature, the park's varied landscapes and abundant biodiversity make it a premier destination for outdoor enthusiasts.",
    "Location": "40.40,-105.58",
    "Established": "January 26, 1915",
    "Area": "265,847.74 acres (1,075.8 km2)",
    "Annual_Visitors": 4300424,
    "Latitude": 40.4,
    "Longitude": -105.58,
    "AllTrails URL": "https://www.alltrails.com/parks/us/colorado/rocky-mountain-national-park",
    "Map Link": "https://www.nps.gov/media/photo/collection-item.htm?pg=7323739&cid=305fb7af-a71b-469b-941e-a98b439c882f&id=4bc081d5-6c1f-4666-a865-128f68703615&sid=ea76ab53-0c4f-44d6-9406-cfbde1e3299b&p=1&sort=relevance",
    "Map Type": "Park Map"
  },
  {
    "Name": "Saguaro",
    "Description": "Saguaro National Park, a vibrant sanctuary in the heart of the Sonoran Desert, is a remarkable place where towering saguaro cacti dominate the landscape, creating an iconic silhouette against the expansive desert skies. The park is divided into two distinct districts, the Rincon Mountain District to the east and the Tucson Mountain District to the west, each offering its own unique blend of desert scenery and outdoor adventure.\n\nThis diverse desert ecosystem is home to six distinct biotic communities, showcasing an impressive array of plant and animal life. Beyond the iconic giant saguaro cacti—some of which can live over 150 years and grow to 40 feet tall—you'll find barrel cacti, cholla cacti, and prickly pear cacti scattered across the terrain. The plant life is adapted to the arid climate and bursts into colorful blooms during the spring, adding splashes of vivid color to the desert.\n\nWildlife enthusiasts can keep an eye out for a variety of species that have adapted to life in this dry environment. Among the notable inhabitants are the lesser long-nosed bats, crucial pollinators for the saguaro, as well as spotted owls and javelinas. In the quiet of the desert, you might hear the call of a cactus wren or catch a glimpse of a Gila woodpecker during your visit.\n\nFor outdoor enthusiasts, the park offers a range of activities. There are numerous hiking trails that cater to various skill levels, from easy walks through desert flats to challenging climbs with breathtaking views from higher elevations. Camping is available in the Rincon Mountain District, where backcountry sites provide a true connection to the serenity and isolation of the desert wilderness.\n\nThe park is also an educational treasure trove, providing visitors with insights into the natural and cultural history of the region. The saguaro is deeply tied to the culture and ecology of the desert, and learning about its role can offer a deeper appreciation for this stunning landscape.\n\nWhether you're immersing yourself in a quiet desert sunset, exploring the trails, or marveling at the resilience of life in one of the planet’s hottest climates, Saguaro National Park offers an unforgettable experience for nature lovers and adventure seekers alike.",
    "Location": "32.25,-110.50",
    "Established": "October 14, 1994",
    "Area": "92,876.75 acres (375.9 km2)",
    "Annual_Visitors": 908194,
    "Latitude": 32.25,
    "Longitude": -110.5,
    "AllTrails URL": "https://www.alltrails.com/parks/us/arizona/saguaro-national-park",
    "Map Link": "https://www.nps.gov/media/photo/collection-item.htm?pg=7323739&cid=305fb7af-a71b-469b-941e-a98b439c882f&id=706ef799-bd6f-4fff-bda4-7c9d05581be8&sid=c9eb629b-c105-4990-9eb3-13a9afc23f43&p=1&sort=relevance | https://www.nps.gov/media/photo/collection-item.htm?pg=7323739&cid=305fb7af-a71b-469b-941e-a98b439c882f&id=896a5b98-90e0-4902-adf4-3ec8c3bab200&sid=c9eb629b-c105-4990-9eb3-13a9afc23f43&p=1&sort=relevance",
    "Map Type": "Multiple Park Maps"
  },
  {
    "Name": "Sequoia",
    "Description": "Nestled in the heart of California's Sierra Nevada, Sequoia National Park offers an awe-inspiring mix of towering giant sequoia trees, dramatic alpine landscapes, and serene valleys. This park is a haven for nature enthusiasts, providing endless opportunities for hiking, backpacking, and scenic camping. The park is famed for the Giant Forest, home to some of the largest trees on Earth, including the General Sherman Tree—the largest measured tree by volume in the world.\n\nSequoia National Park’s natural wonders don't stop at its trees. The park encompasses more than 240 caves, each brimming with fascinating geological formations and underground ecosystems. Above ground, its rugged terrain includes a significant stretch of the Sierra Nevada mountain range, featuring Mount Whitney, which, at 14,505 feet, is the tallest peak in the contiguous United States.\n\nFor those seeking panoramic views, Moro Rock, a striking granite dome, offers a challenging but rewarding climb via a stairway carved into the rock. From its summit, visitors are treated to sweeping vistas of the surrounding wilderness. The park's diversity of landscapes also provides habitats for a rich array of wildlife, from black bears and marmots to a variety of bird species.\n\nSequoia National Park is a place where nature’s grandeur can truly be experienced in all its forms, making it a must-visit destination for outdoor adventurers and anyone eager to connect with the natural world.",
    "Location": "36.43,-118.68",
    "Established": "September 25, 1890",
    "Area": "404,062.63 acres (1,635.2 km2)",
    "Annual_Visitors": 1153198,
    "Latitude": 36.43,
    "Longitude": -118.68,
    "AllTrails URL": "https://www.alltrails.com/parks/us/california/sequoia-national-park",
    "Map Link": "https://www.nps.gov/media/photo/collection-item.htm?pg=7323739&cid=305fb7af-a71b-469b-941e-a98b439c882f&id=dd2e2a37-1ec5-4f86-939c-4d37d9136657&sid=8558dd8e-8331-4886-a32c-39a4f1a7f996&p=1&sort=relevance",
    "Map Type": "Park Map"
  },
  {
    "Name": "Shenandoah",
    "Description": "Nestled in the heart of the Blue Ridge Mountains, Shenandoah National Park offers a perfect getaway for outdoor enthusiasts. Known for its breathtaking vistas and cascading waterfalls, the park is a haven for hikers, campers, and anyone seeking to immerse themselves in nature. Its rolling hills are blanketed by thriving hardwood forests, which provide habitats for an incredible diversity of wildlife, from white-tailed deer and black bears to countless bird species.\n\nRunning through the park’s entire length is the iconic Skyline Drive, a 105-mile scenic roadway renowned for its sweeping views and accessibility to numerous trailheads. Similarly, the Appalachian Trail winds through Shenandoah, offering hikers the opportunity to explore part of this legendary footpath surrounded by serene landscapes.\n\nIn addition to the Appalachian Trail, Shenandoah boasts over 500 miles of marked hiking trails ranging from leisurely walks to challenging backcountry treks. Many paths lead to awe-inspiring overlooks, peaceful meadows, or the park’s renowned waterfalls, which are especially vibrant after a rainstorm.\n\nWhether enjoying a sunrise from one of the park’s overlooks, spotting wildflowers blooming along the trails, or camping under a starlit sky, Shenandoah’s unique blend of rugged nature and tranquil beauty makes it a destination worth exploring. With its rich biodiversity, varied trail system, and easy access to natural wonders, there’s something here to inspire adventurers of all skill levels.",
    "Location": "38.53,-78.35",
    "Established": "December 26, 1935",
    "Area": "200,445.92 acres (811.2 km2)",
    "Annual_Visitors": 1449300,
    "Latitude": 38.53,
    "Longitude": -78.35,
    "AllTrails URL": "https://www.alltrails.com/parks/us/virginia/shenandoah-national-park",
    "Map Link": "https://www.nps.gov/media/photo/collection-item.htm?pg=7323739&cid=305fb7af-a71b-469b-941e-a98b439c882f&id=eefb165e-1c50-4cee-82ce-7fa63aa675cb&sid=bbfb0de4-febf-482f-b695-566f4fce339c&p=1&sort=relevance",
    "Map Type": "Park Map"
  },
  {
    "Name": "Theodore Roosevelt",
    "Description": "Spread across the dramatic northern badlands, Theodore Roosevelt National Park pays homage to the conservation legacy of the 26th president of the United States. Encompassing three distinct units, this park offers a fascinating mix of history, adventure, and untamed wilderness. President Theodore Roosevelt's historic Maltese Cross Cabin, where he once found solace and inspiration, invites visitors to step back in time and learn about the personal experiences that shaped his deep commitment to conservation.\n\nOutdoor enthusiasts will find plenty to explore, from winding scenic drives that reveal sweeping vistas of rugged terrain to extensive backcountry trails that lead through remote and varied landscapes. The park is a haven for wildlife, with opportunities to catch sight of American bison roaming the plains, pronghorn darting through the grasslands, bighorn sheep scaling rocky slopes, and bands of wild horses embodying the spirit of the West.\n\nWhether you're drawn by the chance to hike among unique geological formations, spot diverse wildlife in its natural habitat, or simply enjoy the tranquility of an unspoiled environment, Theodore Roosevelt National Park offers an authentic and enriching outdoor experience. It's a place where history and nature come together, reflecting the values of a president whose time in these very landscapes helped inspire a lifelong dedication to preserving America's natural treasures.",
    "Location": "46.97,-103.45",
    "Established": "November 10, 1978",
    "Area": "70,446.89 acres (285.1 km2)",
    "Annual_Visitors": 668679,
    "Latitude": 46.97,
    "Longitude": -103.45,
    "AllTrails URL": "https://www.alltrails.com/parks/us/north-dakota/theodore-roosevelt-national-park",
    "Map Link": "https://www.nps.gov/media/photo/collection-item.htm?pg=7323739&cid=305fb7af-a71b-469b-941e-a98b439c882f&id=5f169c66-049e-4f55-8070-2b9c551c9e91&sid=ed2c9696-62ae-439c-8fff-0eeb0755d78a&p=1&sort=relevance | https://www.nps.gov/media/photo/collection-item.htm?pg=7323739&cid=305fb7af-a71b-469b-941e-a98b439c882f&id=0b9717f0-8f0b-490c-8af8-2f240995d5d5&sid=ed2c9696-62ae-439c-8fff-0eeb0755d78a&p=1&sort=relevance | https://www.nps.gov/media/photo/collection-item.htm?pg=7323739&cid=305fb7af-a71b-469b-941e-a98b439c882f&id=e0d2ec38-2e99-4094-85ef-9a324c4ef861&sid=ed2c9696-62ae-439c-8fff-0eeb0755d78a&p=1&sort=relevance",
    "Map Type": "Multiple Park Maps"
  },
  {
    "Name": "Virgin Islands",
    "Description": "Located on the picturesque island of Saint John, Virgin Islands National Park offers a paradise for outdoor enthusiasts and nature lovers. The park is renowned for its pristine tropical beaches, crystal-clear waters, and vibrant coral reefs, making it an ideal destination for snorkeling, kayaking, and exploring marine life. Beyond the shoreline, you'll find mangrove forests and seagrass beds that are teeming with biodiversity, offering a closer look at the delicate ecosystems that thrive in this Caribbean haven.\n\nHistory buffs will find intrigue in the park’s cultural heritage. Scattered across the landscape are ancient Taíno archaeological sites, offering a glimpse into the lives of the island’s indigenous people. Visitors can also explore the ruins of sugar plantations dating back to the colonial era, remnants of a time when Saint John played a role in the global sugar trade.\n\nThe park's diverse offerings make it more than just a beach destination. Whether you're camping under the stars, paddling along the serene coastlines, hiking lush trails, or immersing yourself in the area's rich cultural history, Virgin Islands National Park invites you to connect with its natural beauty and storied past. With so much to see and experience, it’s a place that encourages both adventure and reflection.",
    "Location": "18.33,-64.73",
    "Established": "August 2, 1956",
    "Area": "15,052.33 acres (60.9 km2)",
    "Annual_Visitors": 196752,
    "Latitude": 18.33,
    "Longitude": -64.73,
    "AllTrails URL": "https://www.alltrails.com/parks/us-virgin-islands/virgin-islands-national-park",
    "Map Link": "https://www.nps.gov/media/photo/collection-item.htm?pg=7323739&cid=305fb7af-a71b-469b-941e-a98b439c882f&id=b30ea551-542f-40d0-a0dd-dacdd716f61c&sid=d5675249-faee-4893-8539-0c4127c67fec&p=1&sort=relevance",
    "Map Type": "Park Map"
  },
  {
    "Name": "Voyageurs",
    "Description": "Voyageurs National Park offers a unique blend of breathtaking natural beauty, rich cultural history, and exceptional opportunities for water-based recreation. Located along the U.S.-Canada border, the park is defined by its vast network of interconnected waterways, making it a top destination for canoeing, kayaking, and island camping enthusiasts. At its heart are four expansive lakes—Rainy, Kabetogama, Namakan, and Sand Point—framed by a landscape sculpted by ancient glaciers. Visitors can explore a variety of natural features, including towering bluffs, intricate rock gardens, secluded bays, and more than 500 islands scattered across the waters.\n\nBeyond its striking landscapes, Voyageurs is steeped in history. For thousands of years, this area was home to the Ojibwe people, whose enduring connection to the land is reflected in the region’s name and cultural landmarks. The park also commemorates the French-Canadian fur traders, known as voyageurs, who navigated these waters during the 18th and 19th centuries as part of the fur trade. Later, the allure of gold brought miners to the area, adding another chapter to Voyageurs’ storied past. Several preserved historic buildings and sites throughout the park offer a glimpse into these diverse eras.\n\nFishing enthusiasts will find the park teeming with opportunities to catch walleye, northern pike, smallmouth bass, and more. For those seeking adventure on land, hiking trails wind through forests and along lakeshores, offering stunning views and a chance to spot local wildlife such as bald eagles, moose, and black bears. Voyageurs is also renowned for its night skies; far removed from city lights, the park provides incredible stargazing opportunities and occasional views of the northern lights. Whether you’re paddling through peaceful waters, soaking in vibrant sunsets, or delving into the area’s layered history, Voyageurs National Park promises an unforgettable outdoor experience.",
    "Location": "48.50,-92.88",
    "Established": "April 8, 1975",
    "Area": "218,222.35 acres (883.1 km2)",
    "Annual_Visitors": 221434,
    "Latitude": 48.5,
    "Longitude": -92.88,
    "AllTrails URL": "https://www.alltrails.com/parks/us/minnesota/voyageurs-national-park",
    "Map Link": "https://www.nps.gov/media/photo/collection-item.htm?pg=7323739&cid=305fb7af-a71b-469b-941e-a98b439c882f&id=04a21afb-ad47-4ae9-a196-925699d75640&sid=b958ffb9-3498-4006-af8f-429e8160f687&p=1&sort=relevance",
    "Map Type": "Park Map"
  },
  {
    "Name": "White Sands",
    "Description": "Nestled within the mountain-ringed Tularosa Basin in southern New Mexico, White Sands National Park is home to the largest gypsum dune field on Earth. Spanning the southern portion of a 275-square-mile expanse, these dazzling white dunes, composed entirely of gypsum crystals, create an otherworldly landscape. Unlike typical sand, gypsum doesn’t retain heat, so the dunes remain cool to the touch, making them perfect for exploration year-round.\n\nOutdoor enthusiasts will find plenty to love here. The park offers a variety of experiences, from scenic strolls on trails like the Interdune Boardwalk to more adventurous treks, such as the Alkali Flat Trail, which takes you deep into the heart of the dunes. Visitors of all ages can enjoy the joyful simplicity of sand sledding, a favorite activity that involves sliding down the soft, sparkling slopes on sleds, available for purchase at the visitor center.\n\nAs night falls, White Sands transforms into a stargazer's paradise. With minimal light pollution and expansive skies, the dunes provide an unparalleled opportunity to witness the brilliance of the Milky Way and countless constellations. The park regularly hosts ranger-led Full Moon Hikes and other night programs that highlight the unique beauty of the area after dark.\n\nWhile planning your trip, it’s important to note that White Sands is completely surrounded by White Sands Missile Range, an active military testing site. Periodic closures of the park may occur during missile tests, so checking for updates before your visit is essential. Despite this, the combination of striking natural formations, endless recreational opportunities, and unique night skies makes White Sands National Park a must-visit destination for outdoor enthusiasts and nature lovers alike.",
    "Location": "32.78,-106.17",
    "Established": "December 20, 2019[111]",
    "Area": "146,344.31 acres (592.2 km2)",
    "Annual_Visitors": 705127,
    "Latitude": 32.78,
    "Longitude": -106.17,
    "AllTrails URL": "https://www.alltrails.com/parks/us/new-mexico/white-sands-national-park",
    "Map Link": "https://www.nps.gov/media/photo/collection-item.htm?pg=7323739&cid=305fb7af-a71b-469b-941e-a98b439c882f&id=1da1a6be-0621-4ac2-a69a-73305158dca2&sid=abd1f4c8-a7ca-4c58-83ee-82a2d653576d&p=1&sort=relevance",
    "Map Type": "Park Map"
  },
  {
    "Name": "Wind Cave",
    "Description": "Tucked away in the rolling hills of South Dakota, Wind Cave National Park offers a captivating blend of subterranean wonders and above-ground beauty. Beneath the surface lies one of the longest caves in the world, famed for its intricate boxwork formations—delicate calcite structures that resemble honeycombs and are rarely found anywhere else on Earth. The cave also features frostwork, fragile needle-like crystal growths that dazzle explorers with their intricate beauty. Adding to the cave’s mystique, it “breathes” as air flows in and out, caused by changes in atmospheric pressure.\n\nAbove ground, the park transitions into a stunning mixed-grass prairie, speckled with iconic American wildlife. Visitors can spot herds of bison grazing against a backdrop of wide-open skies, prairie dogs popping in and out of their burrows, and perhaps even catch a glimpse of the elusive black-footed ferret, one of the rarest mammals in North America. Beyond the prairie, ponderosa pine forests rise, providing a home for majestic elk and stealthy mountain lions. The park’s rich ecosystem makes it a haven for wildlife enthusiasts and hikers alike.\n\nWind Cave holds deep cultural significance for the Lakota people, who consider it a sacred site of creation. Exploring this park, with its unique blend of geological marvels, diverse ecosystems, and cultural history, offers a multifaceted experience for outdoor enthusiasts and those seeking a deeper connection to the natural world.",
    "Location": "43.57,-103.48",
    "Established": "January 9, 1903",
    "Area": "33,970.84 acres (137.5 km2)",
    "Annual_Visitors": 607418,
    "Latitude": 43.57,
    "Longitude": -103.48,
    "AllTrails URL": "https://www.alltrails.com/parks/us/south-dakota/wind-cave-national-park",
    "Map Link": "https://www.nps.gov/media/photo/collection-item.htm?pg=7323739&cid=305fb7af-a71b-469b-941e-a98b439c882f&id=b36e6786-5888-4dbc-905a-5bc895d46346&sid=9d8d162d-f15c-45fa-9c37-13a7bf5d2c4d&p=1&sort=relevance",
    "Map Type": "Park Map"
  },
  {
    "Name": "Wrangell–St. Elias",
    "Description": "Wrangell–St. Elias National Park and Preserve is the largest national park in the United States, spanning a vast and remote wilderness filled with glaciers, towering mountain ranges, and endless opportunities for adventure. This remarkable destination is where the Alaska, Chugach, Wrangell, and Saint Elias mountain ranges converge, creating a rugged landscape that includes some of North America’s tallest peaks and volcanic formations. Among these giants is Mount Saint Elias, which soars to an impressive height of 18,008 feet, standing as the second-tallest peak in both the United States and Canada.\n\nGlaciers dominate over a quarter of the park’s area, forming an otherworldly expanse of ice and snow. Highlights include the massive Hubbard Glacier, a tidewater glacier that extends into Disenchantment Bay; the sprawling Malaspina Glacier, a rare piedmont glacier that fans out onto coastal plains; and the Nabesna Glacier, one of the longest valley glaciers in North America. These icy features not only shape the park’s dramatic topography but also provide a striking contrast to the lush tundra and boreal forests found at lower elevations.\n\nFor outdoor enthusiasts, Wrangell–St. Elias offers unparalleled opportunities for exploration. Remote camping, backcountry hiking, and mountaineering allow visitors to experience the park’s pristine wilderness firsthand. With vast stretches of land that remain largely untouched by modern development, adventurers can immerse themselves in an environment that feels truly wild. Wildlife such as bears, moose, mountain goats, and caribou roam throughout the park, adding to the sense of connection with nature.\n\nWhether you’re drawn to the challenge of scaling icy peaks, the fascination of exploring glacier-carved valleys, or the serenity of camping beneath endless stars, this vast and awe-inspiring park invites you to discover a little piece of Alaska unlike anywhere else in the world.",
    "Location": "61.00,-142.00",
    "Established": "December 2, 1980",
    "Area": "8,323,146.48 acres (33,682.6 km2)",
    "Annual_Visitors": 65236,
    "Latitude": 61.0,
    "Longitude": -142.0,
    "AllTrails URL": "https://www.alltrails.com/parks/us/alaska/wrangell-st-elias-national-park-preserve",
    "Map Link": "https://www.nps.gov/media/photo/collection-item.htm?pg=7323739&cid=305fb7af-a71b-469b-941e-a98b439c882f&id=43237bf4-4d5b-4e69-84f4-8e9e10e7bca2&sid=b8cab70c-adbe-48ef-8723-ef0a4c2e8810&p=1&sort=relevance",
    "Map Type": "Park Map"
  },
  {
    "Name": "Yellowstone",
    "Description": "Yellowstone National Park, established in 1872 as the first national park in the world, is a treasure trove of natural wonders and a haven for outdoor enthusiasts. Spanning over 2 million acres in the heart of the United States, Yellowstone is renowned for its unique geothermal features, extraordinary landscapes, and abundant wildlife. The park lies atop the Yellowstone Caldera, one of the largest active volcanic systems on the planet. This activity gives rise to a vast network of geothermal areas, including bubbling mud pots, steaming fumaroles, and rainbow-hued hot springs like the iconic Grand Prismatic Spring. Yellowstone boasts over 500 geysers, the most famous being Old Faithful, which punctuates the landscape with its impressive eruptions, delighting visitors with its predictability and power.\n\nThe park’s rugged beauty is further defined by the Grand Canyon of the Yellowstone River, a dramatic, yellow-tinged chasm carved by the river over millennia. Its striking colors and thundering waterfalls, including the awe-inspiring Lower Falls, offer breathtaking viewpoints and excellent hiking opportunities. Yellowstone is also intersected by four mountain ranges, providing a backdrop of towering peaks and expansive vistas for adventurers who explore its trails or backcountry.\n\nWildlife lovers will find Yellowstone to be one of the richest ecosystems in North America. More than 60 species of mammals call the park home, including apex predators like grizzly bears, black bears, wolves, and elusive lynxes, as well as large grazers such as bison and elk. The park’s bison herd, the oldest and largest in the country, is a particularly extraordinary sight. Birdwatchers can also enjoy spotting a variety of species, from majestic bald eagles to trumpeter swans.\n\nBeyond its natural spectacles, Yellowstone offers a range of outdoor activities including hiking, camping, fishing, and cross-country skiing in winter. Its extensive trail system caters to visitors of all skill levels, from short day hikes to challenging backcountry treks. Every season reveals a different facet of the park’s beauty, making Yellowstone a destination worth visiting time and time again.",
    "Location": "44.60,-110.50",
    "Established": "March 1, 1872",
    "Area": "2,219,790.71 acres (8,983.2 km2)",
    "Annual_Visitors": 3290242,
    "Latitude": 44.6,
    "Longitude": -110.5,
    "AllTrails URL": "https://www.alltrails.com/parks/us/wyoming/yellowstone-national-park",
    "Map Link": "https://www.nps.gov/media/photo/collection-item.htm?pg=7323739&cid=305fb7af-a71b-469b-941e-a98b439c882f&id=dc30085e-3713-4a8f-856b-19ac1c566066&sid=9fafd61e-8128-475f-bb36-02f1bcb63c93&p=1&sort=relevance",
    "Map Type": "Park Map"
  },
  {
    "Name": "Yosemite",
    "Description": "Nestled in California's Sierra Nevada mountains, Yosemite National Park is a haven of breathtaking natural beauty and endless outdoor adventure opportunities. Known worldwide for its towering granite giants, cascading waterfalls, and ancient groves of giant sequoias, the park offers something remarkable at every turn. The iconic Half Dome and El Capitan loom majestically over the glacier-carved Yosemite Valley, drawing climbers and photographers alike. El Capitan, one of the world’s most challenging climbing destinations, and Half Dome, known for its exhilarating hiking route, are testaments to the park's dramatic geology. \n\nYosemite Falls, plunging 2,425 feet (739 meters), ranks as one of the tallest waterfalls in North America and is a must-see for visitors, especially during the spring when snowmelt creates its most powerful flow. In addition to Yosemite Falls, the park boasts other magnificent waterfalls like Bridalveil Fall and Vernal Fall, which are equally awe-inspiring and accessible via picturesque trails. \n\nBeyond its iconic landmarks, Yosemite is home to three giant sequoia groves, where you can stand in the shadows of some of the oldest and tallest trees on Earth. The Mariposa Grove, the largest of these, offers trails to see wonders like the Grizzly Giant and the Tunnel Tree. These ancient giants provide a window into the forest's rich ecological history.\n\nThe park's diverse ecosystems range from lush meadows and rugged high-country terrain to pristine wilderness that supports a wide variety of plant and animal species. Many of these, such as the Sierra Nevada bighorn sheep or the Yosemite toad, are rare and found only in this region. For those eager to explore, Yosemite offers over 750 miles of hiking trails, from serene walks through meadows to multi-day backcountry treks leading to remote alpine lakes and peaks.\n\nYosemite's appeal extends year-round, with each season offering a unique experience. Spring brings roaring waterfalls and blooming wildflowers, summer is perfect for rock climbing, camping, and stargazing, while the fall brings quieter crowds and vibrant autumn colors. Come winter, the park transforms into a snowy oasis, opening up opportunities for snowshoeing, cross-country skiing, and even ice skating at the Curry Village rink.\n\nWhether you're an avid climber, a devoted hiker, or simply someone seeking to connect with nature, Yosemite National Park's awe-inspiring landscapes and diverse ecosystems provide an unforgettable experience, blending adventure with tranquility in one of America’s most treasured outdoor destinations.",
    "Location": "37.83,-119.50",
    "Established": "October 1, 1890",
    "Area": "761,747.50 acres (3,082.7 km2)",
    "Annual_Visitors": 3667550,
    "Latitude": 37.83,
    "Longitude": -119.5,
    "AllTrails URL": "https://www.alltrails.com/parks/us/california/yosemite-national-park",
    "Map Link": "https://www.nps.gov/media/photo/collection-item.htm?pg=7323739&cid=305fb7af-a71b-469b-941e-a98b439c882f&id=c51f64fd-51dc-400e-b562-d02789c95933&sid=72ac2be9-bc64-4248-b383-7fa251c57e5f&p=1&sort=relevance",
    "Map Type": "Park Map"
  },
  {
    "Name": "Zion",
    "Description": "Zion National Park offers a captivating blend of natural wonders, making it a favorite among outdoor enthusiasts. Known for its striking steep canyon walls, the park is home to a network of trails that cater to all levels of hikers. Whether you're looking for a casual stroll or a challenging adventure, Zion delivers with its wide array of options. Among its most iconic experiences is hiking The Narrows, a stunning journey through the Virgin River's slot canyon, where hikers wade through water beneath towering sandstone walls.\n\nSituated at the meeting point of the Colorado Plateau, Great Basin, and Mojave Desert, Zion's unique geography has created a landscape that is both diverse and awe-inspiring. Sandstone formations dominate the scenery, with dramatic mesas, intricate rock towers, and deep canyons carved over millions of years. The Virgin River serves as the lifeblood of the park, shaping its terrain and sustaining its ecosystems.\n\nZion’s wilderness is divided into four distinct ecosystems: desert, riparian, woodland, and coniferous forest. This variety supports a wide range of plant and animal species, making it a fascinating destination for wildlife watchers and nature lovers. Visitors might catch glimpses of desert bighorn sheep along the cliffs, peregrine falcons soaring through the skies, or rare plant species tucked away in shaded alcoves.\n\nFor those who enjoy camping and extended exploration, Zion offers numerous campgrounds that provide access to its breathtaking landscapes. Stargazers will find the park an enchanting spot, as its remote location offers clear, dark skies perfect for observing constellations and the Milky Way. Whether you’re drawn to its geological wonders, hiking opportunities, or ecosystems teeming with life, Zion National Park promises a memorable outdoor experience with something to inspire every adventurer.",
    "Location": "37.30,-113.05",
    "Established": "November 19, 1919",
    "Area": "147,242.66 acres (595.9 km2)",
    "Annual_Visitors": 4692417,
    "Latitude": 37.3,
    "Longitude": -113.05,
    "AllTrails URL": "https://www.alltrails.com/parks/us/utah/zion-national-park",
    "Map Link": "https://www.nps.gov/media/photo/collection-item.htm?pg=7323739&cid=305fb7af-a71b-469b-941e-a98b439c882f&id=7b9188c0-d895-4d8c-acd2-e7df9a911c15&sid=a132afac-aaf3-41a0-9904-f2daf5189264&p=1&sort=relevance",
    "Map Type": "Park Map"
  }
]